[[{"review_title": "nice", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "8 Dec 2020", "job_title": "Customer Support in Kraków", "duration": "N/A", "pros": "work environment, salary, bonus language", "cons": "night shifts, phone support, schedules"}, {"review_title": "Appalling, keep away", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "10 Jan 2021", "job_title": "Senior Manager", "duration": "N/A", "pros": "A company losing its spirit", "cons": "Atrocious management, low adherence to ethics, appalling treatment of people, and grotesque belief in KPIs"}, {"review_title": "Needs to change ... and quickly", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "2 Jul 2020", "job_title": "Manager", "duration": "N/A", "pros": "-\tSome smart people\r\n-\tApp strong\r\n-\tPotential for a strong underlying business", "cons": "-\tPoor HR and Finance (2 CFOs left within last 12 months) functions due to no experience based leadership ever being in place\r\n-\tLittle middle management\r\n-\tSenior management team lack experience\r\n-\tA lot of people with Ivy League CV’s but very limited experience who think they know it all\r\n-\tMany Department and Functional Heads missing or under qualified\r\n-\tPerformance review process (4 times a year) used as a way to identify people to fire – not a two-way process where weaknesses can be worked on\r\n-\tConstant talk about A players – but no definition of that other than being willing to work 14 hrs a day 7 days a week and do what you are told – long hours does not mean more productivity\r\n-\tEmployees are viewed as a commodity – one company objective is to exit underperformers (not PIP, assist or mentor – underperformance is <50% - with average performance not much higher)\r\n-\tOverall strategy lacking hence objectives change constantly and are solely driven by CEO – also results in multiple people working on the same problem in isolation\r\n-\tTotal micromanagement from top down (that is by design), thousands of KPIs each quarter – why employ senior people and then tell them how to do their job."}, {"review_title": "Worst HR-payroll ever.", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "4 Nov 2020", "job_title": "Anonymous Employee in Kraków", "duration": "N/A", "pros": "It used to be nice", "cons": "HR, Payroll, Team Leader, Beneficts being reduced."}, {"review_title": "Do not work in Revolut. Ever", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "16 Jun 2020", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "-Good product\r\n-Well-known brand\r\n-Catchy CV line\r\n-Smart people around you (in general)\r\n-OK perks (free food, drinks, taxis, etc)\r\n-In general interesting job content", "cons": "Frankly, there are so many problems, it is hard to summarise it all, but let me try to organise them from a higher/company level to a more niche/functional. \r\n\r\nCULTURE \r\n- Toxic and worst I ever saw. Very political, super hierarchical. It is not a startup, but huge corporate machine. \r\n- There were few comments below about favoritism, it is true \r\n- if you are a friend of CEO/SVP Revenue/Head of Legal \r\n- you have a chance in this company. If god forbid you tell those guys truth in their face - you can just leave the next day, your life in Revolut will be miserable. \r\n- Revolut is a company of one man, and nobody inside are able to stand up against CEO's opinion or decisions even though when everybody in the room understand he tells BS. \r\n- Culture is a fear driven, people are scared to be fired, and in the most recent environment and lack of job options elsewhere that results in the fact that most folks just conform with the stupidity and nonsense that is going on inside. \r\n\r\nCOMPANY \r\nYou may hear a lot from recruitment teams and hiring managers, but just know one thing - they lie. They are desperate to hit their recruitment KPIs which they are measured on, hence they have full incentive to tell you whatsoever, to make sure you sign the contract. Keeping you in the company is a problem and KPI of HR team, hence Recruitment dont care. \r\n\r\nPeople development is not a company priority, really. Most probably, L&D person will respond to my review and explain everything is different - but trust me, no one cares about your growth in this company. \r\nThis is what you will get in Revolut: \r\n- Nobody cares about your development \r\n- Nobody cares about your wellbeing \r\n- Nobody cares about your health (especially mental because it will be brought to extreme edge) \r\n- Nobody cares about you. \r\n\r\nYou are just a resource for CEO/Revolut to get from point A to point B. Once you hit your own limit (and you will, in many cases not because of your professional limitations but due to unreasonable targets that are being increased every 3 months without and proper logic behind it), you will be considered as redundant and get fired. \r\n\r\n- People are being fired in 1 day. On all levels. You met with your manager yesterday, discussed long term plans and how you will organise the work in the next 2-3 months, and the next thing you know, her/his account is deactivated next morning and unless you exchange phone numbers, you will never hear from this person ever again.\r\n\r\nFUNCTION \r\n- Reading articles on Wired, you may have noticed departure of 2 CFO, 1 deputy CFO and 1 Head of Finance over 1.5 years. Churn in Finance leadership is worse than in customer support organisation. \r\n\r\n- As a result, finance function is one big problem in Revolut, company doesn't even know how much cash they are burning every month. Instead of relying on accounting function and proper reporting tools, in a typical for Revolut manner they diverted group of developers to build another in-house half-baked solution to prepare financial results for the company which are being considered as 100% correct. \r\n\r\n- Accounting team is severely understaffed. My team mates were suffocating with the amount of work load and information to process, working for 14-16 hours a day and in the end either fired or considered as underperforming. I heard CEO saying at the finance function-wide meeting: \"You are just an accountant\". This is the attitude you are going to get if you hold ACCA, multi-years in Big4 and join this company. \r\n\r\nI feel I didnt express enough but I hope this should warn some bright people and prevent them from joining this filthy institution. While I have met some fo the smartest people in the world here, I warn future stars to not choose to work in Revolut. \r\n\r\nI think only this kind of market boycott will make the leadership think about how much they value employees as humans and not human resources."}, {"review_title": "Toxic Culture", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "5 Aug 2020", "job_title": "Marketing in London, England", "duration": "N/A", "pros": ". Pays well\r\n. Good for the resume", "cons": ". Almost everyone is afraid of upper management, specially the CEO\r\n. CEO micromanages everything, including areas he doesn't understand and does not have enough time to understand\r\n. Articles on wired and other new sources are true"}, {"review_title": "Good experience", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "27 Sept 2020", "job_title": "Data Sienctist in London, England", "duration": "N/A", "pros": "Experience, interesting projects, environment, people, fair play", "cons": "Not always clear how to switch projects"}, {"review_title": "Completely haphazard", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "28 Oct 2020", "job_title": "Senior Financial Crime Analyst in London, England", "duration": "N/A", "pros": "flexible hours\r\n£15 deliveroo credit per day you can use after 7pm", "cons": "no communication within the business\r\nhigh expectations\r\nculture is non existent \r\nyou can tell they don't care about you"}, {"review_title": "Fast-paced company setting new standards in the business", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "29 Jun 2020", "job_title": "Operations in Kraków", "duration": "N/A", "pros": "Very dynamic environment, changes happening everyday - you feel to be a part of the product with a real chance to impact it.", "cons": "No cons spotted at this stage (there are many challenges the company is facing, but work assignment to tackle them is very efficient) - get it done!"}, {"review_title": "Great company", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "12 Nov 2020", "job_title": "Janitor/Cleaner in London, England", "duration": "N/A", "pros": "Awesome treatment by staff and management", "cons": "Have not been able to find any"}], [{"review_title": "It;s okay", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "16 Nov 2020", "job_title": "RevOps Consultant in London, England", "duration": "N/A", "pros": "Good stuff, i like it here", "cons": "not much, everything is okay"}, {"review_title": "Engineering at Revolut", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "7 Sept 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "I am writing this review as I believe the current positive and negative reviews are not helpful and potentially misleading.\r\n\r\nFirst of all, the company is growing at the speed I have never experienced before. You need to understand this and count this in when making any decision. Most of the cons and pros described below are coming from fast growth. Because of growth an rapid changes, my review probably should be considered outdated within a year.\r\n\r\nSecond of all, most of the people in the company are incredibly motivated, passionate, smart, polite and pleasant to work with, but relatively young and inexperienced. This is slowly changing as the company matures.\r\n\r\nThird of all, there is indeed very small amount of processes and bureaucracy in the company, which is again is great and frustrating at the same time.\r\n\r\nWhat I consider the main pros here:\r\n- Revolut has a unique and addictive spirit of freedom, being part of something world-changing and understanding of your personal mission within the company. There are many things you can take over and improve. You also have full freedom to act smart and design something in the best way. Often you will have to create something that was never done before ever (this is partially why being smart is sometimes more valued than being experienced here). No one will stop you - there are more things to do then people. If you will demonstrate the ability to improve things, you will be given all resources to grow. \r\n- Exposure to business. Everything is transparent here, and you get to know a lot of people and understand their daily job. Very good for understanding how a growing startup works and a must if you are thinking of making a company in the future.\r\n- Multiple office locations. Sometimes mentioned in the cons, but I like this feeling of globality. Working remotely is not discouraged - after all, Revolut is made for travelers.\r\n- Colleagues. They are nice and smart. I don't notice competitiveness.", "cons": "- Long working hours are often mentioned here among the cons. Even though if no one is forcing you to stay after 6 pm, people indeed often end up working late. There are two main reasons for this: 1) many things are disrupted by growth and are disorganized and 2) working is addictive when it is causing a big impact. Working long hours is respected and valued and is not expected by default. Same relates to working at weekends.\r\n- Rudeness and ignorance. This is entirely not true for the majority of the company, especially engineering. There are some teams with the aggressive and provocative culture which is a must in their daily job, but logical reasoning and common sense are respected and valued universally on all levels. Also, do not confuse rudeness with trader mentality.\r\n- Chaos and frustration. This is somehow true and I believe the reason is rapid growth. The code base is very solid and reliable though. TDD is a must. Generally speaking, things have improved massively over the last years and are on the right path.\r\n- benefits. Compared to Facebook, Google, etc, they are indeed very insignificant. Same with salaries - they are not low, but some companies offer more. Yet still, we have applicants from those companies.\r\n\r\nI would not advise you working for Revolut if you find it easier to work with a pre-defined set of responsibilities. You will be frequently getting out of your comfort zone and doing things you never did before. It is also possible you might burn out - work is addictive and no one will stop you, but neither you will be pushed.\r\n\r\nTo sum up, you have to choose between chaotic but exciting and boring, but established. Revolut is the first."}, {"review_title": "Good to start", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "6 Nov 2020", "job_title": "Support Specialist in Porto, Oporto", "duration": "N/A", "pros": "Nice environment\r\nEasy to learn\r\nGood company culture", "cons": "Work load not well divided between agents"}, {"review_title": "Not honest employer", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "25 Sept 2020", "job_title": "Financial Crime Analyst in Warsaw, Masovia", "duration": "N/A", "pros": "Nice office conditions, many nationalities. One can use their language skills.", "cons": "Company that does not adhere to employment law. Not good atmosphere. One dies not feel stable."}, {"review_title": "This company does not deserve your effort", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "15 Jun 2020", "job_title": "FinCrime Analyst", "duration": "N/A", "pros": "It's a good line on your CV, that's it.", "cons": "I have always been a top performer at work, and I moved to Poland just to take this role with Revolut. I thought this was a once in a lifetime opportunity. Now I really hope it is, because I never want to have an experience like this again.\r\n\r\nThere is no training provided here. You get a one week company induction, not related to your role and that's it. You are then expected to start working immediately.\r\n\r\nI had to learn most processes and workflows by myself because most of my probation period was spent working from home during lock down. I improved my own quality score to 100%, which I thought was great, but no. The company does not care about the quality of your work, only quantity. I thought this was fine, as I was clearly overachieving the productivity target anyway.\r\n\r\n2 weeks before the end of my probation, management completely changed our KPIs. This wasn't just a slight tweak, it was a huge overhaul. They changed what counted as productivity without understanding the daily work of the department. This meant I had to relearn how to do the job in order to achieve this ridiculous new target. I wasn't alone, 3/4 of the team could not achieve the new target. despite the challenge, I more than doubled my score, but it wasn't enough. I was released at the end of my probation due to \"under performance\" I don't understand how they could have come to that decision, with all the hard work and dedication I put in prior. I was told \"Sorry, it's the end of your probation and you're not at 100% of the target. Bye\" They waited until my last day to let me know.\r\n\r\nOur team had huge backlogs, with customers waiting 3+ days for assistance. I spent most of my last 2 weeks trying to clear this, but management didn't consider this to be \"productive\" as it didn't contribute to targets, despite customers still being team priority. Going above and beyond your line of duty is not valued or respected here.\r\n\r\nI was so incredibly naive to think that my contribution was valued\r\n\r\nBecause of this, I was left stranded in Poland for 2 months without any source of income. Revolut don't care...\r\n\r\nIt makes me feel so sick when I see Revolut posting about \"valuing\" employes on social media.\r\n\r\nTo summarize:\r\n\r\n- Management does not care if you are good or bad at your job, they just care about quantity of work done.\r\n\r\n- Management do not offer any support or guidance to employees, until the day they want to fire them\r\n\r\n- Being a team player or going above and beyond in any situation is not valued, in fact, they don't care. They only care about productivity.\r\n\r\n- Management will completely change KPIs and expectations with no guidance and they will quickly fire you if you don't achieve them, even if you have to completely relearn how to work to achieve them.\r\n\r\n- Management don't even know about the work that they are setting KPIs for\r\n\r\n- Little to no training provided."}, {"review_title": "Fun place to work at!", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "21 Oct 2020", "job_title": "Customer Service Specialist in Porto, Oporto", "duration": "N/A", "pros": "Awesome benefit pack\r\nExcellent teams with open-minded people\r\nMarvellous facilities", "cons": "Rotating shifts (expected as the company works 24/7)\r\nUnrealistic goals"}, {"review_title": "Not Applicaable", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "7 Oct 2020", "job_title": "Operations Analyst in London, England", "duration": "N/A", "pros": "Good to work at this company.", "cons": "No cons . good to work at this company"}, {"review_title": "Great to work for", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "24 Sept 2020", "job_title": "Associate in London, England", "duration": "N/A", "pros": "Smart motivated people across the company", "cons": "Pretty high turnover of people"}, {"review_title": "Better wait 2-3 years for this company to get organized.", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "30 Jan 2020", "job_title": "Customer Support in Kraków", "duration": "N/A", "pros": "- Beautiful office\r\n- Smart, youthful, ambitious colleagues\r\n- Really good referral bonus. Something like 1200 GBP.\r\n- Multinational office\r\n- They sort out residency for you. You pay all government fees, but no legal fees.\r\n- If you do not have a lot of work experience you will move up the ranks very quickly, as they are expanding rapidly, and desperate to fill management positions.", "cons": "- VERY disorganized. There was even some information missing from my contract when I signed. \r\n- No real leadership.\r\n- Scaling very quickly so everything is very muddled right now.\r\n- Management is very very bad and completely inexperienced."}, {"review_title": "Great if you are the right culture fit", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "27 Aug 2020", "job_title": "Product Owner in London, England", "duration": "N/A", "pros": "- No bureaucracy\r\n- Fast paced\r\n- Highly ambitious\r\n- High level of responsibility", "cons": "- Management could be better\r\n- We haven't found the right performance management process yet"}], [{"review_title": "Satisfaction", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "10 Nov 2020", "job_title": "FinCrime Analyst in Porto, Oporto", "duration": "N/A", "pros": "People, values, work from home", "cons": "Shift work, working on weekends"}, {"review_title": "Great employer", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "28 Oct 2020", "job_title": "Associate", "duration": "N/A", "pros": "Flexible hours. You get to be surrounded by smart people.", "cons": "Staff turnover is too high"}, {"review_title": "Great company to work for but senior leadership must be exited and replaced", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "1 Sept 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "flexible work, autonomy, ability to drive processes forward. Great opportunities", "cons": "hiring of people in leadership position with no empathy or people management skills"}, {"review_title": "Purely delivery-oriented", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "14 Sept 2020", "job_title": "Tech Recruiter in London, England", "duration": "N/A", "pros": "Entrepreneurial and fast-paced environment\r\nGood place to boost your CV and get challenged daily", "cons": "Numbers and KPI-centred organisation. Only delivery and productivity counts\r\nLack of human touch"}, {"review_title": "Hard place, but good opportunities", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "24 Oct 2020", "job_title": "Fincrime Team Lead", "duration": "N/A", "pros": "wide possibilities to grow within the company", "cons": "work-life balance is not a priority"}, {"review_title": "Avoid", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "30 Jan 2020", "job_title": "Senior Software Engineer in London, England", "duration": "N/A", "pros": "- Cool office space.\r\n- Many people I've meet were very nice, knowledgeable, and humble.\r\n- No one tells you how to do things, as long as you get things done (this also proved to be one of their issues).", "cons": "- Arrogant management.\r\n- Probation period goals poorly defined and most of the times not measurable.\r\n- Lack of support or direction during your probation period. You'll have to constantly chase your line manager to give you feedback and luckily he/she won't be too busy.\r\n- No one will tell you whether you passed the probation period or not, even though they are supposed to give you a written confirmation.\r\n- Blame culture. Instead of focusing on solutions and fixing problems or educating people, some senior engineers / managers prefer to just make fun of other people's lack of skills or point fingers.\r\n- People are treated as disposable and will be let go during their probation period for no reason. With luck, they will tell you \"you're not a good fit for the company\".\r\n- They tell you that no one forces you to work long hours, but the tasks they give you during your probation force you to work many extra hours and during the weekend.\r\n- Job spec advertised completely different from the actual work you'll do (given the speed at which the company is growing, you'll end up doing really crappy work that other people who've been longer in the company don't want to do)."}, {"review_title": "Good", "rating": "3.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "11 Oct 2020", "job_title": "Business Development Manager in London, England", "duration": "N/A", "pros": "Good atmosphere and dynamic environment", "cons": "low salary and huge turnover"}, {"review_title": "very nice", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "27 Oct 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "a very good place to work for", "cons": "It was very nice, really"}, {"review_title": "Revolut", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "22 Oct 2020", "job_title": "Business Customer Support in Porto, Oporto", "duration": "N/A", "pros": "Facilities are good. Fresh fruits and snacks", "cons": "Stressful. Threatened to be fired several times"}, {"review_title": "Great Atmosphere", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "14 Oct 2020", "job_title": "Tech Administration", "duration": "N/A", "pros": "- people mindsets - supportive, ready to help", "cons": "not founded - everything works as it should"}], [{"review_title": "So far so good", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "4 Oct 2020", "job_title": "IOS Software Developer in Berlin", "duration": "N/A", "pros": "Smart people, nice salary and office", "cons": "A lot of work, high pressure"}, {"review_title": "Toxic culture from top to bottom", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "11 Oct 2020", "job_title": "Analyst", "duration": "N/A", "pros": "Great product, learnt a lot about processes", "cons": "Toxic culture \r\nNarcissistic CEO who belittles and talks down to people publicly"}, {"review_title": "Excellent place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "10 Sept 2020", "job_title": "Finance", "duration": "N/A", "pros": "- Flexible place to work.\r\n - Lots of responsibility\r\n - Good work life balance", "cons": "Sometimes the office runs out of kombucha"}, {"review_title": "You will grow", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "17 Aug 2020", "job_title": "Technical Recruiter in London, England", "duration": "N/A", "pros": "Great opportunity to grow and learn a lot. Fast paced environment", "cons": "Management make no sence. Processes and structures changed 3-4 times per 2 years"}, {"review_title": "Startup", "rating": "2.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "23 Jun 2020", "job_title": "Business Support Specialist in Porto, Oporto", "duration": "N/A", "pros": "People are nice and super helpful. You will learn a lot.", "cons": "Schedules and too young leadership. No processes defined and no career path. A bad balance between personal and professional life."}, {"review_title": "Not perfect", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "6 Oct 2020", "job_title": "Customer Support Representative in Kraków", "duration": "N/A", "pros": "A really fast developing company", "cons": "No transparency and no lack of reasonable management"}, {"review_title": "Awesome.", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "7 Oct 2020", "job_title": "Anonymous Employee in Porto, Oporto", "duration": "N/A", "pros": "Salary. Co workers. Rewards. Location. Ambience.", "cons": "A lot of work hours. Flexibility of schedule. Difficult enterviews."}, {"review_title": "be prepared to go", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "10 Sept 2020", "job_title": "Recruiter", "duration": "N/A", "pros": "salary, industry, smart people, equipment, relocation options", "cons": "lack of proper management, once you underperform or mismanaged count yourself gone"}, {"review_title": "Could be great, but...", "rating": "2.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "18 May 2020", "job_title": "FinCrime Analyst in Kraków", "duration": "N/A", "pros": "-Nice benefits/perks.\r\n\r\n-Easy to move between teams/departments.\r\n\r\n-Flat hierarchy.\r\n\r\n-Great coworkers... that you are not able to know. \r\n\r\n-You learn a lot.\r\n\r\n-Things change in a matter of hours or days. This is good and bad.\r\n\r\n-Great product. \r\n\r\n-Dynamic environment.", "cons": "-It's just another corporation with a nice disguise, and it's a business-first one, you feel like you are doing outsourcing, you are just a number. \r\n\r\n-You go to the office knowing that any day can be your last day, they even boast during the onboarding process of firing entire teams. \r\n\r\n-As everything turns around the KPIs it's not an easy thing to get to know your co-workers, there is no time for that. \r\n\r\n-Managers and team leaders with zero experience and no idea about managing people. \r\n\r\n-There are no personal development plans or career paths.\r\n\r\n-Shifts and working on weekends because there is not enough space for the employees in the office.\r\n\r\n-The procedures get outdated from one day to another -are split into different places- and if you have doubts there is no SMEs, is your problem to figure out the right thing -no one can guarantee that the solution you get from your team leader/manager is the correct one... and that's your problem, not his/her-. \r\n\r\n-Disorganized place. Amateur behavior. \r\n\r\n-No feedback, good or bad, because the team leaders/managers don't care as long as the KPIs are met."}, {"review_title": "Interesting Product but Poor Work-life Balance", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "27 Aug 2020", "job_title": "Product Owner in Vilnius", "duration": "N/A", "pros": "Owning the whole product life-cycle, exciting and innovative product", "cons": "Work-life balance, not all processes are clear"}], [{"review_title": "Worst job", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "18 Oct 2020", "job_title": "Android Developer in Moscow, Moskva", "duration": "N/A", "pros": "Good office, good sallary, famous company", "cons": "If you have your own opinion you will be fired\nIf you do not want overwork you will be fired\nToxic environment"}, {"review_title": "Great company to work for", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "15 Sept 2020", "job_title": "Senior IOS Developer in London, England", "duration": "N/A", "pros": "Good environment and friendly team members", "cons": "None that I can think of"}, {"review_title": "TERRIBLE", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "9 Sept 2020", "job_title": "Senior Recruiter in London, England", "duration": "N/A", "pros": "Im bashing my head against the wall to come up with one...", "cons": "The worst company I ever had the \"pleasure\" of working for. I don't think this field has enough characters for me to describe how \"well\" I was treated..."}, {"review_title": "Designer at Revolut", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "18 Sept 2020", "job_title": "Visual Designer in Moscow, Moskva", "duration": "N/A", "pros": "Nice experience, relocation, high growth, interesting tasks", "cons": "Work processes, culture, politics, promotion"}, {"review_title": "I should have trusted those bad reviews on Glassdoor myself", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "11 Apr 2019", "job_title": "Recruiter", "duration": "N/A", "pros": "Location and office is really cool but hey.... so as many other offices and not many companies have a great culture. Revolut definitely doesn't belong to them.", "cons": "This is where the fun starts... If you want to work in the company full of arrogant people and never being appreciated on top of super long hours and low pay in comparison to other companies on the market- then go ahead and apply. Just prepare yourself that you will burn out very quickly in the environment like that.  If you need any help with your job, prepare yourself for not getting it but the expectations will always stay the same (!). They will always blame you for something that is out of your control.  If you do your normal hours 9-6 and you leave at 6, people think that you work part-time. \r\nThe management team only know how to demotivates their stuff. The company could benefit from many changes but they are not willing to listen (and they are getting rid of people who want to change things) thanks to CEO's vision. \r\n It was probably the worst company I was working for and it is a big relief not to be working in such a toxic environment. \r\n\r\nFan fact:  if you are not a coder or have strong analytical mind or financial background -  you are not worth anything. Sounds like fun working for such a company? Not really if you care for your mental health."}, {"review_title": "All good", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "2 Sept 2020", "job_title": "Customer Support Representative in Kraków", "duration": "N/A", "pros": "Nice office, great people, cool encironment", "cons": "No life/work balance, demanding KPI's"}, {"review_title": "one huge chaos", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "2 Nov 2020", "job_title": "FinCrime Analyst in Kraków", "duration": "N/A", "pros": "Salary is definitely above the average in compliance in Poland", "cons": "chaos, constant changes of tactics, unprofessional team leaders"}, {"review_title": "Need improvement on structure and communication", "rating": "3.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "19 Jun 2020", "job_title": "Software Engineer in London, England", "duration": "N/A", "pros": "Many decent individual engineers to work with.", "cons": "Week engineering culture & communications"}, {"review_title": "Work at Revolut", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "29 Aug 2020", "job_title": "Customer Service Representative in Kraków", "duration": "N/A", "pros": "Good Pay on time. Possibility of Growth", "cons": "A demanding job, tough employee assessment process."}, {"review_title": "Culture really needs to improve", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "28 Jun 2020", "job_title": "Product Owner in London, England", "duration": "N/A", "pros": "Great product and ambitious company", "cons": "- you can't bring your best authentic self since they expect you to be cold and aggressive like the CEO\r\n- only motivation to do your job is out of fear\r\n- the company doesn't really care about your career"}], [{"review_title": "Data Science", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "11 Jul 2020", "job_title": "Data Scientist in London, England", "duration": "N/A", "pros": "Steep learning for someone interested in practical knowledge", "cons": "Based in Canary Wharf and so have to mix with Pinstriped suits"}, {"review_title": "Happy employee and customer", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "30 Jun 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- smart and hard working employees \r\n- there is a great sense of teamwork\r\n- open to feedback allowing for improvement", "cons": "none, enjoying and appreciating working at Revolut"}, {"review_title": "No development option", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "8 Jul 2020", "job_title": "Customer Support Specialist in Kraków", "duration": "N/A", "pros": "Lots of nice people who you can get new skills and knowledge from", "cons": "Unfortunately, there is no transparent path for career growth"}, {"review_title": "Stockholm Syndrome", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "28 Feb 2019", "job_title": "Analyst in London, England", "duration": "N/A", "pros": "-Learn and do a lot because they essentially hire 1 person to fill the role of 3\r\n-Work with some really bright, passionate people \r\n-Company will continue to grow rapidly off the backs of people working insane hours to meet the unreasonable KPIs set by management", "cons": "-Salary does not match the illegal working hours which are \"your choice\" (but you will be penalised and berated if you do not work over the weekend or try to leave work at a reasonable time)\r\n-You will honestly develop Stockholm Syndrome during your time at the company as it is the only way to deal with the way you're treated\r\n-You will get messages at all hours requesting you to do work\r\n-Not seen as human by the company\r\n-Get demeaning and accusatory messages from management for things that are beyond your control\r\n-Unable to keep up with or form meaningful relationships outside of Revolut as you only have time to manage relationships within/relating to the company\r\n-Unreasonable KPIs and goals with no matching resources to support you in reaching these goals\r\n-\"Do first, ask forgiveness later\" mentality in regards to things such as consumer protections and communications"}, {"review_title": "Compliance analyst", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "22 Jun 2020", "job_title": "Compliance Analyst in Kraków", "duration": "N/A", "pros": "Evolving company, lots of things to learn, incredible people", "cons": "The recruitment didn’t go well, also, during the COVID pandemic some people were fired"}, {"review_title": "Pay attention to the Wired articles on culture", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "26 Jun 2020", "job_title": "Manager", "duration": "N/A", "pros": "Funky office and good benefits", "cons": "The company culture is toxic. There is a huge focus on attracting A-players, but no work done to nurture and retain them.\r\n\r\nManagement are not held to account for the fact they are responsible for this poor culture."}, {"review_title": "I knew it was going to be bad and some how it ended up being worse", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "21 May 2020", "job_title": "Backend Engineer in London, England", "duration": "N/A", "pros": "+ Generally nice people\r\n+ IT requests answered very fast\r\n+ Lot’s to learn about what not to do when you become a leader", "cons": "Technology:\r\nI was told Revolut hated using frameworks like Spring which is great I thought since I tend to avoid frameworks too!\r\n\r\nSo I was shocked to discover when I joined that the CTO had written a trash framework himself that he forces everyone to use!\r\n\r\nWorst of all if you complain about his framework he tells you - it’s only a few classes so it shouldn’t get in the way of anything when it gets in the way of anything and then you fail your probation (luckily I was never vocal).\r\n\r\nThis means the code at Rev is just a gigantic bunch of hacks around a trash framework.\r\n\r\nAlso they don’t use CQRS - that’s just a straight lie. \r\n\r\nAlso, instead of using an existing message queue like Kafka or something else they decided to build their own which has so many problems with reliability and missing features I don’t even know what to say. \r\n\r\nCulture\r\nAs you can tell from the other reviews - the culture sucks & they make you work weekends, deadlines etc...\r\n\r\nBut the worst part of this whole thing is that one day you come in to work & you see your work friend’s Slack account has been deactivated - no warning just fired. This has happened to me a dozen times at Rev now.\r\n\r\nAlso you’ll regularly see people shouting at each other in person like genuinely arguing in the middle of the floor.\r\n\r\nHR\r\nThere is no HR - the head of people is a lackey of the CEO with zero HR experience. \r\n\r\nAlso, they monitor your slack so be careful.\r\n\r\nCEO\r\nNik is very smart guy! I really like him as a person having worked with him - he’s very driven & gives good advice. But and this is a big but - Nik sadly isn’t mature enough to be a CEO of a company in our stage.\r\n\r\nWe need to move the focus away from growth & invest in building PnL so I think right now is the right time for him to step down and for Rev to find an experienced CEO to drive the company to profitability."}, {"review_title": "Great place for engineers", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "26 Jun 2020", "job_title": "Operations Manager in London, England", "duration": "N/A", "pros": "Competitive salary\r\nGreat onboarding process\r\nScope for progression", "cons": "Long hours required at times"}, {"review_title": "f", "rating": "2.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "18 Jun 2020", "job_title": "Head of Human Resources Systems and Payroll Delivery in London, England", "duration": "N/A", "pros": "Its an Okay place to work", "cons": "It is Not very inclusive"}, {"review_title": "Worst management ever", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "6 May 2020", "job_title": "Product Owner in London, England", "duration": "N/A", "pros": "+ smart colleagues \r\n+ great for learning and development", "cons": "Senior management treats employees as mere numbers. CEO openly said managers should gladly let under-performers go during townhall and pointed out employees are being lazy when everyone in the company literally works all the time even during weekend. Good managers are those who can fire employees without a blink. Company recently introduced quarterly performance reviews so they have more opportunities to fire people. \r\n\r\nManagement rules by intimidation. If employees don’t follow certain process or meet certain deadlines, their bonus will get deducted. Senior managements often openly harass employees, calling people idiots and micro manage every little aspects. Some employees are also being let go simply because they disobey orders from above. The remaining employees become too afraid to speak out and just work hard to satisfy requirements from senior management. You don’t get praise when doing a good job but imagine the worst when you screw up. \r\n\r\nPolitics in the company drive teams to work against each other. Every team is too busy optimising their KPI without thinking long term. \r\n\r\nNo resources nor support are provided for personal development. There are materials on HR portal for it but they are not useful at all. \r\n\r\nClimbing up career ladder in Revolut is a suicide mission. Avoid at all cost."}], [{"review_title": "bad", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "17 Aug 2020", "job_title": "IT Engineer in London, England", "duration": "N/A", "pros": "free deliveroo after 5\r\ngood management", "cons": "bad work life balance\r\nworking overtime and no pay\r\nculture is bad"}, {"review_title": "Dire", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "5 May 2020", "job_title": "Operations Manager in London, England", "duration": "N/A", "pros": "- Good Salaries\r\n\r\n- Great office space\r\n\r\n- Free Deliveroo", "cons": "You only have to read some the most recent reviews to understand what it's like to work at Revolut.\r\n\r\n\"A lot of good people around but culture is awful\"\r\n\"No work life balance, Management only cares about your works not you.\"\r\n\"Top down micro management and unachievable targets\"\r\n\"Innovating company but complete wrong management\"\r\n\"Bad management, poor HR practices, would avoid\"\r\n\"Not recommended even if Revolut brand name big\"\r\n\r\nThere is no real autonomy to make a difference. Teams are not empowered to set and focus on longer term strategies. Senior leadership style is more of a dictatorship, with teams simply closing actions coming from the top. It's dire.\r\n\r\nVery open about company willingness to fire people with a '0% underperformance target by the end of 2020 at any cost' objective. \r\n\r\nGeneral vibe is unfriendly and unsupportive.  Glassdoor responses feel PR driven rather than respond to actual issues. You simply cannot sugar coat how the company acts.\r\n\r\nYes, we may be building a rocket ship, but unless we develop a heart as a business, it's gonna crash."}, {"review_title": "Waste of potential", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "21 Apr 2020", "job_title": "Customer Support Specialist in Porto, Oporto", "duration": "N/A", "pros": "Nice office, fully packed with amenities and food. Flexible environment, nice and open work mates, Uber rides for late shifts, home office possible, welcome gifts on onboarding, food parties, possiblity to grow to different areas.", "cons": "Bad management, insane KPIs that make no sense and that never change despite circumstances that can affect productivity. Super-flexibility required since things/procedure/rules change can change every day and if you are not aware your work performance can be severely damaged. Company works like an informal group chat: many opinions, new rules are set in the dead of night with no consultation of other teams to measure impact, useless talks mixed with important announcements, a complete mess. Despite issues exist, big bosses are aware but ignore resolution. Procedures are more and more designed to focus on results (numbers) and less on quality (for the customer and workers). Not a good stable place to develop a career."}, {"review_title": "Compliance", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "15 Apr 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Very good place to acquire vast experience; good skills are appreciated.\r\nIf you love what you do and you are ready for challenges, they are ready to provide you with the opportunities to develop towards desired directions.", "cons": "Salaries do not make any sense, there are enormous discrepancies between people in the same team, even if their prior experience is not any different.\r\n\r\nThey never keep what they say; the company has made multiple promises to employees that they have completely failed to comply; HR changes the rules on the go and management makes employees do things they did not sign up for, just because \"things change\", completely changing the working conditions."}, {"review_title": "A lot of good people around but culture is awful", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "2 May 2020", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "* A lot of passionate and talented people around;\r\n* Quite high salaries;\r\n* You can get a promotion and/or stock options after half-year performance reviews;\r\n* The company offers relocations if you're interested.", "cons": "* The company positioned as an Agile company. Now there are a lot of managers, managers of managers, heads of managers, etc.;\r\n* Plans are constantly changing;\r\n* The CTO wants every developer to use TTD, but in reality the process of software development is often NDD (Nik driven development) as Nik personality likes to set not achievable goals and to push \"product owners\" to deliver things in extremely tight deadlines (using his own motto \"get **it done\"). It leads to long working hours and burnouts. You can't say anything good about quality in such an environment; \r\n* No QA (literally: there are 3 QA engineers, who are working with mobile developers, no QA for the frontend or backend at all);\r\n* Recently they added 2 other opportunity to fire people. This is 2 additional performance periods (so it's 4 performance periods a year). They call it \"performance checkpoint\" and it happens quarterly now. With the only difference: there is no way to get a promotion or bonus, but you can get fired;\r\n* The performance review process is broken: you can ask people to review you, but the only opinion which is important is the opinion of your \"product owner\", which obviously can be biased + \"product owners\", as they are mostly non-technical people, don't really understand what exactly you've done + last \"performance checkpoint\" all the POs were ultimately asked to decrease marks they set for their team members;\r\n* As a result they started to fire people without warnings (about 100 people this quarter based on some internal rumors);\r\n* The way how they fire people is awful: this is an often case, when you have a meeting with a person in the morning, but next day you see just \"Account deactivated\" in Slack; \r\n* They use the \"product owner\" term which can sound like this is a position described in some Agile frameworks, but don't let to fool yourself: this is just a word they use to call ordinary product managers. Most of them don't own their products and act as proxies between Nik and a team. Also, micromanagement is one of the favourite strategies to manage people;\r\n* You never know what you should do to get a promotion or a pay raise. The only way to get is your \"product owner\" specifically asks to promote you, but considering they fire people (and \"product owners\" as well) often, there is a chance to find yourself in a team with a person as a manager who barely knows anything about you and how you've worked."}, {"review_title": "Work culture is awful", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "1 Jun 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "The product itself is amazing, and it's exciting to watch it develop so quickly.", "cons": "The culture is by far the worst I've ever experienced. Many people don't know how to work together and will do whatever it takes to get ahead. I wouldn't even call the senior management team \"managers\". To them a work-life balance is laughable and unimportant. The turnover rate is alarmingly high."}, {"review_title": "Aiming to recruit the best!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "12 Nov 2019", "job_title": "Senior Manager", "duration": "N/A", "pros": "After 8 interviews/video calls and a home analytical exercise that consumed 25 man hours, I bought into the high performing culture that is Revolut.  I was inspired by all the good, bad and ugly available on internet about the company; and overwhelmingly resonated with my work style and desire to work with a company that welcomes innovation, gsd mindset and people's pursuit of doing things better, different, faster etc.  Feels like I have joined a company that truly embraces risk/reward for high performing individuals.  Also seems that all the 'showmanship' leaders/manages with egos, abrasive communication style and selfish mindsets are unwelcome.  And that is a great thing!", "cons": "No cons as too early.  However I embrace the opportunity to work with the team to build a culture that is fit for the company's Lifestage today, noting high growth period would come with teething problems/personal stress etc.  I welcome the opportunity to showcase how we can be a high performing team in a collegial respectful, continuous learning environment."}, {"review_title": "Revolut is a great place to grow", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "3 Mar 2019", "job_title": "Customer Support Specialist in Kraków", "duration": "N/A", "pros": "Revolut is giving you the option to grow, and they are helping you to find your best skills and develop them. The atmosphere and culture is really good, I am really happy to be here and be a part of this company. In case of any difficulties, there are a lots of people that are here to help and understand what is wrong. If you want to spread your wings and learn, and be better version - join revolut :)", "cons": "Unfortunately, there is a a small sense od competition here. In our office, on the huge screen, all the emplyess are able to see who was the best in the last 24 hours. Who has the best productivity. This is not good. You making us feel that we need to start a race with our collegaues and for some, this is not fun. If you want to motivate us to be better, just let us know. We will try harder, but to do that, we do not need to see the best 5 people in the office."}, {"review_title": "Call centre of high volume, low quality... chaos!", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "6 May 2019", "job_title": "Customer Service Agent in Kraków", "duration": "N/A", "pros": "Decent salary package if you want to live in Krakow Poland. Unfortunatly the air pollution in Krakow is pretty bad.\r\nColleagues were decent.", "cons": "A lot of cultural hurdles if you are not Polish.\r\nSchedule took no consideration of staff. You could be rostered for 10 days straight. Then have a possible 4 days off yet the manager in charge of scheduling would give you a shift in the middle of a 4 day break. \r\nManagement was too young and inexperienced. \r\nJob was purely about numbers of chats. No quality in service.\r\nHR was straight from the Soviet era - worst I have seen globally. All smiles before you start, then they think you are their personal labour force to treat as they please. No recourse for questioning or discussion.\r\nAll over a poor experience with an immature \"company\"."}, {"review_title": "Great Company Culture", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "2 Dec 2019", "job_title": "Copywriter in London, England", "duration": "N/A", "pros": "From the interview process through to my offer, the company faced negative press about the company culture head on. I find this to be a really honest approach to a difficult topic.\r\nNow working here, I find that there is a decent work-life balance, as long as you make boundaries. All the work can be done in time, as long as you work efficiently and don't waste time. I'd recommend it to people - especially as it's growing, so the right time to come in and invest effort into making it a global giant.", "cons": "Onboarding is a total baptism by fire and needs major restructuring to help new starters get settled and comfortable with their work and resources. Other colleagues are friendly and willing to help, but it's all a bit up in the air."}], [{"review_title": "An opportunity you cannot lose!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "14 Feb 2018", "job_title": "Customer Support Team Leader in Kraków", "duration": "N/A", "pros": "- young, international and ambitious team\r\n- flexible working hours, possibility to work remotely\r\n- extra benefits such as dinner and taxi ride home if you're staying up late in the office, gym membership, private medical healthcare package\r\n- biannual evaluations with potential salary raise\r\n- high-paced environment where you can learn a lot, show off your skills and instantly implement great ideas while working with different teams across multiple offices\r\n- frequent trainings and options to grow within the company\r\n- great company culture and direct contact with senior management\r\n- good communication between teams, weekly updates about the product development\r\n- you always get a constructive feedback from your management, but also recognition for your hard work. They'll make sure to use all of your potential!", "cons": "- job might be stressful and under pressure\r\n- high targets\r\n- you need to be able to handle multitasking"}, {"review_title": "Bumpy start but I'm here to stay.", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "18 Feb 2019", "job_title": "Talent Acquisition Manager in London, England", "duration": "N/A", "pros": "I made the conscious decision to move to a start-up organisation because I wanted to integrate myself in an organisation in its early years & make an impact. I feel like I am achieving just that. I've watched a lot change at Revolut in a short space of time and being in an organisation that is constantly evolving and advancing has been so refreshing. I look forward to what the future has to hold here.\r\n\r\nTake the negative feedback here with a BIG pinch of salt.\r\nYes - this company isn't perfect and it still has the occasional growing pain, but (for those who want to make an impact) the potential here is phenomenal.", "cons": "I joined the business over 6 months ago and I joined at a time where communication wasn't clear or shared in full, so the company was very reliant on the initiative of employees. \r\nThis has calmed down significantly now and all the teams have stronger structures (although initiative is still required!)."}, {"review_title": "You need to be passionate", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "22 Feb 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- You work in a very energetic and dynamic environment. Things are happening fast here. \r\n- Everyone is really passionate about the company. It's not a 9 to 5 kind of job. People love it and are giving everything to drive the changes\r\n- You have a real impact and consistently have a feeling of accomplishments. This is different from working in huge corporations.\r\n- Direct and honest culture. People raise issues when they see it, are honest to give direct feedback. So things actually move faster here, people are not afraid to speak up.", "cons": "- Work-Life Balance. Well, no one is making you stay longer. But as you get so enthusiastic about the work, you tend to do that on your own. Also, you're always overwhelmed with the ideas about your job, so you simply don't want to delay it.\r\n- Direct Culture. It works great for me, but some other people feel pressure and are not used to that style."}, {"review_title": "No structure, disorganised and bad culture", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "26 Apr 2019", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Free soft drinks \r\nDeliveroo if working after 7", "cons": "The company has absolutely no structure, couldn’t find HR even if they were standing in front of you and mangers don’t actually know how to manage. \r\nThe culture is basically work until you bleed, working late is normal without paid overtime - 7/8/9pm people still at work. \r\nThe company is not very diverse. \r\nVery clique orientated \r\nThe excuse of still being a “start up” is absolutely rubbish standard work place processes are not hard to establish. \r\nHolidays - 22days which is the lowest I’ve seen. \r\nNo common sense. \r\nNo real employee perks. \r\nIf you don’t fit in to their ‘culture’ you’ll probably get excluded. \r\nCould label this one of the worst companies to work for."}, {"review_title": "Revolut is a great place to grow", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "3 Mar 2019", "job_title": "Customer Support Specialist in Kraków", "duration": "N/A", "pros": "In Revolut you have a great option to grow and develop yourself. Everyone here is really trying to help you find your best skills and focus on them. Also, we have a really great and chill atmosphere.", "cons": "The issue is with competitions. This is not a normal corporation, this is true. But still, we can see the list of targets and who is the best in the whole team in the last 24 hours. We can see names of out colleagues on the huge TV and their scores. This is not motivation for most of the people. It would be much better to not see the scores of other people. You just need to tell us - do your best, and we will try harder. Really."}, {"review_title": "So glad I did not trust the social media", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "1 Nov 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "I was slightly concerned after I had accepted the offer and all the publications went off after a few days but all the things vanished since I started:\r\n\r\n- The product and the company literally changes the world. It's a perfect opportunity to come in and leave your mark.\r\n- All the people you work with are very competent. In all the departments! Haven't met anyone with no clue why he/she was hired. \r\n- Never counts your work hours. It's how smart you are with your job. If you could deliver great results in less time, no one will care how much time you spent on them (don't trust what the media is saying!)\r\n- Being surrounded by top people and using your creative mindset allows you to grow 5x faster\r\n- Salaries and perks are great.", "cons": "- When the growth is that fast sometimes is tough to pause and follow all the updates timely"}, {"review_title": "Software Developer", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "3 Mar 2019", "job_title": "Front End Developer in London, England", "duration": "N/A", "pros": "+ C-level staff is reachable and extremely open\r\n+ Employees are being valued by the things they helped company to achieve\r\n+ No micromanagement\r\n+ Highly performant and influencing colleagues\r\n+ Fast-paced environment, literally you see the result of your efforts on a constant basis", "cons": "- (minor) Some years ago there was much overtime, but otherwise we wouldn't be able to reach that we have for now, yet there are much things to do."}, {"review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "23 Jan 2018", "job_title": "Head Of Operations in London, England", "duration": "N/A", "pros": "+ Full of both analytical challenges\r\n+ Fast paced environment\r\n+ Eat what you kill culture\r\n+ Great environment for self-development\r\n+ Gain unique perspective on the latest development of banking innovation\r\n+ Opportunities for those who are hungry and super hardworking\r\n+ From ideation, ownership to execution, you make actual real-world impact\r\n+ Smart risk taking\r\n+ Great company culture - a group of smart, competitive, hardworking people who wants to make an impact on the world. (Most start ups claim to have good company culture, and they will claim all of the above, but working in one of the largest start up co-working spaces in Europe I can tell you Revolut employees definitely work at least 1.5X harder than most other start up employees. Consequently, we are one of the fastest growing start ups in Europe.)", "cons": "Not everyone will be able to keep up the fast-paced/high pressure environment."}, {"review_title": "I highly advise you NOT to work for Revolut, don't get tricked by their fancy office!", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "18 Dec 2019", "job_title": "Customer Support Specialist in Porto, Oporto", "duration": "N/A", "pros": "Snacks and coffee. Jacket and a backpack with a Revolut logo. Enjoy.", "cons": "If you can and are not completely desperate, then look for a job somewhere else.  Don't get hired by Revolut,  you can hardly find a worse company to work for, with one exception that is Teleperformance Portugal, I guess. \r\n\r\nYou are in a loop of sending automatized messages all day long without actually having any change to truly help a customer as no-one knows what to do and how things really work. Even worse, the performance targets are set up unrealistically that no one can achieve them. A colleague of mine got a panic attack from the overload and stress they put on you. Salary is decent to Portuguese standards but you are not going to know your schedule more than two weeks ahead so say goodbye to any work-life balance as it's non-existent."}, {"review_title": "Toxic culture, top down", "rating": "2.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "31 May 2020", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Cool product and brand, smart people", "cons": "Unsupportive, fear-driven culture that stifles collaboration and openness, little to no feedback, not even a vague understanding of how to nurture talent and get the best from employees. Completely chaotic."}], [{"review_title": "Somewhere in the middle", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "7 Feb 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Mix of finance and technology is a really nice idea, and they do it good. But their competitors have exactly the same thing too, so the other parts of the product and the service must be superior to get ahead, which is not. The Pros are the new joiners who keep this company running", "cons": "Senior management, top management whatever you call it. They have zero experience and zero idea what is going on. Most of them seem like they were recruited directly from high school graduates, which I believe most of them are. It likely it wont change, and it will take the company down with them. The CEO cant speak english properly."}, {"review_title": "Threats and long hours, HR is blind.", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "24 May 2020", "job_title": "Support in Kraków", "duration": "N/A", "pros": "Some level of independency\r\nNice perks (before covid)", "cons": "There's no tracking whatsoever of how many hours employees work. No one will *make* you stay for longer but if you don't you're going to be outperformed and fired. \r\nConstant threats from management, objectives do not make sense, everyone is tricking the system to look better on the performance charts.\r\nCompany ethics is really questionable, the product is not used by most employees.\r\nPromotions or new \"roles\" does not come with raise or additional pay."}, {"review_title": "Worst company I've ever worked for", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "5 Jun 2020", "job_title": "Customer Support Specialist in Porto, Oporto", "duration": "N/A", "pros": "They try really hard to appear cool with all the free food and ping pong tables but, at the end of the day, the company environment is toxic.", "cons": "Please try reading the article written, on  4 June 2020, by Wired UK named:\r\n\r\n\"Revolut staff claim they’ve been told to quit their jobs or be fired\" \r\n\r\nI can assure you that everything described happened exactly how they wrote because they did it to me as well.\r\n\r\nIf you have the chance to work elsewhere, please save yourself from this nightmare.\r\n\r\nI've been reading the company's responses to all the reviews and just a warning: don't be fooled by their pre-formatted and automatic answers. In reality, things are way worse than they claim."}, {"review_title": "An honest review", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "2 Jun 2020", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "This will be my honest review. I joined Revolut a few months ago and was excited to join a challenging environment. I recently resigned due to a combination of reasons, which is unusual because people are usually terminated here, they don't really get to resign.\r\n\r\nPros:\r\n\r\n1) You will learn a lot. The learning curve is steep here from the moment you join. I think I had a couple hours introduction and the next day I was submerged in work. I learnt more in the first couple of weeks here than I did in previous jobs.\r\n\r\n2) You will not be bored. I have not come across anyone who just sat around with nothing to do. You are pretty much at full capacity most of the time.\r\n\r\n3) Free healthy snacks. Cheeky perk, but it they have free breakfast, drinks, snacks etc.\r\n\r\n4) Free Deliveroo after 7pm (£15 including delivery cost)\r\n\r\n5) Intelligent people below middle management. I worked predominantly with data people and they were some of the most competent and smart people I have worked with.\r\n\r\n6) The results of your effort are seen. Revolut is output focused, What is good is that they implement a way for you to see how your individual KPI impacts different levels of the company. i.e. Team KPI, Department KPI, Company KPI.", "cons": "To be honest, I actually left because I ended up having mental health problems because of working at Revolut, to the point where I suffered from daily panic attacks and breathing problems, and ended up in hospital. I found that while working there I became more toxic and angry. Even my partner had noticed I was always stressed and severely unhappy. However, I'll try to be fair with the cons and provide explanation.\r\n\r\nIf you want to skip all the details I summarised the 7 points right at the bottom.\r\n\r\nCons:\r\n\r\nGeneral:\r\n\r\n1) No work-life balance. You will work minimum 9-12 hours a day - I sometimes was in office till midnight or later. That's why they offer the perk of free UBER trips from the office to your house if you are in office past midnight. The perk is there for a reason. I'm not saying this is an objectively bad thing. Some people like this kind of lifestyle and that is fine, for me it wasn't great. In my opinion, this isn't a place you would want to work at if you want to maintain a life outside of work. Again, this is debatable depending on what you want out of life.\r\n\r\n2) The culture is very toxic. Management (middle, senior, execs) view people as resources and not people. They say they are changing, and they will probably reply to this review saying 'They are working on it...', but trust me when I say: this is not a priority for the company. They are output driven, which means they don't care how the results are produced, as long as they are produced; even if that means working 15 hours a day, everyday. \r\n\r\nWhen I was joining, I was assured that they are working on improving their culture and focusing on employees. This was not true, at all. Essentially, they just implemented a room with curtains that you can pull shut, where you could go if you were stressed to relax a bit. But here's the catch - since deadlines don't move and everything is output driven, - the longer you stayed in that room, the longer you had to stay after hours just to meet the demanding deadlines. Bottom line: it wasn't much help and this was Revolut's only solution to mental health problems in the work place, even after the hundreds of review comments via internal surveys and platforms like Glassdoor telling management, that the current work place is not sustainable for most people.\r\n\r\nJust to summarise: you probably won't be seen as an individual unless you get to a level in management. BUT there are a small amount of teams which implement their own culture and phenomenal to work for... I just hope you get into one of these few teams, if not.... god bless you and good luck.\r\n\r\n3) Management are way too inexperienced - most of the managers there aren't people who have experience in their role, but are in exec positions because they were early employees. This leads to certain problems:\r\n\r\n - Young successful people in high positions are trying to prove that they deserve their exec levels, so they implement unreasonable targets and asks which people below have to run around and jump through hoops to meet.\r\n\r\n- Just pure inexperience and lack of leadership and direction - sometimes it honestly feels like they don't know what they are doing and then saying they need something 10 mins before a meeting. There have been instances where management have agreed to implement something by a deadline only to find that they don't even have data to complete the task because management didn't discuss anything with the data people and just guessed if they had information or not. Which again means that people below have to bend over backwards.\r\n\r\n- Just unprofessional - Its not uncommon for people to yell at each other there and management to get at each others throats because there is simply no communication between them (again: inexperience). Sometimes because of no experience management does not understand the weight of the words they write or say. They are senior managers and a lot of people look up them. They can be often inappropriate, and since they are young, they don't quite grasp that some of things they say can cause serious problems... I get that they are a start-up but if you want to be a bank (or just a respectable company), you should probably act with some more professionalism.\r\n\r\nAgain to summarise - young inexperienced people are in really high places here.\r\n\r\n\r\n4) The concept of 'A-Players'. Revolut is obsessed with this term. Essentially they only want the best of the best to work for them. Don't misunderstand: they do not want to train and develop their employees to become A-players and grow. NOPE. They want people to be A-players right when they join. Whats-more, is that this terms has created a divide in the company into the 'GREATS' and the 'COMMONERS'. The greats being the A-players (people who have outstanding performance reviews and are only a small fraction of people in the company). The Peasants being the other 80% or so of the company. This divide is a serious psychological problem where you have to be in the ELITE group otherwise you are worthless in the company. It's so bad that it has come to the point that your feedback on internal surveys to improve Revolut doesn't carry much weight in the company unless you are one of these 'A-Players'. Its like a sad school drama show...\r\n\r\n\r\n5) The general attitude of the company is 'We are amazing and you should be grateful to work for us'... This isn't a bad thing to some degree, it's good that they are proud of themselves, but I think it is blown way out of proportion. From the moment you apply to Revolut the attitude is on the arrogant side - they believe that they only deserve the best of the best - but what they do not understand is that an 'A-player' wants to work in an 'A-Class' company like Google, Microsoft or the other Tech Titans. It's evident from the company reviews and ratings on this platform and many others that the company is not at the level that they can demand just the A-players from around the world.\r\n\r\n\r\n6) The compensation is good compared to the market (not by much). What you need to understand is that Revolut is in a league of its own: if you compare the amount of hours you work to the pay they give you, you will understand that you are actually being underpaid.\r\n\r\nFor example if you work at 2 companies ABC, XYZ.\r\n\r\nABC pay you £1000 a week but you work 45 hours a week (standard contract)\r\n\r\nXYZ pay you £1200 a week but you work 60 hours a week (12 hours a day and pay a bit better than market)\r\n\r\nABC are paying you £22.22 an hour while XYZ are paying you £20 an hours.\r\n\r\nOf course it is not always like this, but before you think that they are paying you more than your previous job, weigh up the pay in comparison to the extra level of work you will be doing (not to mention emotional abuse and potential mental health repercussions).\r\n\r\n\r\n7) Line managers are quite poor here. Not everyone, but a lot of them are not qualified to be line managers. In my experience, they offer no support, and are very quick to blame you. My manager didn't even know what my career progression goals were, I was just a expendable resource to them. They are usually too busy for you, which they tend use as an excuse for not performing their line managing duties and proceed to blame you that you didn't 'manage upward enough' which is just another way of them getting out of their line managing duties. Even when you request a new line manager they refuse to let you go and change, because I guess it looks bad on them, so you end up stuck with a line manager that doesn't pay much attention to your growth. \r\n\r\nMy worst experience was when another team wanted me to work for them and I wanted to work for that team, only to be blocked by my current line manager telling me I can't go. Later I was in a meeting with other managers and my line manager, when my manager said:\r\n\"Some managers are bad, line managers shouldn't block someone's internal move to a team they are more suited to because people leave and then apply externally\".\r\n\r\nI just sat in that meeting honestly really upset about the situation since the same manager blocked my internal move and then made themselves seem like a thoughtful leader coming up with this solution, when in reality they were doing the exact thing they were preaching against. That was the final moment before I decided I can no longer work there. That and the series of panic attacks I had while working there, I could name other terrible things that happened but I think this review is long enough... \r\n\r\n\r\n\r\n\r\n\r\nTO SUMMARISE\r\n\r\n\r\n1) NO WORK-LIFE BALANCE\r\n2) CULTURE IS TOXIC\r\n3) MANAGEMENT IS YOUNG AND INEXPERIENCED\r\n4) CONCEPT OF A-PLAYERS CREATES A CLASS SYSTEM IN THE COMPANY\r\n5) REVOLUT HAS A PRETENTIOUS ATTITUDE\r\n6) PAY IS NOT GOOD WHEN PUT IN PERSPECTIVE WITH THE HOURS WORKED\r\n7) LINE MANAGERS CAN HONESTLY BREAK YOUR EXPERIENCE THERE AND BREAK YOU"}, {"review_title": "Senior Backend Developer", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "4 Mar 2019", "job_title": "Senior Backend Developer in Moscow, Moskva", "duration": "N/A", "pros": "- Good salary compensations, benefits and options (I can say above market)\r\n- No bureaucracy (I  mean at all)\r\n- Very flexible schedule (U can agree most things of working time with product owner and team)\r\n- There is quite interesting scope of tasks, despite the fact this is fin-tech startup\r\n- Working with experienced, result oriented team where your decisions matter", "cons": "- Sometimes working on weekends\r\n- Sometimes goals and bonuses not clear setted\r\n- There also many routine tech tasks that u should do (Just my personal opinion)\r\n- Difficult to start if u are newcomer (there is no any written standarts, u learn them through existing code, lack of guidance)"}, {"review_title": "Great opportunities to grow and do ground-breaking work", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "3 Mar 2019", "job_title": "Legal Counsel in London, England", "duration": "N/A", "pros": "If you're thinking of applying to Revolut, you should try to chat with a few people who work here now and not listen too much to the noise in the press based on a few disgruntled ex-employees. Every fast-growing startup has some growing pains, but since I joined there has been a concentrated effort in adapting from a young startup to a larger company (without losing its startup mentality). It's cool to be part of that journey and watch everyone grow, myself included, with the company. There's been a low turnover since I've joined and everyone I work with are really nice and passionate people. Some of the main 'pros' for me are:\r\n- High responsibility - The level of responsibility you can get at Revolut is years ahead of anywhere else.\r\n- Genuinely interest work - Many projects I am working on are pushing the boundaries of financial services and have never been done before.\r\n- Exciting workplace - Being part of a fast-growing company which is still at a relatively early stage before its done any international expansion outside Europe. There are big plans for the next few years which are exciting to be a part of.\r\n- Non-hierarchal structure. You are measured by the quality of your work not the years of experience. You are encouraged to suggest new ideas to people at the top.\r\n- Friendly colleagues - I get along well with everyone I work with and there is a good social aspect with regular Thursday/Friday drinks events", "cons": "Sometimes things can be a little chaotic and some parts of your experience as an employee can lack a bit of structure. But this is much better than layers of bureaucracy and means that things are flexible and as long as you work for good people, its not really a problem."}, {"review_title": "It's not as bad as you think but quite hectic as it's a work in progress", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "5 Mar 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "+ ambitions & goals of the company\r\n+ young talented people around, hungry to learn\r\n+ exposure to a lot of things, can wear different hats and move from one team / dept to another as there's no formal procedures right now\r\n+ you can relocate to another country as there's expansion going on and new offices are being opened in many places", "cons": "- poor management as most of team owners are quite young and inexperienced, they do not know how to work with people and lack emotional intelligence \r\n- turnover because of poor management and inexperienced HR (it's 2 people in HR for 180 people at the office) \r\n- no org structure, no clear vision on how to grow within your team or move to another one, everything is subjective;  you wouldn't know why one person is mid and one is senior, no one can explain it to you\r\n- huge focus on tech people and if you don't have CS degree, you are \"useless\" or \"not smart\" no matter what you do and how much you work"}, {"review_title": "Vast perspectives outdo the teething problems", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "3 Mar 2019", "job_title": "Analyst in Kraków", "duration": "N/A", "pros": "It is a powerhouse job wherein one may instantly see the results of their effort. The rapid growth - albeit the same factor that has led to the somewhat tense internal atmosphere - is an abundant source of genuine optimism that propels the crew each next day and makes it feel fresh. \r\nThey don't care about formalism, they hardly care how you look/how you dress, they let you to your own views, all these are very big pros to my mind.  \r\nIf an employee proves diligent and reliable, the scope of trust and responsibility given is satisfying, rewarding, and motivating.\r\n\r\nTo be fair - although I see a few tiny but bugging elements that beg for instant improvements, I can simultaneously and easily see myself as part of this company for years and years to come, if only they recipricate this.\r\n\r\nI'd rather team up to engage in the development, tackling the shortcomings until I happily see them solved than turn on them as a bilious saboteur, which seems too cheap a choice in the unique times that call for resilient characters.\r\n \r\nThe shortcomings, if there're any, often don't result from any malevolence; conversely, they stem from the nearly exponential growth - they're but a natural byproduct of our fast-paced evolution.", "cons": "The London part of the crew (to be precise: only some of its reps) struggle to eradicate their overtly condescending thinking towards the other offices' people, without whom - which they seem to be constantly forgetting to realise - they would fall spectacularly come the first tough day. \r\n\r\nThe remuneration system is haphazard. As the time wears on, some of people whose work's quality was questionable are given pleasant, well-paid tenures for no apparent reason other than that they've just stayed for long enough.\r\n\r\nOn the other hand, it is nothing frown upon at Revolut to be promoted to a new role (having won a tough recruitment) only to see that one's been given an effectively smaller net salary, since the entry roles entail extra pay chances which are closed afterwards as one advances. Needless to say how it may play with one's motivation.\r\n\r\nThe feedback path is deficient when it comes to people perched a step higher up the ladder. It is factually impossible to have an influence against somebody over you in the hierarchy, should you see that person not living up to their duties.\r\n\r\nThere's a feeling of disregard to the level of stress a typical consumer-facing employee is exposed to each day. What is more, instead of soothing the impact, there comes a second, tough stress blow from the line managers focused on the KPIs. One may imagine that although stress is natural and can be beneficial, it can't be cranked up endlessly as straining it doesn't go on par with better results or higher discipline.\r\n\r\nLastly, an unpleasant surprise that one would rather avoid witnessing is the one whereby the in-house recruitment process sees some staffers outpowering the tough competition and being promoted to the new roles, for them only to be told on the eve of being introduced to the new position that their new contracts had been scrapped due to changing objectives. Regardless of the legitimacy of such turbulent decisions (which may be well justified and which I don't dispute) being tossed to and fro in such an aloof fashion is incredibly burdensome to the psyche. Such shockers undermine everybody's confidence and render many a crewmember dubious about the stability of their own jobs."}, {"review_title": "Compliance analyst", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "26 Apr 2018", "job_title": "Compliance Analyst in Kraków", "duration": "N/A", "pros": "Positive start-up environment,  you can  focus on your work without pressure from someone else, good experience as a first job", "cons": "This place is a pure mess without a proper manager who is able to manage operations on a few layers, the company is unable to promote and use the experience of their employees in order to set up a certain professional environment, sometimes I felt like I am in the kindergarten. Also, 24/7 shift work is really annoying."}, {"review_title": "Amazing opportunities", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "12 Jun 2019", "job_title": "Team Leader in Kraków", "duration": "N/A", "pros": "- Great exposure to an amazing and trending product (you will learn thoroughly how the banking system works and how Revolut does it better) \r\n- Ownership (ability to run your own projects and be responsible for a lot of processes)\r\n- Very competetive salary \r\n- Great atmosphere and passionate coworkers", "cons": "- not for everyone (if you are looking for a job that will end after 8h when you leave the office, it's probably not for you )\r\n- it requires effort and ambition to gain what you want (but it pays off) - if you are medicore at what you're doing, you won't get too far"}], [{"review_title": "Interesting experience", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "18 May 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "In order to thrive at Revolut, culture fit is really important.\r\nI see a lot of negative reviews stating bad management, and in a way I think this is highly driven by an extremely direct and no-BS communication style of the senior management. The narrative is highly focused on the need for all to be super performers (aka A players) and if you fall outside of this group, you'll be fired. Now, this sounds pretty rough to most people (and that is in a way understandable) and creates an impression that the company and/or senior management does not care about people. Guess what - other/bigger companies who are better at BSing and sugar coating also do not care, but there is more 'fake empathy' going on there. \r\nSo I guess this is a question of culture/personality type - do you prefer straightforwardness and blunt communication or would you rather have the same stuff delivered in a corporate sugar coated/brainwash-y way? Each person would have a different response to that :) \r\n\r\nBased on this here are the Pros:\r\n\r\n-> moves fast, things get resolved quickly\r\n-> smart colleagues, especially in some departments. A players like working with A players\r\n-> high performance culture (good for those who are competitive and want to be no.1)\r\n-> to the point above, despite that, people are also friendly and backstabbing is not so common (as it is in corporate)\r\n-> management is actually here for the win and is relentless to reach its goals (this is good monetary-wise if you stick long term and see the company IPO)", "cons": "Cons:\r\n\r\n-> senior management communication style is indeed rough/immature - rephrasing things may do wonders for the morale\r\n-> unexpected spikes in workload may occur - which makes work/life balance challenging\r\n-> [pre-covid] office perks are not that amazing - you have to wait till 7 pm for Deliveroo dinner and the breakfast provided is kind of basic (only 1 sugar free cereal was available, which were the plain outs, everything else was loaded with sugar)\r\n-> lack of narrative/culture/identity of being part of something awesome - there isn't a strong identity that creates a sense of community and belonging, something you can find in big tech companies"}, {"review_title": "Tough but Rewarding", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "3 Mar 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- Great career experience\r\n- Ownership from day 1\r\n- Great Product - best in the market\r\n- Smart and talented staff\r\n- Great Office space\r\n- Thirsty Thursdays with free pizza\r\n- Free dinners", "cons": "- Not clear HR department, it seems to be entirely focused on recruitment \r\n- Reporting lines are not clear; too many cooks in the kitchen\r\n- You will get messages at all hours, requesting you to do work\r\n- Work life balance: 12-15 working hrs per day plus weekends"}, {"review_title": "Incredible opportunity", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "4 Mar 2019", "job_title": "Paralegal in London, England", "duration": "N/A", "pros": "- Employees are given a lot of responsibilities and autonomy.\r\n- Huge learning opportunities, it's never boring!\r\n- International, open-minded and friendly environment.\r\n- The London HQ is dynamic and a great work place.\r\n- Young and dynamic workforce.\r\n- Smart and interesting colleagues.", "cons": "Working hours can be longer, but it's worth it. It is completely normal to work longer  hours when being part of a company that is growing at this speed."}, {"review_title": "Life changing opportunity", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "14 Feb 2018", "job_title": "Senior Software Developer in London, England", "duration": "N/A", "pros": "One of the most exciting and fastest growing fintechs out there. If you have a good idea and pitch it to the team, it will get done and you will be rewarded.\r\n\r\nAn extremely inspiring, talented, and driven group of people to work with and learn from.\r\n\r\nAmazing opportunities for personal growth, learning new skills and a wide range of new experiences. You will be working alongside and putting together deals and products with the very biggest heavy hitters in the startup world and finance industry from day one.", "cons": "None, you just have to be hungry to succeed and be prepared to put in the work to make that happen"}, {"review_title": "Great company", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "3 Mar 2019", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "- unlimited opportunities for growth;\r\n- open culture;\r\n- smart colleagues;\r\n- strong team spirit;", "cons": "Very demanding company not for those who are used to \"relaxed startup\" atmosphere. Employees are ignited by the idea to change the global banking landscape and this requires full dedication and commitment to the company. In reality the company is as close as possible to it's stated values of \"get things done\". Forget about work/life balance."}, {"review_title": "Go for it if you connect to what you do)", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "4 Mar 2019", "job_title": "Data Scientist", "duration": "N/A", "pros": "Maybe a somewhat different take on what it feels like\r\n\r\nEveryone is important. There are no people whose work doesn’t matter. A support agent that works to help specific people with any queries they may have can either clear up all their questions and worries or ruin their day by being ignorant and invasive. A product owner is here to identify and solve problems that make the most difference for our customers, yet should they fail it will have us make more mistakes on our journey to make people’s lives better.\r\n\r\nWe support each other and are interested in getting to the results we work towards (a) as a team and (b) in a sustainable manner. We have ups and downs together, team rather than individual KPIs, and closely coupled goals across the teams. Everyone in the company is interested in everyone’s else success and has the time to clear out any blockers and answer the questions. The data team I’m part of and can tell most about is very friendly and cheerful) And this is not to mention the high calibre of the people you will be working and interacting with.\r\n\r\nWe take responsibility for what we do and what we build. You become part of a rapidly growing team that is still taking shape and morphing, and, whatever your role is, are on one hell of a ride that is work in a rapidly growing smartly built start-up where decisions are based on data and there is no place for complacency and ignorance.", "cons": "Taking the responsibility and connecting to what you do will likely mean every now and then going an extra mile. Little matters how much or how little you work, yet it’s intensive and I would not think of life at Revolut as a nine-to-five job. And it’s also your responsibility to avoid burnout and manage your time well.\r\n\r\nNot everything depends on you. Hardly anything is set in stone, which is mostly good yet at times frustrating, and if what you’ve been working on is no longer relevant to improving what we do and how we do it, it will be let go of. If it’s not the solution and bringing value to what people get with us that matter to you, it may be difficult and might seem somewhat unjust.\r\n\r\nPeople that wake up in the morning not knowing what are they doing in this world and need to be told of what’s the meaning of it all (preferably in an invigorating manner) may wilt in a culture of making a difference and getting it done."}, {"review_title": "Amazing workplace", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "27 Mar 2020", "job_title": "Backend Engineer in London, England", "duration": "N/A", "pros": "Fast paced environment where you can see your impact from very start. Amazing perks and nice startup culture, you will find snacks and drinks stocked all day in kitchen. You will feel inclusiveness in company with stock options.", "cons": "Sometimes, you have to work for more than 8 hours but honestly it depends totally on you. I am still in my probation period and there were days when i worked even less that 8 , so it is totally up to you how do you manage your time and their expectations from you. I would say you have to be A player if you want to work normal hours and deliver at the same time."}, {"review_title": "Never work at Revolut", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "9 Jun 2020", "job_title": "Product Owner in London, England", "duration": "N/A", "pros": "Compensation is pretty in the market", "cons": "To be honest, it's the worst company I've ever worked for. Never work here, you will have only regrets and stress. Company and founders don't understand product, technology and good culture at all. \r\n\r\nYou won't be doing product. It's digital transformation company:\r\n- 100% top-down company, all design, roadmap, etc. decisions are made by Nikolay Storonsky. You will be only in charge of execution/project management. He is reviewing every new screen and epic every week with every team (Revolut has 50+ teams). All middle managers are just proxies, no decisions, no their own opinions and easily blow you in back. \r\n- Not product way of thinking at all, in a year I haven't seen any team made user research and A/B test. All development is done in an absolutely blind way, guided by the supervision of Nikolay. Moreover, all these instruments are prohibited and replace with \"thinking deeper\" value that means just sit and think a lot. Nikolay personally hates these methods and several times told me that it's for idiots.\r\n- The short-sighted, company mostly focused on small improvements that can be done in 1-2 week otherwise it's too much risk and should be cancelled. \r\n- Every two weeks you will have a review with your functional manager who will be checking Jira epics and Figmas to verify that you have enough words there, structure, etc. (no one really cares for product stuff) \r\n- Did you say strategy? These guys don't have any understanding of their client, such as personas, segments, key pain points, etc.\r\n- Never ever question Nik's opinions and decisions! He is always right, otherwise, you are fired immediately. Stronger together!!!\r\n\r\nThat's super sad because there are so many good and shiny managers fooled and hired from cool companies that struggling with topics above and leaving. During interviews, people and recruiters will tell you and even test you on the product skills above but it will last time you will ever use it. \r\n\r\nFrom technology and quality perspective company is messy as well:\r\n- There are no QA engineers and that's could be ok if you have autotests but Revolut mostly doesn't have it. They do have it only for backend and no one care for web and apps. All QA work is on PO shoulders. Yes yes yes, you will be doing here QA and project management but not product work. And as you can imagine PO doesn't have time and nobody QA it at all.\r\n- CTO, Vlad is really obsessed about reviews, reports and can't handle any feedback, the same as Nikolay. Every two weeks you would be measured against 10-15 parameters (most of them are really stupid) and you can't question any decision and situation (such people usually immediately fired). All of this lead to fear of punishment, making mistake - developers producing a lot of small crappy improvements to minimise their risk.\r\n- Most of the codebase written in rush by students, so it's really buggy and re-inventing existing technologies and frameworks messily. As you can understand, it isn't a modern stack and very hard learning curve.\r\n\r\nBased on the information above it's pretty clear that you won't be trusted and company culture is very toxic. They call it A-players or champions. We should hire and retain only them. In practice, Revolut fires everyone who is average or below it - you should be excellent. Last mid review we were told that we doing just feedback sessions. All this information was used to fire people immediately, even with average feedback. \r\n\r\nMost of the senior managers are just kids, doing that they were told. It's their first job, their working here for 2-3 years and haven't ever seen how good job should look like. So, you will have a fun time."}, {"review_title": "It is like your life - depends what you do with it and how you approach daily challenges - for me it is rewarding", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "4 Mar 2019", "job_title": "Analyst", "duration": "N/A", "pros": "- Competent & willing to help colleagues\r\n- Disrupting banking sector \r\n- No day is like the other\r\n- Diversity \r\n- Friendly atmosphere\r\n- A place where you grow professionally & personally", "cons": "- no 13th salary or any mid-year bonus :/ \r\n- no external trainings\r\n- the company does not cover any educational costs (i.e. an online course which would make you better & more competent and knowledgeable in your specific area and thus make company as such better too)."}, {"review_title": "Good product and PR, poor culture", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "9 Apr 2018", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Great exposure and involvement in many different projects \r\nFull accountability in many projects from day one", "cons": "- Work life balance is poor but if you work in startups you should be fine with it as it happens in most of them. Good to mention that KPIs are more difficult to meet due to management high expectations so you will be working longer hours than in other startups.\r\n- Too many projects going on at the same time and all of them are urgent for management. This situation brings lots of pressure on employees not making days enjoyable at all. \r\n- Employee benefits don’t exist"}], [{"review_title": "Don't be a moth, this shiny company will burn you", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "6 Jun 2020", "job_title": "Python Software Engineer in London, England", "duration": "N/A", "pros": "The salary and the perks are very good.\r\n\r\nThey have someone in charge of inclusion of diversity.\r\n\r\nEngineers have a lot of autonomy.", "cons": "One of the fundamental problem of Revolut engineering ironically lies in the mantra plastered all around office walls and chats: \"get it done\".\r\nThose 3 words have become an excuse to cut all the corners and take all the shortcuts. That results in a massive technical debt and huge security gaps that no-one is trying to resolve.\r\nMost engineers are constantly creating new systems under the immense pressure of tight KPIs. These KPIs are now for every quarter, and failure to perform will always be seen as an individual's fault and never as a structural problem. People are under the constant fear of getting fired, or in the best case just stressed and overworked.\r\n\r\nTechnical recruitment has been made under the terrible assumption that any programmer knows or can learn system design or infrastructure. In reality, only a handful of people are taking care of it, so they spend all their time firefighting instead of improving things, which in turn results to a big turnover.\r\n\r\nThe CTO does not seem to be cut out for the job. He micro-manages individual projects, but completely ignores vast parts of engineering. He takes decisions alone, does not listen, and will never change his mind once set. He will not acknowledge things he does not understand. He is arrogant and patronizing.\r\n\r\nThere is no middle management: just team leads and senior figures. Because of that teams have no coordination, sometimes doing the same work twice or heading into completely different directions, or having mismatched expectations from each other.\r\n\r\nDevelopers don't have the right tools to work with. For instance, the company uses bitbucket and teamcity, which are a daily waste of time because of lack of features and frequent outages. Everyone frequently complains about it, but the issue hasn't even been acknowledged by senior management.\r\n\r\nEven though someone is in charge of inclusion and diversity, and they claim to be against harassment and bullying, it's just for show. People with hurtful behaviour are promoted or left to senior positions.\r\n\r\nFinally, just look at the Wired articles about Revolut. Everything you'll read is true."}, {"review_title": "Terrible culture, toxic and arrogant", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "2 Sept 2019", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Free Coke, Diet Coke and Coke Zero. \nCute dogs around the place. \nLocation...if you like water, although you’ll be too busy to enjoy it.", "cons": "Managers are arrogant, lack interpersonal skills and common sense, don’t listen and look to blame everyone but themselves. Bullying and humiliating and demeaning people in meetings is acceptable here.\n\nVery cliquey workplace, unpleasant unfriendly people in particular departments, no real diversity and are only paying lip service to such matters. I suspect that has more to do with attracting investors than really caring about the people that work there. Terrible place, don’t do it to yourself. Find somewhere else to work...anywhere else."}, {"review_title": "General", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "18 Jul 2018", "job_title": "Analyst", "duration": "N/A", "pros": "Great Idea lots of opportunity really grateful , alot of people are really working hard for this great Idea that we all working behind", "cons": "I am writing this after we tried to escalate this to the higher management but no action I can say it is very unprofessional HR  in PL ,  HR is  not up to the level of the company interms of being professional, availabity , not knowledgeable about HR process, make alot of mistakes, not even nice with employees.  please watch out the people in the HR that is  my best advice"}, {"review_title": "Unusual Workplace - Evolving in interesting ways", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "13 Mar 2019", "job_title": "Operations Manager in London, England", "duration": "N/A", "pros": "Joined few weeks back and here are my first impressions\r\n\r\n- Extremely transparent\r\n- Very ambitious\r\n- Using modern age tools and techniques\r\n- Young crowd\r\n- Doesnt matter where you work, how much you work and how you work as long as things are getting done.", "cons": "-Growing fast so practices at times are not consistent.\r\n- Its a startup trying to solve a problem which hasnt been solved fast enough. It means hard work and no one at revolut are willing to(or should) apologize for."}, {"review_title": "Krakow Office - Great career opportunity", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "3 Mar 2019", "job_title": "Team Leader in Kraków", "duration": "N/A", "pros": "Challenging - not a standard desk job with repetitive tasks, which makes it a great opportunity to quickly learn and gain new skills;\r\nYour feedback matters, no matter your position - if your insight is valuable, it will be treated as such;\r\nVery healthy and employee-friendly office atmosphere, strong team spirit;\r\nDynamic and exciting environment - never gets boring;\r\nPerfect growth opportunities", "cons": "Working at Revolut is very rewarding, but requires serious commitment. Personally, I like the approach, but if you're not ready to do that, it might be hard for you to move forward quickly."}, {"review_title": "Great Product but very poor culture", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "29 Jan 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great office, great product and great technology...... that's all", "cons": "The most Awful experience of my life! the current senior management its a massive disgrace for Revolut. Arrogant and aggressive people with zero knowledge! they just pretend to be on top of everything without any back ground. The Legal, the operations and the customer support are a cancer for this company! they constantly lie to everyone! and most important they treat employee like peace of meat! to live in peace there you have always to say yes to their incompetence! otherwise you are just a problem to eliminate. Zero work/life balance, Zero culture and Zero Values! its a dangerous place to work at!"}, {"review_title": "AMAZING - I feel at home <3", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "29 Nov 2019", "job_title": "Human Resources Manager in Porto, Oporto", "duration": "N/A", "pros": "I work at Porto Office (Portugal)\r\nThe environment is amazing, people really connect with each other and help each other. If you have a problem or doubt, you go directly to some member of another team and they help you. No judgements or bad faces, at all. We're all here to learn and improve, and we all have the same goal.\r\nWe have maybe around 40% international co-workers, and 60% native. This is incredible as well in so many ways.\r\nThe benefits and perks are medium-high compared to the rest of the market.\r\nThere are several internal events and initiatives that really engage people and gives them a continuous feel that . You can really identify with the company and culture and values! \r\nThe company is changing each day, with improvements coming along each day. And every week, you see that the mindset is becoming more and more people-focused :) \r\nThe brand new Office, which will hold around 450 people, is a-ma-zing. Gives you a sense of comfort and belonging, and the idea that you have the best workplace you could ask for.\r\nPlus, the company has some internal strategies that are really incredible: for example every week, we have a broadcast from another office, to update everyone on the current status of the company in the market, about the new initiatives and plans, about new processes and procedures, about everything else that might matter and that might be important for everyone to know. This keeps people in the loop and motivated.", "cons": "As any fast-growing company, there are some improvement points. One of them is the organisation (one still feels a bit lost sometimes, because things are super fast and change fast).\r\nAnd... not exactly a con, but the KPI's are demanding - but totally understandable: if you want to have the best, hire the best and become the best... you gotta set the bar high! Nevertheless, if you come here with the goal of working, learning and enjoying yourself while you do it... everything will work out just fine.\r\nJust don't think you will come here to play around just because this is a start-up: you still need to be responsible and do your part! :)"}, {"review_title": "Terrible culture - no mental safety", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "10 Jun 2020", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "+ cool product to work for\r\n+ very talented, passionate and smart colleagues\r\n+ some people I really enjoy working with\r\n+ nice offices\r\n+ good salary", "cons": "- highly stressful\r\n- no acknowledgement of mental health: they will talk about it extremely briefly during a Town Hall or a \"well being\" slack app, but then you get back to reality when you realise you have to work 12 hours a day to meet your deadlines\r\n- bad salary relative to hours worked\r\n- fear driven culture: everyone is stressed out of their minds and working at all times because they are scared of being fired\r\n- you keep hearing during town halls that if you're not an A player you will get fired, just to put that bit of extra pressure, as if there wasn't enough already\r\n- unrealistic deadlines / KPIs (they mention only the top teams can achieve this internally, but during my recruitment process I was told only bad teams didn't reach them)\r\n- KPIs are poorly chosen as many depend on external factors\r\n- even though there is a \"stronger together\" value, people will not always help because they are scared to not reach their KPIs\r\n- \"us versus them\" mentality by senior management: if you're not an A player, then you're against the company and should be let go. There is absolutely no nurturing. They will hire perfectly capable people that will just get burnt out and fired once they can't produce anything anymore. The funny part is that the CEO keeps repeating that we only hire the best. Why are so many people fired then?\r\n- no time to think about anything as you're constantly rushing to get the next thing delivered: this leads to lots of technical debt\r\n- dodgy internal frameworks that make you waste a lot of time\r\n- terrible infrastructure setup: because \"you should know how to deal with infrastructure\" you have to delve into details that are useless and waste an enormous amount of time to setup and maintain your services' infrastructure\r\n- people disappear all the time and you know about it by seeing their slack account deactivated\r\n- people shout at each other or are disrespectful because of the pressure/stress\r\n- CEO micromanages everything\r\n- worst job security I have ever experienced\r\n\r\nSomeone will answer \"we are doing everything to improve\". This is not true. Nothing has improved since I've been at Revolut. It's all superficial. The fundamental culture of the company needs to change. The improvement should be driven by the line managers.\r\n\r\nI was told \"nobody will force you to work overtime\". It's true, nobody has told me that explicitly. However, you need to work overtime to reach the KPIs, or get fired."}, {"review_title": "Operations Intern", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "- Lots of opportunities for growth\r\n- Steep and constant learning curve\r\n- Independence and room for creativity in approach to projects \r\n- Inclusive culture\r\n- Flexible and casual but everyone works hard\r\n- People are always ready to help\r\n- Very social\r\n- Company is heading in exciting directions", "cons": "- If you're hard working you'll never need or want to leave the office (could be a pro)\r\n- Slightly stressful working in a room full of people (but some might thrive in it)"}, {"review_title": "poor management", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "29 Apr 2020", "job_title": "FinCrime Analyst in Kraków", "duration": "N/A", "pros": "good product, great colleagues, free fruits", "cons": "Some 'management' people without proper training - bossing around.  Wrongly calculated targets, really hard to achieve. Lack of procedures, employees were confused whether they did the job correctly or not. Some good employees with previous experience in banking industry were quitting after seeing such a big mess inside the company.  Unfair treatment and poor bonuses. The management don't see a person, see a number instead."}], [{"review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "3 Mar 2019", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Full of opportunities. If you have an idea, and it contributes to our business goals. You are encouraged to execute.\r\nGreat place for self starters and future entrepreneurs \r\nYou get to work with extremely smart people, and you learn from the best", "cons": "For me, none. However I can understand why people would see some of my pros as cons. An unstructured environment with lots of autonomy is not for everyone"}, {"review_title": "Good for young job seekers", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "13 May 2019", "job_title": "Technical Support Specialist in Kraków", "duration": "N/A", "pros": "It's a good place to get some banking exposure", "cons": "When it comes to career development or promotion be careful real Game of thrones goes around here and you might lose your job like Ned Stark lost his head"}, {"review_title": "Amazing learning experience, high trust and exciting company to work for", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "11 Sept 2019", "job_title": "Data Scientist in London, England", "duration": "N/A", "pros": "Working at Revolut has been an amazing experience. A lot of trust given to the employees, the opportunity to work on what is interesting to you (given that it brings business value). No one really watches you as long as you get your tasks done. That and social events, free breakfast, free deliveroo dinner.", "cons": "Sometimes a very high workload. You need to be passionate about the product and love what you are doing"}, {"review_title": "Business Developer", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "24 Jan 2019", "job_title": "Business Developer in London, England", "duration": "N/A", "pros": "I'm completely overwhelmed by a positive impression Revolut has created.  All processes and communications seem to be crystal clear from day one. It feels like I was carefully embraced from the moment I applied for a job. \r\nTrue, the company is full of tireless, inspired people who overwork daily. But it is not because of a must, this is their own desire to build a radically better neobank.\r\nI would highly recommend it to anybody who is ready for a worthwhile and engaging global challenge.", "cons": "I don not see any."}, {"review_title": "No work life balance, Management only cares about your works not you.", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "1 May 2020", "job_title": "Software Engineer in London, England", "duration": "N/A", "pros": "- Competitive salary/benefits\r\n\r\n- Talented people.\r\n\r\n- Some nice perks", "cons": "- A lot of pressure going on in engineer area.\r\n\r\n- Developers are blame each others when someone accidentally break the dev environment/branch making them feels shame, rather than helping and stop blaming in the chat group.\r\n\r\n- No mistake are acceptable, if you are good in everything -> you got only 50% performance review (which is meets expectation). They raise the employee standard, but lack of engineering process and good culture. (They expect all of you to be \"above\" expectation)\r\n\r\n- No work life balance/ everyone works like 10+ hours a day to \"Get things done\". They was no real task estimation, product side are very keen to push their product because they are racing each others to proof them self and to showing off to their CEOs. Most of people left because of that.\r\n\r\n- They're doing task demo every 1-2 weeks and gather all developer (100+ people more) to watch what every teams are doing. Which is not necessary anymore when the company have more than 100+ people in tech team. It's kinda wasting time and I don't think everyone can remembered what is going on.\r\n\r\n- They was no engineering manager position which can solve and made a decision in some technical side, as a developer you will report to product owner in your team (Which is very bad, some of product owner doesn't even care about engineering process, they just want to \"Get things done\"). You also have functional manager (Which is some developer who have more seniority) But they can only help you in some advices for implementation.\r\n\r\n- They used to have QA department, which is good, because if your team & product are get bigger they should have some one who creating & responsible in quality assurance. But then they decided to collapsed it because they think focus on \"pushing\" features are more important.\r\n\r\n- Since there is no QA department, sometimes you & your team will got assigned to some bugs and complaints directly\r\n\r\n- Not so friendly environment, when everyone still working in the office, no one talking to you if they don't want some answer that related to works, (Because they have a lot of workloads and try to \"get things done\"). Some people are going have a lunch together, but that's all.\r\n\r\n- Even after all of the above complaints, CEOs and top management still saying that since the company get bigger, we are start to get lazy (What?!, everyone needs to work long hour for you guys everyday to be enough?) \r\n\r\n- Rather than try to encourage/help and give a constructive feedback to employee that underperform in some point. They probably fired you because they don't have time for that, they wants to \"get things done\""}, {"review_title": "Good job but hard to adavnce", "rating": "3.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "5 May 2019", "job_title": "Business Customer Support in Kraków", "duration": "N/A", "pros": "- Competitive wage\r\n- Plenty of company benefits\r\n- New office", "cons": "- 24 hour shifts 7 days a week 365 days a year\r\n- The way the KPI for the teams are set up do not really reflect the work put in on a given shift\r\n- Very hard to provide own process, usually the answer is that the decisions are made higher up\r\n- A lot of miscommunication\r\n- Lack of team spirit and togetherness"}, {"review_title": "Beyond Banking", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "14 Feb 2018", "job_title": "Escalation Manager in Kraków", "duration": "N/A", "pros": "I am working here for more than 1 year. Very friendly and very great working environment which is a huge plus. I learn a lot from the A-class guys in the house who are very experienced and inspiring. I teach people and I can see that I have developed a lot. Being proactive, learning new stuff and gaining knowledge, consideration in the company which are highly commendable.", "cons": "Lack of communication was a con but now it has improved so well."}, {"review_title": "Stay away from Revolut!!!", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "28 Feb 2019", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "- Product is good;\r\n- It's a fast moving company.", "cons": "- Work life balance gone, expect to work over the weekend and long hours (12-14 hours p/day);\r\n- Management is bullying employees providing unrealistic KPIs to reach and then complaining about your incapability to reach the results;\r\n- Managers consider employees as a pure number;\r\n- There is no humanity in this company; you can read also the bad coverage about their culture;\r\n- Hiring/Firing company;\r\n- High employees turnover; average staying is below 6 months.\r\nStay away from there."}, {"review_title": "Happy to be a part of the team!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "14 Feb 2018", "job_title": "Customer Support Team Leader in Kraków", "duration": "N/A", "pros": "- Ability grow within the company\r\n- Dinners and taxi rides home when working late\r\n- Health insurance, gym cards\r\n- Ability to learn new things on site", "cons": "- Broken or due to be established processes\r\n- Poor communication between teams (rather rare but annoying)\r\n- Fast changing environment (however, can be also a good thing)"}, {"review_title": "Efficient recruiting process", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "15 May 2019", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "Agile, professional and very selective recruiting process. The HR team keeps you informed at all times of the status of your candidacy and meets the deadlines the commit to.", "cons": "Home task is a little time-demanding"}], [{"review_title": "Great Place to work!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "7 Nov 2019", "job_title": "IAM Analyst in London, England", "duration": "N/A", "pros": "Lots of energy, great people and exciting times. Spending years in sleepy corporate banks, I am finding  this so refreshing.  Lots of teams  still seem to be fibding their position, but this is part of the great journey..right?", "cons": "Sometimes feel overwhelmed at the end of the day , but i’d rather this than feeling underwhelmed and insignificant at the end of a day. Keep up the great work Revolut!"}, {"review_title": "Great challenges and energy", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "7 May 2020", "job_title": "Marketing Manager in London, England", "duration": "N/A", "pros": "You get to work with really smart people, who are very passionate about the mission, there's a great energy and enthusiasm about the place. Autonomy is a big plus and you're given the space to explore what you want to achieve. You feel like you're part of something really exciting to it's easy to stay motivated.", "cons": "There is still some growing up to do, both in terms of processes and management."}, {"review_title": "Amazing experience but demanding", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "3 Mar 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Exciting and ambitious startup to be a part of. People are given a large amount of independence and responsibility. Those who perform well will climb quickly and grow and gain more opportunities.  Smart and fun people to work with.", "cons": "This is a 24/7 job particularly if you’re in operations. Work pressures will be demanding and high standards will be expected. This though should be expected before joining any high growth and ambitious company"}, {"review_title": "Joining Revolut was a great decision!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "3 Mar 2019", "job_title": "Business Customer Service Specialist in Kraków", "duration": "N/A", "pros": "I really like team spirit in Revolut. There is a great opportunity to improve skills e.g. a chance to apply for other positions, taking part in new projects, training new members. Also, it's great to see how Revolut is growing! I was a little bit unsure about working in a big company but Revolut has surprised me in a very positive way!", "cons": "Sometimes I feel that the communication between particular teams might be better."}, {"review_title": "My view of Revolut", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "4 Mar 2019", "job_title": "Backend Developer", "duration": "N/A", "pros": "- Great team! Opportunity to meet and work with people from different cultures.\r\n- Opportunity to create a real bank by yourself\r\n- Mostly easy readable and understandable code", "cons": "Usual (not critical in my opinion) startup cons like:\r\n- Higher responsibility for your own contribution/your own code\r\n- Rapid changes in business requirements\r\n- New features and delivery speed have higher priorities than some necessary improvements of current ones"}, {"review_title": "A Training Ground for Future Founders", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "10 Aug 2018", "job_title": "Operations in London, England", "duration": "N/A", "pros": "Smart People\r\nOpen Culture\r\nValues Logic and Data more than anywhere else I have worked\r\nMassive opportunities for self development and responsibility very early on", "cons": "You have to find your own ground - onboarding process doesn't exist\r\nPeople are very focused so initially it is unclear whether or not you can ask for help (you always can)"}, {"review_title": "Come here to make a difference to Finance", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "14 Feb 2018", "job_title": "Business Development in London, England", "duration": "N/A", "pros": "- Responsibility from day 1 to take ownership of your work\r\n- Flat, transparent structure, with no office politics\r\n- High pace / high energy / high output work environment.", "cons": "- Come prepared for the challenge! The work moves at an incredible pace so be ready to muck in from the beginning\r\n- High pressure - very high focus internally on execution"}, {"review_title": "I've grown so much...", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "3 Mar 2019", "job_title": "Marketing Manager in London, England", "duration": "N/A", "pros": "- You'll be given endless freedom and autonomy in your role.\r\n\r\n- Teams are very structured, focused and data driven. \r\n\r\n- Such an entrepreneurial environment with huge development opportunities. \r\n\r\n- The London HQ is always buzzing and full of life.", "cons": "- You definitely work a bit longer than other places, but it's worth it."}, {"review_title": "Demanding but rewarding", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "14 May 2020", "job_title": "Business Support in Porto, Oporto", "duration": "N/A", "pros": "Attractive salary, good perks and benefits, extremely nice office and positive team spirit. Challenging and dynamic days every day.", "cons": "High pressure, very demanding targets, definitely not for those who just want a quiet 9-to-5 job. This is very a very rewarding job but only when we deliver excellent results, meeting expectations is not enough and sometimes it’s hard to accept this as a new form of normal."}, {"review_title": "Toxic Environment. Incompetent Managers. And so on. Please avoid.", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "7 Jun 2020", "job_title": "Customer Support Specialist", "duration": "N/A", "pros": "Cereals, fruits, variants of milks, soft drinks, are always available in the kitchen.\r\n\r\nFree dinner and taxi for the evening shift.\r\n\r\nYou are mostly surrounded by nice colleagues, but still there are a few people who think that they are perfect and look down on other people. \r\n\r\nFast recruitment process.\r\n\r\nIT team is very responsive, appreciate the great work.", "cons": "Fear-driven environment\r\n\r\nUnrealistic target. If you want to work like a human being, not a robot, the target is quite unachievable. If you ask the person who set the target to do the exact same thing as the Support Agents should do, for sure they cannot handle it.\r\n\r\nNo time to be up to date. For example, when you have days off for two days in a week, you miss a lot of information, when you get back to work, you must be ready for all the changes and news. So they are expecting you to be updated even if it’s taking your free/leisure/unpaid time to read it. Please keep in mind that the CS Specialist is the lowest position, with the lowest salary, and still they expect people to spend extra time for them. \r\n\r\nChaotic, messy internal information/procedure. When there is a product launch/issue, quite often no one knows what is really happening. Even their knowledge base is quite confusing/messy, not all information is covered. \r\n\r\nThey don’t care if you go the extra mile to investigate the cases thoroughly. Again, most of the time they do not have a procedure settled for something, so you need to create a totally brand new procedure, but it requires a big effort and time. Another thing is when a case is quite complicated, it is taking your time, you want to do your best to solve it, but you are also stressed out cause then you will not meet your target. \r\n\r\nThey don’t care about the quality of your work, they’d rather appreciate careless employees as long as the numbers are high. If you are a diligent person who takes things into consideration, you want to give the best of your work, then avoid this company, they don’t deserve your effort. \r\n\r\nRegarding the way they treat the daily target, basically their logic is like this: Let’s make a tree-climbing competition. The participants would be a monkey and a dolphin. When the dolphin loses, they said to him/her: Well… Monkey could win, so why are you not able to win? We have done a fair competition here. \r\n\r\nTeam Leaders are not leaders. They are just calculating your performance.weekly. They don’t know how to manage people, they are there to press the staff. Also, their work is not transparent to everybody so no one knows what they exactly do. Most of them don’t even know the product, yet you must consult with them for some decisions, no wonder when you ask them to take a decision, they are mostly scared to take action. Of course, not all of them are bad, but there are only a few good Team Leaders. \r\n\r\nThey always think about money and profit so they want you to be an expert on anything. It is expensive to hire an expert or specialist in its field. There is a topic where they expect you to know everything about that in one hour. Yes you are given the time to read for maximum one hour, and you are already the “specialist” for it. While if you go to finance major in university, it probably could take one semester the minimum, They don’t want to give you more time for it. But again, why pay more when you could pay less. Time is money. \r\n\r\nThey fired you without warning. And in the meeting they just deactivated your Slack account so you cannot contact anyone else in the company, they gave a limited time to choose which option of the contract. No time to consult with a lawyer, it is a total bully, someone should not be pressed like that, in fact they should have time to think. Remind me of Orwell’s 1984."}], [{"review_title": "Product Owner", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "14 Feb 2018", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "+ extremely well paid compared to other companies. They pay you a lot in stocks as a bonus for great performance. \r\n+ so fast and innovative\r\n+ really pushes my limits to improve (and change the world in the meantime :) )", "cons": "- no work / life balance\r\n- does not suit people with low energy level"}, {"review_title": "Great company to grow and learn", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "3 Mar 2019", "job_title": "Senior Operations Manager in London, England", "duration": "N/A", "pros": "- Great meritocratic environment, therefore lots of career opportunities if you deliver\r\n- Insane learning curve\r\n- Freedom to shape the product and fulfil your ideas\r\n- Flat structure of the company - everyone works with everyone\r\n- Super complex and interesting field", "cons": "Nothing major to put here, but perks probably could have been better compared to Big Tech"}, {"review_title": "Anoymous", "rating": "3.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "17 Feb 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "+ Flexible working hours\r\n+ Lots of responsibilities and autonomy from day 1\r\n+ Fast-paced and lots to do\r\n+ Product is doing well and prospects are bright", "cons": "- Lack of information sharing, collaboration & team work\r\n- Technical skills & aggressiveness valued above any other skills\r\n- Not a place to grow and learn new skills, but rather to hone existing strengths"}, {"review_title": "Operations", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "23 Jan 2018", "job_title": "Operations Manager in London, England", "duration": "N/A", "pros": "Very exciting phase for the company as it expands globally and releases new features constantly.\r\nOperations is involved in all facets of the firm so you get a solid understanding of the business overall\r\nYou get to work with very smart & ambitious people willing to go the extra mile. \r\nThe learning curve is steep and there is unlimited opportunity for growth.", "cons": "Company is still a startup in many ways - many processes/procedures still defined."}, {"review_title": "Finance Manager", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "13 Jul 2017", "job_title": "Finance Manager in London, England", "duration": "N/A", "pros": "Great Culture - open and transparent \r\nSmart and Helpful Colleagues\r\nCollaborative Atmosphere\r\nAmbitious and interesting projects to work on", "cons": "None - work life balance will shift towards being dedicated to your job - but this is what being passionate is about ! We are building new things everyday !"}, {"review_title": "Start-up environment", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "4 Apr 2018", "job_title": "AML Compliance Analyst in Kraków", "duration": "N/A", "pros": "Fast-paced. Opportunity to learn new things. Fast career growth. Free dinners. Our opinion matters and the management team always take it into consideration.", "cons": "Working hours are quite bad and it is impossible to have a normal 9-5 shift. Weekends and night shifts are expected."}, {"review_title": "A lot needs to change", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "21 Dec 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Product is great idea, lots on offer within the office.", "cons": "Pretty much everything, the whole company is in a mess, with a stream of managers with no experience (most only having internships before leading large scale teams?!?) driving this, they talk about hiring A players yet I would say 90% are C players and would struggle working in any other organisation, the focus has been grow and hire anyone.\r\n\r\nThe Founder Associates drive everything yet they built departments with no knowledge on how to build a business or even the basics in business and finance. We have hired too many non-banking people who have no knowledge of regulations that will impact everything as the company expands. \r\n\r\nThere is no budgeting process in place when recruiting teams, everyone here thinks money is limitless yet money is very limited. \r\n\r\nThe whole organisation needs an overhaul from top to bottom, Nik created a great idea and product yet is now the stopping block for this company being great, he needs to move on to allow the company to succeed further not to mention a bully (I'm surprised no legal, press article has hit about this yet!)\r\n\r\nIf nothing changes in early Q1 2020 this will be a WeWork of the challenger banks, with Martin Gilbert arriving in January he has his work cut out to sort out with the board and in particular his first job (likely from investors being worried) will be to sort out Nik or replace him soon."}, {"review_title": "Ideal for proactive and motivated people", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "14 Feb 2018", "job_title": "Product Owner in London, England", "duration": "N/A", "pros": "- The pace is very fast\r\n- There are lots of opportunities to take up new challenges or more responsibility\r\n- You get exposure to many different things so you learn a lot", "cons": "You will work longer hours than a 9 to 5 job (not a problem if you are enjoying it)"}, {"review_title": "Great startup company", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "14 Feb 2018", "job_title": "Customer Support Team Leader in Kraków", "duration": "N/A", "pros": "- Competitive salary\r\n- Career opportunities to grow\r\n- Passionate and dedicated team\r\n- Great to start your professional career", "cons": "- Still chaotic on some levels\r\n- Processes are still being developed\r\n- No clear structure of certain escalations"}, {"review_title": "Steadily worsening", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "28 Feb 2019", "job_title": "Customer Support Specialist in Kraków", "duration": "N/A", "pros": "Promotion opportunities.\nGreat, warm and informative welcoming/training program.\nDynamic environment.", "cons": "Information during the recruitment process was incomplete or inaccurate, misleading many current/former employees, and the HR team takes absolutely no blame for it.\nEmployee-unfriendly measures are being introduced every day, without any prior warning. Don't take me wrong, it's still great, but less so every day."}], [{"review_title": "The best place to work if you want to build yourself", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "3 Mar 2019", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Extremely goal oriented dynamic environment. Never boring. Challenging and demanding. As a return you have fairness,  knowledge, experience, strong team, contacts and investment in one of the fastest-growing company.", "cons": "If working hard and achieving goals are not your things then I would not recommend."}, {"review_title": "Best product, worst company", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "28 May 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Working on the best product you'll find on the market", "cons": "Worst company litterally ever.\r\n\r\nThey don't know how to manage\r\nDon't know how to evolve\r\nevery single employee is passionate about the product, none like the company, and we loose ~75% of the talents we hire due to that"}, {"review_title": "Start-up atmosphere, being part of the future.", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "3 Mar 2019", "job_title": "Compliance Analyst in Kraków", "duration": "N/A", "pros": "Environment, flexibility, working culture, benefits, large opportunities to develop your career internally.", "cons": "Sometimes the environment changes extremely quickly and it can be difficult to stay tune with all the changes. But I guess this is expected from a start-up. There are some lack of written procedures, and those that do get written down quickly get outdated."}, {"review_title": "Great work, but not so great culture", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "11 May 2020", "job_title": "IOS Developer in London, England", "duration": "N/A", "pros": "- Benefits\r\n- Good tech stack\r\n- Many people to learn from", "cons": "- many people to report to\r\n- harsh timelines, expectations - no work life balance"}, {"review_title": "Only the best survives", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "14 Feb 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "+ great opportunities for self development\r\n+ very skilful team\r\n+ cool friendly atmosphere\r\n+ international team\r\n+ feeling that you create smth useful\r\n+ if work here, you considered to be the best", "cons": "- few processes during iterations\r\n- some people don't understand the matter of discipline\r\n- not fully developed structure\r\n- sometimes feel exhausted"}, {"review_title": "Business Development Manager", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "The product is good and attractive", "cons": "The lack of professionalism, lack of values, massive employees turnover. A company who bullies employees in order to reach out to results. They lead through fear and manipulation. The goal is to look for slaves, because they think you should be greatfull enough for working for them so they are looking for people who will work during the week and weekend, after hours without paying them anything!"}, {"review_title": "Life-changing experience", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "3 Mar 2019", "job_title": "Lead Software Engineer in London, England", "duration": "N/A", "pros": "Fast growing. Lot of opportunities. Can learn a lot of things. Easy to do smth that you want. Easy to try smth that you want to try. Passionate and talented people. True leader CEO, super experienced CTO.", "cons": "No formal rules of how to be promoted"}, {"review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "13 Dec 2019", "job_title": "Ops Manager", "duration": "N/A", "pros": "currently works at a territory team and absolutely love my day-to-day. I was never bored, was given a lot of challenges , and have a great team to work with", "cons": "it's a bit difficult to connect with HQ when working remote at a territory team. HQ should think about how to better engage the territory team"}, {"review_title": "Good place to work and gain experience on a high growth & high paced environment", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "23 Dec 2019", "job_title": "Executive Associate in London, England", "duration": "N/A", "pros": "Very talented people, willing to work hard and get things done. Good environment to learn and test yourself.", "cons": "I understand this is normal to startups, but the environment is quite demanding and the scope of your work is often not clear - you just have to make things work"}, {"review_title": "Exposure to everything", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "23 Jan 2018", "job_title": "Operations Manager in London, England", "duration": "N/A", "pros": "- Get the opportunity to use many different skills such as technical skills through doing in depth analysis to business skills when negotiating with suppliers\r\n- Autonomy, I get to explore many different ways of getting something done efficiently and am not limited my much.", "cons": "The 'getting stuff done' culture isn't right for everyone, it requires a lot of  drive."}], [{"review_title": "Dishonest Team Leader with lack of management skills", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "14 Aug 2019", "job_title": "Customer Support Specialist in Kraków", "duration": "N/A", "pros": "Generally good atmosphere, a lot of events and free food", "cons": "It really all depends which Team Leader you have. I got a Team Lead who was polish and was unable to speak in english, A2 level more less. \r\nThey are firing everyone that they are afraid of. That is terrible and dishonest"}, {"review_title": "Excellent place, the one I was looking for", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "14 Feb 2018", "job_title": "Support in Kraków", "duration": "N/A", "pros": "The motivation, inspiration, and determination that drives the company. Great bunch of people. Awesome Progression each day! A lot to learn every day.", "cons": "Still quite poor structure and social activities within work. Too little trainings to develop rapidly."}, {"review_title": "Great place to grow your skills", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "21 Jun 2019", "job_title": "Software Engineer in Kraków", "duration": "N/A", "pros": "- Plenty of opportunities\r\n- Skilled folks\r\n- Great pay, share options as bonuses\r\n- free fruits, juices, ping pong, nice office", "cons": "- lack of local tech management, mostly management for tech is UK based"}, {"review_title": "A very flexible process", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "17 Sept 2019", "job_title": "Product Manager in London, England", "duration": "N/A", "pros": "Many interesting conversations with smart, passionate people\r\neasy to organise and to work around my schedule\r\ntake home tasks are interesting to do and don't take too much time", "cons": "can be surprising to be recruited without being assigned to a product until the last minute"}, {"review_title": "Ideal place for those who can take ownership of what they do", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "31 Oct 2019", "job_title": "EB Manager in Moscow, Moskva", "duration": "N/A", "pros": "It is a company where you really can find meaning in what you do, you see the goal, you achieve, you get support, you learn, you grow.", "cons": "Everything moves dynamically and changes fast. I can't even say that it's \"cons\" because it's just a challenge you should be ready for."}, {"review_title": "Amazing company to work for", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "23 Jun 2019", "job_title": "Software Engineer in New York, NY", "duration": "N/A", "pros": "It's the perfect place to work.", "cons": "I don't see any cons..."}, {"review_title": "Hard work and resilience required.", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "21 Apr 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- Huge breadth of exposure to work in new areas and work with executives.", "cons": "- Need to focus on hiring experienced leadership. Lack of management in the company is visible and work-force have had to be very autonomous as there is little guidance or acknowledgement offered."}, {"review_title": "Great opportunities to grow", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "9 Apr 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "I have been working at Revolut full-time for less than a year:\r\n\r\n* A lot of responsibilities and high ownership on the projects.\r\n* International professional team with huge ambitious. \r\n* Friendly environment", "cons": "* So far it's perfect match for my personality and what do I expect from the fast growing company."}, {"review_title": "Great hiring process", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "22 Sept 2019", "job_title": "Java Developer in Moscow, Moskva", "duration": "N/A", "pros": "I just accepted the offer from Revolut, so I don’t have any experience as an employee yet, but the recruitment process was great. Everyone at Revolut did their best to help me get through all the interviews. The recruitment manager was very friendly and gave a lot of good advice.", "cons": "No cons, at least for now."}, {"review_title": "Great opportunity to build a revolutionary product and improve your skills", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "19 May 2020", "job_title": "Backend Engineer in Saint Petersburg, Sankt-Peterburg", "duration": "N/A", "pros": "Got a job during the coronavirus pandemic: HR works professionally and fast, all documents and devices (laptop, headphones etc.) were delivered to my home;\r\nExcellent onboarding process;\r\nUnified code conventions for the whole company;\r\nHighly professional colleagues: you improve your skills even during (mandatory) code reviews.", "cons": "No cons found so far"}], [{"review_title": "Efficient Company, High Tech Environment, Modern Facilities", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "31 Jul 2019", "job_title": "Junior FinCrime Analyst in Vilnius", "duration": "N/A", "pros": "Competitive Salary; Fast-paced growing organization with a good reputation", "cons": "The head office is based in London and Krakow, which is why sometimes it is difficult to get quick help on daily tasks as a new hire"}, {"review_title": "Manager", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "24 Jan 2020", "job_title": "Enterprise Risk Manager in London, England", "duration": "N/A", "pros": "Interview process was great, had an offer after 2 months which I accepted. Working environment and people in Revolut are great. People working hard to have top results for the customers and that's a great challenge. Awesome experience so far :-)", "cons": "Nothing so far. Everything seems great"}, {"review_title": "Amazing Recruitment Process!!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "3 Jun 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "+ working with hard-working, smart, proactive and engaged people\r\n+ cool perks\r\n+ good salaries and performance bonuses\r\n+ great career possibilities\r\n+ fast-pased environment (could be a minus for somebody but for me it's a great plus)", "cons": "- sometimes challenging tasks/ deadlines although everything is doable"}, {"review_title": "I'm part of something special", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "13 Jul 2017", "job_title": "Marketing in London, England", "duration": "N/A", "pros": "- Good career development\r\n- Amazing company growth\r\n- Good salary packages\r\n- Good team and office atmosphere", "cons": "- Working hours can be long, but worth it in my opinion"}, {"review_title": "Hiring", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "22 Apr 2020", "job_title": "Anonymous Employee in Vilnius", "duration": "N/A", "pros": "I expected high hopes of this inovative company.", "cons": "I went through all interview and test path - two months or so now no answer at all. A respectful company should give a yes, no or what is happening ATM- any answer at least. Plus HR guy did not know how to answer obvious question about benefits.\r\nGood luck"}, {"review_title": "Operations", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "3 Mar 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Revolut is a life changing experience, while it may not be for everybody as we don't have all an entrepreneur mindset, I think if you are driven, ambitious and want to be evolving in a fast paced environment, this is the place to be!", "cons": "You will love it only if you have an entrepreneur mindset!"}, {"review_title": "Great overall", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "3 Mar 2019", "job_title": "Anonymous Employee in Kraków", "duration": "N/A", "pros": "-Its really great, no point at saying what is good, just few cons below", "cons": "-bonus changes for worse\r\n-taxi order system is horrible \r\n-food orders in Cracow (choose is really, really bad, untasty and unhealthy)"}, {"review_title": "Fantastic experience and place to work.", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "7 May 2019", "job_title": "Lead Recruiter in London, England", "duration": "N/A", "pros": "Excellent perks and salary, plus gives you a lot of experience very quickly.", "cons": "Fast growth brings with it some growing pains"}, {"review_title": "Challenging and rewarding environment", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "3 Sept 2019", "job_title": "Software Engineer in Moscow, Moskva", "duration": "N/A", "pros": "Ability to work in different product teams, challenging tasks", "cons": "Hard to be promoted, reasons for promotion are obscure. More chances to be hired at a higher seniority level than to be promoted."}, {"review_title": "Awful company to work for", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "26 Nov 2017", "job_title": "Analyst", "duration": "N/A", "pros": "Its headquartered in Canary Wharf", "cons": "Poor salary\r\nNo strategy\r\nunorganised start up"}], [{"review_title": "Fantastic Recruitment Process", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "13 Jun 2019", "job_title": "Head of PR & Communications, North America in New York, NY", "duration": "N/A", "pros": "Working with Revolut to land this dream job was a breeze. They were responsive and so easy to work with!", "cons": "I don't have any cons to mention"}, {"review_title": "Anonymous", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "26 Mar 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Stuff actually gets done\r\nEveryone who works here is extremely passionate about the company\r\nLots of friendly nice \r\nLots of responsibility from day one \r\nAge doesn't matter - you can excel if you're smart and hardworking \r\nLots of space to learn", "cons": "Can be company politics due to lack of structure\r\nTeamwork isn't always encouraged very well\r\nLong hours"}, {"review_title": "Avoid like the plague if you are at least somewhat experienced", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "20 Apr 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "You may get some stock options if your performance is deemed as \"good\" by senior management / founders", "cons": "Everything else.\r\n\r\nFounders don't understand the value of experience.\r\nWork / life balance is non-existent.\r\nSenior management is unprofessional.\r\nCulture is hyper-political (but founders don't seem to understand that)."}, {"review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "3 Mar 2019", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Loads of opportunities to develop and progress your career.", "cons": "A fast moving culture means working here is a serious commitment, but the benefit of the experience gained far outweighs the time commitment."}, {"review_title": "Great company to work for", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "4 Aug 2019", "job_title": "Customer Success Manager in London, England", "duration": "N/A", "pros": "Great company to work for, amazing environment.\r\n\r\n- free breakfast, soda/juice, coffee, tea etc.\r\n- work from home a day a week\r\n- sick pay\r\n- holiday (including bank holidays) 39!", "cons": "lack of middle management"}, {"review_title": "Fast growing company - amazing environment and many opportunities to grow and learn", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "26 Nov 2019", "job_title": "Marketing Manager in London, England", "duration": "N/A", "pros": "Fast growing company - amazing environment and many opportunities to grow and learn", "cons": "Things are moving very fast, many new processes and sometimes is a bit messy"}, {"review_title": "Agile company - Not perfect but problems are fixed quickly.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "18 Feb 2020", "job_title": "Senior Technical Recruiter in London, England", "duration": "N/A", "pros": "- Quick decision making\r\n- Issues taken seriously and revolved in a timely fashion\r\n-Extreme growth \r\n- Great management", "cons": "- Can be very hectic as in hyper growth"}, {"review_title": "Excellent Progress and Work Ethic", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "14 Feb 2018", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "The motivation and determination that drives the company \r\nGood group of people \r\nGreat Progression - Guaranteed progression pretty much!", "cons": "Poor structure \r\nSocial activities within work - but could be due to the people in office."}, {"review_title": "A place to raise your title", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "14 Feb 2018", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Good place to gain skills.\r\nYour dream comes true. \r\nFast title raise. \r\nAmazing people!\r\nGreat benefits.", "cons": "Unable to get instant answers from relevant departments when there is a really urgent case."}, {"review_title": "Fast paced & challenging", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "15 Feb 2018", "job_title": "Product Owner in London, England", "duration": "N/A", "pros": "- huge personal growth and learning opportunity\r\n- company is really pro innovation and ownership\r\n- chance to be part of something amazing", "cons": "- you have to be a self starter & dedicated - only suits people that are driven"}], [{"review_title": "The place to be if you look for more than just a job", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "21 Feb 2018", "job_title": "Business Development in London, England", "duration": "N/A", "pros": "- Work ethics\r\n- Meritocratic\r\n- Hyper rationale culture: no BS, no politics", "cons": "- Corporate culture could be more fun too"}, {"review_title": "Great place to work!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "3 Mar 2019", "job_title": "AML Compliance Analyst in Kraków", "duration": "N/A", "pros": "Best culture, very friendly, not like corporation. I totally recommend.", "cons": "I'm working there almost one year and really I didnt find any cons in relation to my previous employers."}, {"review_title": "The best job I've ever had", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "25 Feb 2020", "job_title": "Python Developer in London, England", "duration": "N/A", "pros": "Salary above the market average, free relocation, tons of small perks like free food delivery to the office", "cons": "No cons have been found so far"}, {"review_title": "Like a rocket ship of experience", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "4 Mar 2019", "job_title": "Manager", "duration": "N/A", "pros": "+ Experience\r\n+ Surrounded by intelligent people\r\n+ Perfect place to learn\r\n+ Full autonomy\r\n+ A challenge\r\n+ We live by the truth of things", "cons": "- You will be expected to work hard (we are building something big)"}, {"review_title": "Great place, great people!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "15 Feb 2018", "job_title": "Customer Service Agent in Kraków", "duration": "N/A", "pros": "Great atmosphere, awesome people, 8h shifts, they are taking care of their employees, good salary, when you've day off you really have a day off", "cons": "None so far, like really"}, {"review_title": "An enjoyable & inspiring place", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "29 Nov 2018", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Friendly & super cool working environment\r\nCareer opportunities\r\nFast moving train\r\nAmazing amount of great people/talents around you", "cons": "The fast-paced environment requires self-driven and highly motivated people"}, {"review_title": "its ok to work here", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "11 Oct 2017", "job_title": "Test Automation Engineer in Moscow, Moskva", "duration": "N/A", "pros": "Interesting projects and good compensations.", "cons": "Really bag management. Very uncomfortable  situation at the office."}, {"review_title": "Awesome company, changing the face of banking", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "14 Feb 2018", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "- Fintech leader, great product\r\n- Friendly team\r\n- Free Macbook\r\n- Innovative\r\n- Values proactivity and self-development\r\n- Free cookies every day!", "cons": "- Not everyone can keep up the fast-paced environment"}, {"review_title": "Working at Revolut", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "3 Mar 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Friendly and flexible working environment. Fast-growing company with many new things to learn.\r\nA lot of internal opportunities to move around teams and learn about different aspects of Revolut.", "cons": "Structure of teams could be improved and be more organised by senior management."}, {"review_title": "The faster growing-up startup in Europe.", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "9 Feb 2018", "job_title": "Senior IOS Engineer in Moscow, Moskva", "duration": "N/A", "pros": "The faster growing-up startup in Europe.\r\nThere is good iOS Developer team with great technicals skills", "cons": "There is food service and kitchen only  in London's office"}], [{"review_title": "Operations Manager", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "14 Feb 2018", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "- Very fast pace\r\n- Driven, constructive and very direct colleagues\r\n- Amazing products, like, really!!!", "cons": "- Culture is not for everyone\r\n- Not very social\r\n- Long hours"}, {"review_title": "Good employer, however you just get directions from Lodnon HQ", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "5 Jul 2019", "job_title": "Product Owner", "duration": "N/A", "pros": "People,\r\nSalary,\r\nVibe,\r\nBerlin,\r\nPerks,\r\nYou can bring your pet", "cons": "No development plans, everything depends from the HQ, you just follow orders"}, {"review_title": "Lack of structure that leads to mismanagement and miscommunication", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "21 Apr 2020", "job_title": "Customer Support Specialist in Kraków", "duration": "N/A", "pros": "Open Office - Benefits - Employees  - Easy to provide feedback - Quickly Changing", "cons": "No Structure - Miscommunication -  Disorganized - Lack of Responsibility"}, {"review_title": "Loved the job - would work there again", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "19 May 2020", "job_title": "Portfolio Manager in London, England", "duration": "N/A", "pros": "high and competitive salary\r\nstrong culture\r\ngreat coaching", "cons": "The opportunity to move horizontally can be improved"}, {"review_title": "Getting it done", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "3 Mar 2019", "job_title": "Operations in London, England", "duration": "N/A", "pros": "- Amazing learning\r\n- Transparent and actionable feedback\r\n- Huge impact\r\n- Minimum red tape\r\n- Exceptional people", "cons": "- Long hours (although not compulsory)\r\n- Needs more structure"}, {"review_title": "Learning on mistakes", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "4 Mar 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Fast changing environment, open feedback culture, great opportunities to learn", "cons": "Company is learning on mistakes, still gaining experience in managing people"}, {"review_title": "its not for everyone", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "4 Mar 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- exciting work, what you do will help define how the company moves forward\r\n- surrounded by ridiculously intelligent and driven people\r\n- complete autonomy", "cons": "- sparse communication between top management and everyone else\r\n- lack of shared learnings"}, {"review_title": "Great company to develp skills.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "13 Apr 2019", "job_title": "Transfer Investigations Team Leader in Kraków", "duration": "N/A", "pros": "Freedom of actions, possibility to learn something new every day.", "cons": "Some processes are not settled yet."}, {"review_title": "Great Interview Process. Very positive and passionate vibe from everyone involved.", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "19 Aug 2019", "job_title": "Head of Growth in Toronto, ON", "duration": "N/A", "pros": "- Passionate team members\r\n- Innovative and move fast culture\r\n- Exciting stage within the lifecycle\r\n- Professional, friendly and timely interview process\r\n- Great future outlook", "cons": "- Can't think of any."}, {"review_title": "5 words review", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "28 Apr 2020", "job_title": "Senior Software Engineer in London, England", "duration": "N/A", "pros": "interesting greenfield projects to develop from scratch", "cons": "aggressive corporate culture with the lack of work life balance"}], [{"review_title": "work in progress", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "16 Oct 2018", "job_title": "Recruiter in London, England", "duration": "N/A", "pros": "fast growing exciting game changer", "cons": "everything about culture employee management"}, {"review_title": "Not bad not good either", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "24 Sept 2019", "job_title": "Business Analyst in London, England", "duration": "N/A", "pros": "Super cool company to work for, its a new fintech and tons of thing happening", "cons": "Salary is not so great"}, {"review_title": "My great experience", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "14 Feb 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Young, dynamic team; positive atmosphere, a lot of room for creativity, involvement in the bigger picture even on lower levels", "cons": "Sometimes there really is a lot of work"}, {"review_title": "Place to make an impact", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "15 Feb 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "+ You get the resources you need for projects\r\n+ Hard working, delivery focused culture\r\n+ Strong brand\r\n+ Great benefits, convenient office", "cons": "- Geographically spread out teams (being fixed up to the possible extent)"}, {"review_title": "Compliance", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "3 Mar 2019", "job_title": "Compliance Analyst in Kraków", "duration": "N/A", "pros": "Team leader Darius N. Is the best team leader anyone could ever imagine and honestly the best thing about Revolut.", "cons": "Night shift went down from 200%  to 150."}, {"review_title": "Latest press is wrong.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "3 Mar 2019", "job_title": "Customer Service Team Lead in Kraków", "duration": "N/A", "pros": "I go to work to meet great people and do some great stuff in the meantime.", "cons": "Prioritization of improvements. Too many ideas VS still low numbers of developers."}, {"review_title": "Good management, nice people", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "4 Sept 2019", "job_title": "Senior Android Engineer in Saint Petersburg, Sankt-Peterburg", "duration": "N/A", "pros": "very fast growing, good benefits, experienced people who share knowledge, good employees recognition, strong release train", "cons": "little diversity in some teams, but company grows in this way"}, {"review_title": "Get It Done", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "30 Oct 2019", "job_title": "Product Marketing Manager in London, England", "duration": "N/A", "pros": "Great people, fantastic office, shared vision, worthwhile cause.", "cons": "High growth businesses are not for everyone; you really need to be a self-starter and identify challenges and opportunities yourself"}, {"review_title": "Good, but not for everyone", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "2 Jan 2020", "job_title": "Product Associate in London, England", "duration": "N/A", "pros": "* A lot of opportunities to learn\r\n* A lot of responsibilities \r\n* A lot of perks and flexibility", "cons": "* Huge pressure \r\n* Crazy working hours \r\n* Politics"}, {"review_title": "Cool product, WORST culture", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "4 May 2020", "job_title": "Product Owner in London, England", "duration": "N/A", "pros": "Cool product that is used by millions. Exciting and fast-pace", "cons": "Poor management style. Moral compass is really off. I've seen people being fired with little communication or warning. \n\nOverpromised the role n scope when hiring. Unclear, ever-changing direction (normal for startups but pls don't change every week). \n\nDo not treat ppl as human but some machine/resource. Zero care."}], [{"review_title": "The worst company I ever worked for", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "31 May 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Quite good salary \r\nFood for late shifts, fruits and cereal", "cons": "- only KPIs matter, doing your job properly comes second\r\n-compliance team is full of unqualified people\r\n- the work culture is awful \r\n- high positions are occupied by people with no or very little experience"}, {"review_title": "Good place to work if you want to relocate to London", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "13 Oct 2019", "job_title": "Java Developer in Moscow, Moskva", "duration": "N/A", "pros": "Easy relocation\r\nInteresting project\r\nBonuses\r\nMandatory business trips to London", "cons": "Work life balance\r\nProcesses, workflow (it is still startup)\r\nBad atmosphere"}, {"review_title": "Working experience in Revolut", "rating": "3.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "14 Aug 2019", "job_title": "Costumer Support in Porto, Oporto", "duration": "N/A", "pros": "Start up that is growing really fast\r\nA lot of opportunities to grow as a professional", "cons": "Some things doesn't grow or follow the same speed as the company"}, {"review_title": "Aggressive culture & unclear accountability", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "27 Nov 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Intelligent people, bias to action, good benefits, high ambition", "cons": "No life-work balance, unclear accountabilities, aggressive culture and management do not know how to communicate or inspire"}, {"review_title": "Rewarding but Demanding", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "29 Apr 2020", "job_title": "Product Associate in London, England", "duration": "N/A", "pros": "Ownership of a project\r\nBig impact on the company \r\nGreat team\r\nPersonal development", "cons": "Too much work\r\nLong work hours"}, {"review_title": "Consider carefully", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "14 Dec 2017", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "All you can drink coffee/tea/diet coke", "cons": "Poor management\r\nLack of leadership and direction\r\nArrogant and ignorant CEO and COO\r\nUnprofessionaliam throughout"}, {"review_title": "Exciting growth but bad culture", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "5 Jan 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Growth was really fast, fun team, cool product.", "cons": "Bad working culture, staff not really respected."}, {"review_title": "R LOVE T", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "6 Feb 2018", "job_title": "Senior Android Engineer in London, England", "duration": "N/A", "pros": "Energy, StartUp, Modern technologies, Nice new office", "cons": "Low life-work balance, more responsibility, remote offices in Russia, no gym and swimming pool"}, {"review_title": "Burnouted completely", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "3 Nov 2019", "job_title": "Software Engineer", "duration": "N/A", "pros": "Perks are amazing, stock options, office is amazing", "cons": "Work/life balance and burnout. HR should be improved"}, {"review_title": "Management of Start- up quality", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "24 Oct 2019", "job_title": "Compliance Analyst in Kraków", "duration": "N/A", "pros": "Modern Office, Daily quality meals", "cons": "Incompetent Team- Leaders, Managers are Uninterested and uncommitted."}], [{"review_title": "Revolut made me an expert in my field", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "14 Feb 2018", "job_title": "Business Development in London, England", "duration": "N/A", "pros": "Hands-on practical approach to finance and technology\r\nBuilding a world-class product\r\nGreat CEO\r\nRewarding\r\nEngaging", "cons": "The office can get a little messy"}, {"review_title": "Product Associate", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "17 Oct 2019", "job_title": "Product Support Associate in London, England", "duration": "N/A", "pros": "HR keep to time and respond on time to any issues.", "cons": "No comment of  any."}, {"review_title": "good salary and big impact", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "19 Oct 2019", "job_title": "Senior Software Engineer in Kraków", "duration": "N/A", "pros": "Corporation with startup roots, lots of flexibility.", "cons": "To get things done you need to workout a lot of information on your own"}, {"review_title": "I like working here", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "5 Jun 2020", "job_title": "Android Software Engineer in London, England", "duration": "N/A", "pros": "Great team, interesting tasks, great opportunity to grow", "cons": "It is still a startup"}, {"review_title": "Best company to work for", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "3 Mar 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "+ lots of learning \r\n+ upside", "cons": "no negatives, at least for me, many people would say - bad work life balance"}, {"review_title": "Worst company to work for", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "26 Feb 2020", "job_title": "Customer Support Specialist in Kraków", "duration": "N/A", "pros": "There are some nice and talented people", "cons": "Unrealistic KPI's\nPoor Mangement\nHigh Pressure\nI wish I could rate less than 1 star"}, {"review_title": "Unique and Leading Edge", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "14 Feb 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "result-driven\r\npro-active\r\nleader in the space\r\nvalues innovative and out-of-the box thinking\r\nflat hierarchy", "cons": "work-life balance\r\ndemanding\r\nvisibility on company's future direction"}, {"review_title": "Spread your wings", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "4 Mar 2019", "job_title": "Backend Engineer in Kraków", "duration": "N/A", "pros": "Company allows you to use your full skill set", "cons": "The job is not for everyone, definitely need to watch work life balance"}, {"review_title": "Head of Anti-money laundering unit, MLRO", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "2 Jan 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Disrupting technology focused fin-tech startup, with extremely bright people on board", "cons": "Challenging while in growth, all nee process set-up"}, {"review_title": "Solving a great problem in a bad way.", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "25 Mar 2020", "job_title": "Product Design in Kraków", "duration": "N/A", "pros": "Recognition + lots of decent professionals", "cons": "Lack of consistent strategy and bad work culture"}], [{"review_title": "Revolut", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "19 Apr 2020", "job_title": "Android Developer", "duration": "N/A", "pros": "Interesting product, highly experienced team", "cons": "High pace of development, but i think it's a normal thing for company which growth up and go on"}, {"review_title": "Great company and amazing people", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "14 Feb 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "— Great Culture - open and transparent\r\n— Great opportunities\r\n— Responsibility\r\n— Compensation and benefits", "cons": "There aren't. I don't see them."}, {"review_title": "Avoid", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "25 Sept 2019", "job_title": "KYC Analyst", "duration": "N/A", "pros": "Good work experience / Nice collegues", "cons": "Long working hours\r\nShifts\r\nLow salary\r\nNot enough benefits"}, {"review_title": "Don't really reccomend", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "1 Jun 2020", "job_title": "Business Customer Service Representative in Kraków", "duration": "N/A", "pros": "Usual customer support, not really amazing", "cons": "Nightmarish users who expect you to know anything."}, {"review_title": "Competitive workplace", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "14 Feb 2018", "job_title": "Data in London, England", "duration": "N/A", "pros": "Lots of different projects, smart people, and hard workers", "cons": "The pace is very fast (pro or a con?)"}, {"review_title": "A bit of chaos here and there", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "14 Apr 2020", "job_title": "Software Engineer", "duration": "N/A", "pros": "Amazing product, great colleagues, competitive salary", "cons": "Management need to improve, long working hours"}, {"review_title": "Please, avoid", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "27 May 2020", "job_title": "Service Function", "duration": "N/A", "pros": "You can accidentally get promoted for no achievements.", "cons": "This company is a mess. The culture is at least a century behind the market. Every project turns into a mere chaos in no time. Do yourself a favour and find something better to do."}, {"review_title": "Superb and Exciting Company to work at", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "16 Jul 2019", "job_title": "Internal Auditor in London, England", "duration": "N/A", "pros": "- Exciting work.\r\n- Collaborative.\r\n- Fast Paced.", "cons": "- Lack of Clarity at times"}, {"review_title": "Designer", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "13 Jul 2017", "job_title": "Product Designer in Moscow, Moskva", "duration": "N/A", "pros": "— Great opportunities\r\n— Challenges\r\n— Responsibility", "cons": "For now, everything is ok"}, {"review_title": "Software Engineer", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "7 Oct 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Expanding extremely rapidly, plenty of room for growth", "cons": "Everyone works very hard therefore you are expected to do the same"}], [{"review_title": "-", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "28 Oct 2019", "job_title": "Anonymous Employee in Kraków", "duration": "N/A", "pros": "Great people and atmosphere\r\nVery nice office\r\nNice perks and benefits", "cons": "No structure\r\nNo trainings\r\nLack of communication between teams and departments\r\nMany not suitable managers"}, {"review_title": "Unbelievably amazing and ambitious company!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "31 Oct 2019", "job_title": "Redacted", "duration": "N/A", "pros": "+ Super fast faced and driven company", "cons": "There are no downsides to working at Revolut"}, {"review_title": "Good company", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "14 Dec 2019", "job_title": "Customer Support Specialist in León, Guanajuato", "duration": "N/A", "pros": "They give you all the feedback you need.", "cons": "There is none really :)"}, {"review_title": "Very demanding and fast environment", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "8 Apr 2020", "job_title": "Technical Support in Kraków", "duration": "N/A", "pros": "Ability to learn how each department operates", "cons": "Too high pace does not allow to master skills required"}, {"review_title": "Revolut Review", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "22 Nov 2019", "job_title": "Lead Product Owner", "duration": "N/A", "pros": "High Responsibility, Big Impact, Exposure", "cons": "Need to be flexible, change direction fast"}, {"review_title": "Great company", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "12 May 2020", "job_title": "Customer Support Specialist in Kraków", "duration": "N/A", "pros": "Great communication within team, opportunities for growth", "cons": "Poor communication between teams and line managers"}, {"review_title": "Next big thing", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "20 Feb 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Amazing team\r\nGreat CTO & CEO\r\nGamechanging product", "cons": "Package could be better\r\nLack of structure"}, {"review_title": "good", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "26 Jun 2019", "job_title": "Transfer Investigation Specialist", "duration": "N/A", "pros": "environment, people, career, salary, schedule", "cons": "I do not think there is anything"}, {"review_title": "Amazing", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "10 Jul 2019", "job_title": "Tech Administrative in London, England", "duration": "N/A", "pros": "This workplace has really excelled my career", "cons": "No real cons, no issues"}, {"review_title": "Best company", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "24 Jan 2020", "job_title": "Aircraft Mechanic, Assistant in Kraków", "duration": "N/A", "pros": "Good level of management, great office", "cons": "The salary should be higher"}], [{"review_title": "Great experience", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "14 Feb 2020", "job_title": "IT Manager in Vilnius", "duration": "N/A", "pros": "Good communication, welcoming atmosphere, clear company values", "cons": "During one call there was too much background noise"}, {"review_title": "Great place for high avievsers", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "20 May 2020", "job_title": "Anonymous Employee in Moscow, Moskva", "duration": "N/A", "pros": "Great team, high speed, well equipped", "cons": "A bit pressure, it’s ok based on goals"}, {"review_title": "Great place to work... was", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "5 Jun 2020", "job_title": "Anonymous Employee in Kraków", "duration": "N/A", "pros": "People, management (some of them), salary, additional roles", "cons": "Management (some of them), care about people"}, {"review_title": "Best company EVER!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "18 Oct 2019", "job_title": "FinCrime Analyst in Porto, Oporto", "duration": "N/A", "pros": "The people are amazing! The onboarding process is 5stars!", "cons": "can't think of any cons!"}, {"review_title": "company review", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "13 Oct 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "A good place to work", "cons": "NO work-life balance and stressful"}, {"review_title": "Good Company", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "23 Jan 2020", "job_title": "Lead Recruiter", "duration": "N/A", "pros": "Great benefits\r\nLots of autonomy \r\nGood tech\r\nSmart people", "cons": "Long hours at times can be tiring"}, {"review_title": "n/a", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "9 Feb 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Opportunity to be creative and  work on projects.", "cons": "Worst company culture. No recognition. Bullying from top management and employees that care more about stepping on you to advance rather than helping."}, {"review_title": "Customer Support Specialist", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "5 Nov 2018", "job_title": "Customer Support Specialist in Kraków", "duration": "N/A", "pros": "There is a bunch of them.", "cons": "For me - no cons, seriously."}, {"review_title": "Very interesting business and projects", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "27 Aug 2019", "job_title": "Senior Backend Engineer in Moscow, Moskva", "duration": "N/A", "pros": "Very interesting business and projects", "cons": "Company is not mature yet"}, {"review_title": "Good to start", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "18 Jan 2020", "job_title": "Programmer Analyst", "duration": "N/A", "pros": "Good environment , bring people to work with", "cons": "Bad salary in overall judgement"}], [{"review_title": "People too stressed to relax", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "21 Mar 2019", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Company has a good reputation outside of itself as a fast-paced growing organisation.", "cons": "People are much too busy and arrogant to even think about employee well-being."}, {"review_title": "Good place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "13 Apr 2020", "job_title": "Senior PM in London, England", "duration": "N/A", "pros": "fun, kind, loving, fast paced, rewarding", "cons": "busy, isolating, processes, business oriented,"}, {"review_title": "Good company", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "7 Mar 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Self development opportunities,  Talented individuals", "cons": "Long hours can lead to burnout"}, {"review_title": "Not bad", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "9 Jun 2020", "job_title": "Software Engineer", "duration": "N/A", "pros": "well known company in Europe", "cons": "- strange top managment behavior\r\n- bad promotion schema"}, {"review_title": "Too little attention to employee", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "16 Jan 2020", "job_title": "Consulting Senior Manager", "duration": "N/A", "pros": "very good product and people", "cons": "Employee is not really valued"}, {"review_title": "Good place", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "7 Feb 2020", "job_title": "Business Development Manager in London, England", "duration": "N/A", "pros": "good company\r\nlearn a lot ...", "cons": "sometimes need for long hours"}, {"review_title": "review", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "22 Nov 2018", "job_title": "Tech Recruiter in Moscow, Moskva", "duration": "N/A", "pros": "all is good at Revolut", "cons": "i cannot find nothing bad"}, {"review_title": "PM", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "15 Dec 2019", "job_title": "Product Manager", "duration": "N/A", "pros": "Nice place to work in.", "cons": "none, everything is very nice"}, {"review_title": "Worst company", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "27 Apr 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Could not find anything good to say", "cons": "Worst company ever.\r\nI will definitely not recommend Revolut as a place to work to anyone"}, {"review_title": "average", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "21 Mar 2020", "job_title": "Financial Crimes Analyst in Kraków", "duration": "N/A", "pros": "variety of benefits, friendly enviroment", "cons": "lack of communication, poor management"}], [{"review_title": "Risk Officer", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "19 Aug 2019", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Please Do not work here", "cons": "Staff are treated like dirt"}, {"review_title": "Already looking elsewhere", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "10 Jul 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Free snack and drinks, wow", "cons": "Management are shocking, expectations of their staff are wild."}, {"review_title": "Head of Ops", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "High focus on short term", "cons": "Terrible work culture. Slave driving from CEO"}]]