{"Boeing": {"company_name": "Boeing", "company_code": 102, "website": "www.boeing.com", "headquarters": "Washington, United States", "size": "10000+ Employees", "founded": "1916", "type": "Company - Public (BA)", "industry": "Aerospace & Defence", "revenue": "$10+ billion (USD)", "employer_description": "The story of our company is woven together from thousands of individual stories of engineers and technicians. Scientists and thinkers. Innovators and dreamers. Equity, diversity and inclusion are crucial to our employees, our stakeholders, and our communities. These foundational principles are how we create the most innovative aerospace products and services in the world. After all, we go further together.Boeing is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion, national origin, gender, sexual orientation, gender identity, age, physical or mental disability, genetic factors, military/veteran status or other characteristics protected by law.", "mission": "Not provided on Glassdoor"}, "Cathay-Pacific": {"company_name": "Cathay-Pacific", "company_code": 7531, "website": "www.cathaypacific.com", "headquarters": "Hong Kong, Hong Kong", "size": "10000+ Employees", "founded": "1946", "type": "Company - Public (CPCAY)", "industry": "Airlines, Airports & Air Transportation", "revenue": "$10+ billion (USD)", "employer_description": "Hong Kong's leading airline, Cathay Pacific Airways flies passengers and cargo to about 120 destinations around the globe, including some served by code-sharing partners. (Code-sharing allows airlines to sell tickets on one another's flights and thus extend their networks.) Cathay Pacific's partners include fellow members of the Oneworld alliance, which is led by AMR's American Airlines, British Airways, and Japan Airlines. Overall, Cathay Pacific, regional subsidiary Dragonair, and majority-owned cargo unit Air Hong Kong maintain a fleet of about 130 aircraft. Airline operations account for nearly all of the company's sales; other Cathay Pacific units provide flight catering, maintenance, and related services.", "mission": "Not provided on Glassdoor"}, "Lazada": {"company_name": "Lazada", "company_code": 578726, "website": "www.lazada.com", "headquarters": "Singapore, Singapore", "size": "5001 to 10000 Employees", "founded": "2012", "type": "Company - Private", "industry": "Other Retail Shops", "revenue": "Unknown / Non-Applicable", "employer_description": "Lazada Group is Southeast Asia's pioneer eCommerce platform. For the last 10 years, Lazada has been accelerating progress in Indonesia, Malaysia, the Philippines, Singapore, Thailand and Vietnam through commerce and technology. Today, a thriving local ecosystem links about 160 million active users to more than one million actively-selling sellers every month, who are transacting safely and securely via trusted payments channels and Lazada Wallet, receiving parcels through a homegrown logistics network that has become the largest in the region.With a vision to achieve USD100 billion annual GMV, Lazada aims to serve 300 million shoppers by 2030, and be the best at enabling brands and sellers in digitalizing their businesses.In 2022, the Lazada Foundation was set up to empower youths and women for the digital future, close the gender digital divide and uplifting communities by creating positive impact. More information can be found here: https://group.lazada.com/en/foundation/.", "mission": "Accelerating progress in Southeast Asia through commerce and technology."}, "GE": {"company_name": "GE", "company_code": 277, "website": "www.ge.com", "headquarters": "Boston, United States", "size": "10000+ Employees", "founded": "1892", "type": "Company - Public (GE)", "industry": "Machinery Manufacturing", "revenue": "$10+ billion (USD)", "employer_description": "For more than 125 years, GE has invented the future of industry, and today the company’s dedicated team, leading technology, and global reach and capabilities help the world work more efficiently, reliably, and safely. GE’s people are diverse and dedicated, operating with the highest level of integrity and focus to fulfill GE’s mission and deliver for its customers.", "mission": "GE rises to the challenge of building a world that works."}, "Scoot": {"company_name": "Scoot", "company_code": 537894, "website": "www.flyscoot.com/en/hr/jobs-home", "headquarters": "Singapore, Singapore", "size": "Unknown", "founded": "2011", "type": "Company - Private", "industry": "Airlines, Airports & Air Transportation", "revenue": "Unknown / Non-Applicable", "employer_description": "Scoot isn’t your typical airline, and we’re so much more than just an expanding airline connecting passengers with our incredible network – in fact, our tagline is to Escape the Ordinary!From wacky Scootitude flights to our fun and casual working environment, there is never a boring day on ground or up in the air. Here, we believe in celebrating individuality, openness, and empowerment, and we are looking for people with big smiles and even bigger personalities to join us in changing the way people travel!Follow us on social media:Facebook: @GotScootitudeInstagram: @thescootlifeLinkedIn: @Scoot", "mission": "Escape the Ordinary"}, "Gitlab": {"company_name": "Gitlab", "company_code": 1296544, "website": "about.gitlab.com", "headquarters": "San Francisco, United States", "size": "1001 to 5000 Employees", "founded": "2011", "type": "Company - Public (GTLB)", "industry": "Enterprise Software & Network Solutions", "revenue": "Unknown / Non-Applicable", "employer_description": "GitLab is the world's largest all-remote company, with more than 1,300 team members in more than 67 countries. As part of the GitLab team, you can work from pretty much anywhere, and you'll have the freedom to contribute when and where you do your best work. Plus, you'll be part of an ambitious, kind, and productive team that embraces a set of shared values in everything that we do. Build software faster. The One DevOps Platform enables the entire organization—including business teams and non-technical stakeholders—to collaborate around your business-critical code, whether you’re the largest enterprise, the smallest startup, or anywhere in between.", "mission": "Everyone can contribute."}, "Huawei": {"company_name": "Huawei", "company_code": 9304, "website": "www.huawei.com", "headquarters": "Shenzhen, China", "size": "10000+ Employees", "founded": "1987", "type": "Company - Private", "industry": "Telecommunications Services", "revenue": "$10+ billion (USD)", "employer_description": "Huawei is a global leader of ICT solutions. Continuously innovating based on customer needs, we are committed to enhancing customer experiences and creating maximum value for telecom carriers, enterprises, and consumers. Our telecom network equipment, IT products and solutions, and smart devices are used in 170 countries and regions. In 2017, The company's total annual revenue was CNY603.6 billion (US$92.5 billion) based on year-end exchange rates, an increase of 15.7% over 2016.Net profits were CNY47.5 billion (US$7.3 billion), an increase of 28.1% year-on-year. In 2017, Huawei's annual investment in research and development reached CNY89.7billion (US$13.8 billion), up 17.4% compared with 2016. The company's total R&D spend over the past decade has exceeded CNY394 billion (US$60.4 billion). More than 45% of our 180,000 employees engage in R&D.A synergy was created between our Huawei and Honor brands. In 2017, Huawei shipped a total of 153 million smartphones (including Honor phones). We are firmly positioned among the top three phone makers in the world. We released the HUAWEI Mate 10 – the first smartphone with an embedded AI chipset.The Huawei Innovation Research Program (HIRP) has involved over 400 research institutions and 900 companies in more than 30 different countries and regions. We collaborate on joint innovation projects relating to 5G algorithms, AI technology, network intelligence, nanomaterials, and other cutting-edge technologies. These efforts in technological innovation helped us make breakthroughs and drive industry development and business success.Leveraging our experience and expertise in the ICT sector, we help bridge the digital divide and promote high-quality broadband connectivity for all. As an advocate of socioeconomic sustainability, we make every effort to support secure and stable network operations, and help customers and industries improve efficiency to drive low-carbon economic growth. By localizing our operations and building a global value chain, we help local innovators maximize their global value and share win-win outcomes.", "mission": "Not provided on Glassdoor"}, "TSMC": {"company_name": "TSMC", "company_code": 4130, "website": "www.tsmc.com.tw", "headquarters": "Hsinchu, Taiwan", "size": "10000+ Employees", "founded": "Not provided on Glassdoor", "type": "Company - Public (TSM)", "industry": "Electronics Manufacturing", "revenue": "$10+ billion (USD)", "employer_description": "If you're absolutely fabless, this is the company for you. Taiwan Semiconductor Manufacturing Company (TSMC) is the first and largest dedicated silicon foundry (contract semiconductor manufacturer) in the world, with eight plants in Asia and one in the US. TSMC makes chips for fabless semiconductor and systems companies (accounting for about 80% of sales), such as Advanced Micro Devices and Broadcom, and integrated device manufacturers (some 20% of sales), including LSI Corporation and STMicroelectronics. The company gets more than two-thirds of its sales from customers in North America.", "mission": "Not provided on Glassdoor"}, "Kinder-Morgan": {"company_name": "Kinder-Morgan", "company_code": 4156, "website": "www.kindermorgan.com", "headquarters": "Houston, United States", "size": "10000+ Employees", "founded": "1997", "type": "Company - Public (KMI)", "industry": "Energy & Utilities", "revenue": "$10+ billion (USD)", "employer_description": "Kinder Morgan is the largest energy infrastructure company in North America. We own an interest in or operate approximately 84,000 miles of pipelines and approximately 180 terminals. Our pipelines transport natural gas, gasoline, crude oil, carbon dioxide (CO2) and more. Our terminals store and handle petroleum products, chemicals and other products.", "mission": "Not provided on Glassdoor"}, "HSBC": {"company_name": "HSBC", "company_code": 3482, "website": "www.hsbc.com", "headquarters": "London, United Kingdom", "size": "10000+ Employees", "founded": "1865", "type": "Company - Public (HSBC)", "industry": "Banking & Lending", "revenue": "$10+ billion (USD)", "employer_description": "One of the world's largest banking groups by assets, HSBC Holdings owns subsidiaries throughout Europe, Hong Kong and the rest of the Asia/Pacific region, the Middle East and Africa, and the Americas. All told, the company has some 7,500 locations in more than 80 countries. Its activities include consumer and commercial banking, credit cards, private banking, investment banking, and leasing. Its North American operations comprise HSBC USA, HSBC Bank Canada, HSBC Bank Bermuda, and Grupo Financiero HSBC in Mexico.", "mission": "Throughout our history we have been where the growth is, connecting customers to opportunities. We enable businesses to thrive and economies to prosper, helping people fulfil their hopes and dreams and realise their ambitions. This is our role and purpose."}, "Qualcommm": {"company_name": "Qualcommm", "company_code": 640, "website": "www.qualcomm.com", "headquarters": "San Diego, United States", "size": "10000+ Employees", "founded": "1985", "type": "Company - Public (QCOM)", "industry": "Computer Hardware Development", "revenue": "$10+ billion (USD)", "employer_description": "Qualcomm is a company of inventors designing the cutting-edge wireless technologies the world runs on.", "mission": "Qualcomm is enabling a world where everyone and everything can be intelligently connected."}, "Apple": {"company_name": "Apple", "company_code": 1138, "website": "www.apple.com", "headquarters": "Cupertino, United States", "size": "10000+ Employees", "founded": "1976", "type": "Company - Public (AAPL)", "industry": "Computer Hardware Development", "revenue": "$10+ billion (USD)", "employer_description": "We’re a diverse collection of thinkers and doers, continually reimagining what’s possible to help us all do what we love in new ways. The people who work here have reinvented entire industries with the Mac, iPhone, iPad, and Apple Watch, as well as with services, including iTunes, the App Store, Apple Music, and Apple Pay. And the same passion for innovation that goes into our products also applies to our practices — strengthening our commitment to leave the world better than we found it.", "mission": "Not provided on Glassdoor"}, "Deutsche-Bank": {"company_name": "Deutsche-Bank", "company_code": 3150, "website": "careers.db.com/", "headquarters": "Frankfurt am Main, Germany", "size": "10000+ Employees", "founded": "1870", "type": "Company - Public (DB)", "industry": "Banking & Lending", "revenue": "$10+ billion (USD)", "employer_description": "We are Germany’s leading bank with strong positions in Europe and significant presence in the Americas and Asia Pacific.  We’re driving growth through our strong client franchise, investing heavily in digital technologies, prioritising long-term success over short-term gains, and serving society with ambition and integrity. We serve our clients’ real economic needs in commercial and investment banking, retail banking and transaction banking, and provide ground-breaking products and services in asset and wealth management. That means a career packed with opportunities to grow and the chance to shape the future of our clients.", "mission": "We are Germany’s leading bank with international reach.  With a strong position in Europe and a significant presence in Asia and the Americas, we merge local knowledge with global vision. To put it simply, we see things differently – and we’re proud of our fresh perspective. ... Read more"}, "Mosaic": {"company_name": "Mosaic", "company_code": 23281, "website": "www.mosaicinfo.org", "headquarters": "Omaha, United States", "size": "1001 to 5000 Employees", "founded": "2003", "type": "Non-profit Organisation", "industry": "Civic, Welfare & Social Services", "revenue": "$100 to $500 million (USD)", "employer_description": "Mosaic is a whole-person healthcare organization reaching across 13 states and providing supports to nearly 4,900 people.  Services empower people with disabilities, mental and behavioral health needs and autism, as well as aging adults to live their best life. Mosaic is an affiliated social ministry organization of the Evangelical Lutheran Church in America and a member of Lutheran Services in America. Mosaic is a nonprofit 501(c)(3) organization.", "mission": "Embracing God’s call, Mosaic relentlessly pursues opportunities that empower people."}, "garena": {"company_name": "garena", "company_code": 532331, "website": "www.garena.sg", "headquarters": "Singapore, Singapore", "size": "5001 to 10000 Employees", "founded": "2009", "type": "Company - Private", "industry": "Internet & Web Services", "revenue": "$2 to $5 billion (USD)", "employer_description": "Garena is a leading global online games developer and publisher. Free Fire, its self-developed mobile battle royale title, was the most downloaded mobile game in the world in 2019 and 2020, according to App Annie. Garena is run by passionate gamers and has a unique understanding of what gamers want. It exclusively licenses and publishes hit titles from global partners – such as Arena of Valor, Call of Duty: Mobile, and League of Legends – in selected markets globally. Garena champions social and entertainment experiences through games, enabling its communities to engage and interact. Garena is also a leading esports organiser and hosts some of the world’s biggest esports events.Garena is a part of Sea Limited (NYSE:SE), a leading global consumer internet company. In addition to Garena, Sea’s other core businesses include its e-commerce arm, Shopee, and digital financial services arm, SeaMoney. Sea’s mission is to better the lives of consumers and small businesses with technology.", "mission": "Not provided on Glassdoor"}, "Bank-of-America": {"company_name": "Bank-of-America", "company_code": 8874, "website": "www.bankofamerica.com", "headquarters": "Charlotte, United States", "size": "10000+ Employees", "founded": "1904", "type": "Company - Public (BAC)", "industry": "Banking & Lending", "revenue": "$10+ billion (USD)", "employer_description": "Bank of America is one of the world's largest financial institutions, serving individuals, small- and middle-market businesses and large corporations with a full range of banking, investing, asset management and other financial and risk management products and services. The company serves approximately 56 million U.S. consumer and small business relationships. It is among the world's leading wealth management companies and is a global leader in corporate and investment banking and trading.", "mission": "Not provided on Glassdoor"}, "DBS-Bank": {"company_name": "DBS-Bank", "company_code": 611812, "website": "www.dbs.com", "headquarters": "Singapore, Singapore", "size": "10000+ Employees", "founded": "1968", "type": "Company - Public (D05)", "industry": "Banking & Lending", "revenue": "$5 to $10 billion (USD)", "employer_description": "DBS is a leading financial services group in Asia with a presence in 18 markets. As a bank born and bred in Asia, DBS understands the intricacies of doing business in the region’s most dynamic markets.   𝗔𝘀𝗶𝗮'𝘀 𝗦𝗮𝗳𝗲𝘀𝘁, 𝗪𝗼𝗿𝗹𝗱'𝘀 𝗕𝗲𝘀𝘁Headquartered and listed in Singapore, DBS provides a full range of services in consumer, SME and corporate banking. The bank's \"AA-\" and \"Aa1\" credit ratings are among the highest in the world. We have been voted “World’s Best Bank” by Euromoney (2018 to 2021), “Global Bank of the Year” by The Banker (2021), “Best Bank in the World” by Global Finance (2020) and “Safest Bank in Asia” by Global Finance for 13 consecutive years from 2009 to 2021. 𝗕𝗲𝗶𝗻𝗴 𝗣𝘂𝗿𝗽𝗼𝘀𝗲-𝗗𝗿𝗶𝘃𝗲𝗻DBS is committed to not only building lasting relationships with our customers, but also positively impacting communities through supporting social enterprises. It has also established a SGD 50 million foundation to strengthen its corporate social responsibility efforts in Singapore and across Asia. 𝗢𝘂𝗿 𝗕𝗿𝗮𝗻𝗱 𝗣𝗿𝗼𝗺𝗶𝘀𝗲At DBS, we want to deliver banking that is so simple, seamless and invisible, our customers have more time to spend on the people or things they care about.  Our focus on customer-centricity drives us to continuously innovate ways to embed banking in the everyday lives of customers. This has manifested in key digitization initiatives such as launching marketplaces on our website, enabling our customers to fulfil their everyday lifestyle needs. Live more, Bank less with DBS. For more company information and career opportunities, visit www.dbs.com.", "mission": "People are at the heart of everything we do at DBS.  \n\n𝗔𝘀 𝗮 𝗕𝘂𝘀𝗶𝗻𝗲𝘀𝘀\nWe dedicate ourselves to understanding what you need, and more. Whether it’s helping you with your investments or turning your business ideas into reality, we are committed to be the bank that you ... Read more"}, "Coinbase": {"company_name": "Coinbase", "company_code": 779622, "website": "www.coinbase.com", "headquarters": "San Francisco, United States", "size": "1001 to 5000 Employees", "founded": "2012", "type": "Company - Public (COIN)", "industry": "Internet & Web Services", "revenue": "Unknown / Non-Applicable", "employer_description": "We are building the cryptoeconomy – a more fair, accessible, efficient, and transparent financial system enabled by crypto.We started in 2012 with the radical idea that anyone, anywhere, should be able to easily and securely send and receive Bitcoin. Today, we offer a trusted and easy-to-use platform for accessing the broader cryptoeconomy.Customers around the world discover and begin their journeys with crypto through Coinbase. Approximately 89 million verified users, 11,000 institutions, and 185,000 ecosystem partners in over 100 countries trust Coinbase to easily and securely invest, spend, save, earn, and use crypto.", "mission": "To increase economic freedom in the world."}, "Republic-Polytechnic": {"company_name": "Republic-Polytechnic", "company_code": 309085, "website": "www.rp.edu.sg", "headquarters": "Singapore, Singapore", "size": "1001 to 5000 Employees", "founded": "2002", "type": "College / University", "industry": "Colleges & Universities", "revenue": "$1 to $5 million (USD)", "employer_description": "Not provided on Glassdoor", "mission": "Not provided on Glassdoor"}, "Adobe": {"company_name": "Adobe", "company_code": 1090, "website": "www.adobe.com", "headquarters": "San Jose, United States", "size": "10000+ Employees", "founded": "1982", "type": "Company - Public (ADBE)", "industry": "Computer Hardware Development", "revenue": "$5 to $10 billion (USD)", "employer_description": "Adobe is the global leader in digital media and digital marketing solutions. Our creative, marketing and document solutions empower everyone – from emerging artists to global brands – to bring digital creations to life and deliver immersive, compelling experiences to the right person at the right moment for the best results. In short, Adobe is everywhere, and we’re changing the world through digital experiences.", "mission": "Adobe is changing the world through digital experiences."}, "Eni-Spa": {"company_name": "Eni-Spa", "company_code": 3164, "website": "www.eni.com", "headquarters": "Rome, Italy", "size": "10000+ Employees", "founded": "1952", "type": "Company - Public (E)", "industry": "Energy & Utilities", "revenue": "$10+ billion (USD)", "employer_description": "eni is an integrated energy company employing more than 84,000 people in 83 Countries in the world. It is engaged in oil and natural gas exploration, field development and production, as well as in the supply, trading and shipping of natural gas, LNG, electricity, fuels and chemical products.\rThrough refineries and chemical plants, eni processes crude oil and other oil-based feedstock to produce fuels, lubricants and chemical products that are supplied to wholesalers or through retail networks or distributors. \reni operates in engineering, oilfield services and construction both offshore and onshore, focusing on the execution of technologically-advanced mega-projects, mainly located in frontier areas. \rCooperation, integration, innovation, inclusion of people, operational excellence and responsibility drive eni’s work in the continuous interaction with all the stakeholders.\rIn 2014 eni confirmed its presence in the Dow Jones Sustainability indices and in the FTSE4Good index.", "mission": "Not provided on Glassdoor"}, "Vulcan-Materials": {"company_name": "Vulcan-Materials", "company_code": 709, "website": "www.vulcanmaterials.com", "headquarters": "Birmingham, United States", "size": "5001 to 10000 Employees", "founded": "1957", "type": "Company - Public (VMC)", "industry": "Mining & Metals", "revenue": "$2 to $5 billion (USD)", "employer_description": "Vulcan Materials Company is the nation’s largest producer of construction aggregates, primarily crushed stone, sand and gravel, and a major producer of other construction materials including asphalt and ready-mixed concrete.  Based in Birmingham, Alabama, Vulcan operates aggregate facilities, serving markets in 20 states, the District of Columbia, Mexico and the Bahamas, and employing over 8,000 dedicated men and women.\rWhat we produce is used in nearly all forms of construction. In particular, large quantities of aggregates are used to build and repair valuable infrastructure such as roads, bridges, waterworks and ports, and to construct buildings both residential and nonresidential, such as manufacturing facilities, office buildings, schools, hospitals and churches.", "mission": "Vulcan Materials Company is an international producer of construction materials essential to the standard of living of advanced and developing societies.\r\n\r\nOur Mission is to provide quality products and services which consistently meet our customers’ expectations; to be ... Read more"}, "thales": {"company_name": "thales", "company_code": 10358, "website": "www.thalesgroup.com", "headquarters": "Paris, France", "size": "10000+ Employees", "founded": "2000", "type": "Company - Public (HO)", "industry": "Aerospace & Defence", "revenue": "$10+ billion (USD)", "employer_description": "In all critical environments - air, land, sea, space and cyberspace - decision-makers, operators, crews and members of our armed services and security forces are faced with millions of important decisions every day.  It is in supporting these people that Thales in the United States has a role to play.\r We bring more than 100 years of experience applying technology solutions to U.S. customers. These solutions better equip decision-makers to assess and respond more effectively to the operational challenges they face. We enable our customers to ensure the safety and security of citizens, information and infrastructure and also civil and commercial operations of global enterprises.\r Our employees and partners are passionate about customer success. Together we achieve a safer and more connected world by enabling innovation and technological achievement for advanced applications and capabilities.", "mission": "Thales is a global tech enterprise, where brilliant people from all over the world come together to share ideas and inspire each other. In aerospace, transportation, defense, security and space, our people test the limits of engineering, delivering solutions that push the ... Read more"}, "Ngee-Ann-Polytechnic": {"company_name": "Ngee-Ann-Polytechnic", "company_code": 300471, "website": "www.np.edu.sg", "headquarters": "Singapore, Singapore", "size": "1001 to 5000 Employees", "founded": "1963", "type": "College / University", "industry": "Education Support & Training Services", "revenue": "$25 to $50 million (USD)", "employer_description": "Not provided on Glassdoor", "mission": "Not provided on Glassdoor"}, "Microsoft": {"company_name": "Microsoft", "company_code": 1651, "website": "www.microsoft.com/en-gb/", "headquarters": "Redmond, United States", "size": "10000+ Employees", "founded": "1975", "type": "Company - Public (MSFT)", "industry": "Computer Hardware Development", "revenue": "$10+ billion (USD)", "employer_description": "Our drive to change the world unites us!\rMicrosoft is the ideal place for people who have passion for their work and the desire to make an impact—in their careers, in the community and on the world. Microsoft is a unique company; and not just within the tech industry. Here, smart people thrive on their own terms and push their intelligence to its limit. The variety of job opportunities and career advancement at Microsoft is incredible and empowers you to constantly challenge yourself and chart your own course.", "mission": "Come to Microsoft to empower every person and every organization on the planet to achieve more."}, "EOG": {"company_name": "EOG", "company_code": 1467, "website": "www.eogresources.com", "headquarters": "Houston, United States", "size": "1001 to 5000 Employees", "founded": "Not provided on Glassdoor", "type": "Company - Public (EOG)", "industry": "Energy & Utilities", "revenue": "$5 to $10 billion (USD)", "employer_description": "EOG Resources hogs a resource -- natural gas. The independent oil and gas company is engaged in exploring for natural gas (and crude oil) and developing, producing, and marketing those resources. In 2010 EOG, an independent offspring of the once powerful Enron, reported estimated proved reserves of 1.9 billion barrels of oil equivalent, including 8.5 trillion cu. ft. of natural gas reserves and 386 million barrels of crude oil, condensate, and natural gas liquid (NGL) reserves. The company operates in major production basins in Canada, offshore Trinidad, the US, the UK sector of the North Sea, and in China (Sichuan basin).", "mission": "Not provided on Glassdoor"}, "Tesla": {"company_name": "Tesla", "company_code": 43129, "website": "www.tesla.com", "headquarters": "Austin, United States", "size": "10000+ Employees", "founded": "2003", "type": "Company - Public (TSLA)", "industry": "Transportation Equipment Manufacturing", "revenue": "$2 to $5 billion (USD)", "employer_description": "Our mission is to accelerate the world’s transition to sustainable energy. With global temperatures rising, the faster we free ourselves from fossil fuel reliance and achieve a zero-emission future, the better.  In pursuit of this mission, we strive to make electric vehicles that are not just great EVs, but the best cars, period. We also produce and install infinitely scalable clean energy generation and storage products that help our customers further decrease their environmental impact. When it comes to achieving our goals, we pride ourselves in accomplishing what others deem impossible. We are opening new factories and increasing our output everyday – join us in building a sustainable future. tesla.com/careers", "mission": "Not provided on Glassdoor"}, "Transocean": {"company_name": "Transocean", "company_code": 33, "website": "www.deepwater.com", "headquarters": "Zug, Switzerland", "size": "5001 to 10000 Employees", "founded": "1953", "type": "Company - Public (RIG)", "industry": "Energy & Utilities", "revenue": "$2 to $5 billion (USD)", "employer_description": "Transocean specializes in deepwater drilling and it isn't afraid of harsh environments. It operates in the world's major offshore oil-producing regions, including Africa, Asia, Brazil, Canada, India, the Middle East, the Gulf of Mexico, and the North Sea. The company has a fleet of 138 mobile offshore drilling units (72 semisubmersibles and drillships, 63 jackup rigs, and three other rigs). Transocean's other operations include management of third-party drilling services. Major customers include BP and Chevron. Although Transocean has a major presence in the Houston oil patch, the company is domiciled in Switzerland for tax purposes.", "mission": "Not provided on Glassdoor"}, "CoinHako": {"company_name": "CoinHako", "company_code": 1936815, "website": "www.coinhako.com", "headquarters": "Singapore, Singapore", "size": "1 to 50 Employees", "founded": "2013", "type": "Company - Private", "industry": "Internet & Web Services", "revenue": "Unknown / Non-Applicable", "employer_description": "Not provided on Glassdoor", "mission": "Not provided on Glassdoor"}, "Husky-Energy": {"company_name": "Husky-Energy", "company_code": 7825, "website": "www.huskyenergy.ca", "headquarters": "Calgary, Canada", "size": "1001 to 5000 Employees", "founded": "1938", "type": "Company - Public (HSE)", "industry": "Energy & Utilities", "revenue": "$10+ billion (USD)", "employer_description": "Husky operates in Western and Atlantic Canada, the United States and the Asia Pacific region, with Upstream and Downstream business segments. Husky has two core businesses. Its Integrated Corridor operates in Western Canada and the United States, where thermal production is integrated with the Downstream business and supported by Western Canada operations. Offshore the Company is focused in the Asia Pacific and Atlantic regions.The Company’s business strategy is to focus on returns from investment in a deep portfolio of opportunities that can generate increased funds from operations and free cash flow.Husky’s focus on safety helps to protect the public, its employees and contractors, the environment and its assets while providing for efficient and productive operations.Along with rigorous occupational safety programs, Husky is driving continuous improvement in process safety.", "mission": "Not provided on Glassdoor"}, "ConocoPhillips": {"company_name": "ConocoPhillips", "company_code": 14933, "website": "www.conocophillips.com/", "headquarters": "Houston, United States", "size": "501 to 1000 Employees", "founded": "2002", "type": "Company - Public (COP)", "industry": "Energy & Utilities", "revenue": "$1 to $5 million (USD)", "employer_description": "We are the world’s largest independent exploration and production company, based on proved reserves and production of liquids and natural gas. We explore for, develop, and produce crude oil and natural gas globally. A commitment to safety, operating excellence and environmental stewardship guide our operations in 30 countries.\rEmployees across the globe focus on fulfilling our core SPIRIT Values of safety, people, integrity, responsibility, innovation and teamwork. And we apply the characteristics that define leadership excellence in how we engage each other, collaborate with our teams, and drive the business. \rVisit our LinkedIn Company page: http://www.linkedin.com/company/conocophillips  \rWe are committed to hiring veterans, visit our Military page to learn more: http://careers.conocophillips.com/en/us-military", "mission": "Not provided on Glassdoor"}, "Union-Pacific": {"company_name": "Union-Pacific", "company_code": 691, "website": "www.up.com/index.htm", "headquarters": "Omaha, United States", "size": "Unknown", "founded": "1862", "type": "Company - Public (UNP)", "industry": "Rail Transportation", "revenue": "$10+ billion (USD)", "employer_description": "One of America's most recognized companies, Union Pacific Railroad connects 23 states in the western two-thirds of the country by rail, providing a critical link in the global supply chain. The railroad's diversified business mix includes Agricultural Products, Automotive, Chemicals, Coal, Industrial Products and Intermodal. Union Pacific serves many of the fastest-growing U.S. population centers, operates from all major West Coast and Gulf Coast ports to eastern gateways, connects with Canada's rail systems and is the only railroad serving all six major Mexico gateways. Union Pacific provides value to its roughly 10,000 customers by delivering products in a safe, reliable, fuel-efficient and environmentally responsible manner.", "mission": "The men and women of Union Pacific are dedicated to serve. Union Pacific works for the good of our customers, shareholders, communities and one another. Our commitment defines us and drives the economic strength of our company and our country."}, "ExxonMobil": {"company_name": "ExxonMobil", "company_code": 237, "website": "corporate.exxonmobil.com", "headquarters": "Irving, United States", "size": "10000+ Employees", "founded": "1870", "type": "Company - Public (XOM)", "industry": "Energy & Utilities", "revenue": "$10+ billion (USD)", "employer_description": "ExxonMobil is the world’s largest publicly traded international oil and gas company. We hold an industry-leading inventory of global oil and gas resources. We are the world’s largest refiner and marketer of petroleum products, and our chemical company ranks among the world’s largest. We apply science and innovation to find better, safer and cleaner ways to deliver the energy the world needs.", "mission": "Exxon Mobil Corporation is committed to being the world's premier petroleum and petrochemical company. To that end, we must continuously achieve superior financial and operating results while simultaneously adhering to high ethical standards."}, "Infineon-Technologies": {"company_name": "Infineon-Technologies", "company_code": 8915, "website": "www.infineon.com", "headquarters": "Neubiberg, Germany", "size": "10000+ Employees", "founded": "1999", "type": "Company - Public (IFNNY)", "industry": "Electronics Manufacturing", "revenue": "$10+ billion (USD)", "employer_description": "Infineon Technologies focuses on the three central challenges facing modern society: Energy Efficiency, Mobility and Security and offers semiconductors and system solutions for automotive and industrial electronics and chip card and security applications.Infineon’s products stand out for their reliability, their quality excellence and their innovative and leading-edge technology in analog and mixed signal, RF and power as well as embedded control.With a global presence, Infineon operates through its subsidiaries in the USA from Milpitas, California, in the Asia-Pacific region from Singapore, and in Japan from Tokyo.", "mission": "We make life easier, safer and greener\n\nOur mission is the route we follow to achieve our vision. It explains the purpose and reason for our existence; namely, to solve the technological, economic, and social challenges the world is facing today. With our daily work, we are ... Read more"}, "Halliburton": {"company_name": "Halliburton", "company_code": 307, "website": "www.halliburton.com", "headquarters": "Houston, United States", "size": "10000+ Employees", "founded": "1919", "type": "Company - Public (HAL)", "industry": "Energy & Utilities", "revenue": "$10+ billion (USD)", "employer_description": "Founded in 1919, Halliburton is one of the world’s leading providers of products and services to the upstream energy industry.Halliburton is proud to be a services company, and our customers and investors appreciate our business model.  Our strong competitive position not only comes from our geographic footprint and wide range of products and services, but also, more importantly, from the quality of our work and the dedication of our employees.With approximately 55,000 employees, representing 140 nationalities in more than 80 countries, Halliburton touches much of the oil and gas that fuel our society.Our BusinessHalliburton comprises 14 product service lines (PSLs). The PSLs operate in two divisions: Drilling and Evaluation, and Completion and Production.Our Consulting and Project Management PSL works across both divisions and is the spearhead of our integrated-services strategy. Its financial results are included in the Drilling and Evaluation Division. PSLs are primarily responsible and accountable for strategy, technology development, process development, people development and capital allocation.Our ValuesIntegrity: Ethics and integrity are the foundation of our brand and the guiding principles for all we do.Safety: Priority number one. We are focused on our own personal safety, as well as on the safety of others.Collaboration: We work together with customers, and understand that everyone has a role in providing the best solution.Competition: We compete to win, knowing that competition makes everyone stronger.Creativity: We are resourceful. We are innovative, and strive to apply the right technology and solution every time.Reliability: We deliver what we promise. We believe the quality of our service defines who we are.Respect: We are honest with ourselves and with each other. We value our diverse skills and talents, and know we are stronger together as one family.These values are our corporate DNA, the foundation for how we relate to each other and to every individual and entity with whom we interact. These are the principles that every Halliburton employee is expected to use, live by, and demonstrate on a daily basis.Own Your CareerOur people are essential to our ability to innovate, achieve, grow, and lead. We attract and retain the best talent by investing in our employees and empowering them to develop themselves and their careers. We invest in our employees through leadership and competency development, competitive compensation plans, health benefits, work-life programs, and reward and incentive plans.Opportunities for career development – and the tools you need to take advantage of them – are abundant. Combine those opportunities with your drive and capabilities, and your career path can go in nearly any direction you choose.", "mission": "Not provided on Glassdoor"}, "Razer": {"company_name": "Razer", "company_code": 431801, "website": "www.razer.com", "headquarters": "Irvine, United States", "size": "1001 to 5000 Employees", "founded": "2005", "type": "Company - Private", "industry": "Computer Hardware Development", "revenue": "Unknown / Non-Applicable", "employer_description": "Razer™ is the world’s leading lifestyle brand for gamers. The triple-headed snake trademark of Razer is one of the most recognized logos in the global gaming and esports communities. With a fan base that spans every continent, the company has designed and built the world’s largest gamer-focused ecosystem of hardware, software and services. Razer’s award-winning hardware includes high-performance gaming peripherals, Blade gaming laptops and the acclaimed Razer Phone. Razer’s software platform, with over 50 million users, includes Razer Synapse (an Internet of Things platform), Razer Chroma (a proprietary RGB lighting technology system), and Razer Cortex (a game optimizer and launcher). In services, Razer zGold is one of the world’s largest virtual credit services for gamers. Razer Pay is the e-wallet designed for youth and millennials, and Razer Game Store is the only games download store that offers rewards for gamers. Founded in 2005 and dual-headquartered in San Francisco and Singapore, Razer has 15 offices worldwide and is recognized as the leading brand for gamers in the USA, Europe and China. Razer is listed on the Hong Kong Stock Exchange (Stock Code: 1337)", "mission": "We live by our motto that has brought us to where we are today: For Gamers. By Gamers."}, "J-P-Morgan": {"company_name": "J-P-Morgan", "company_code": 145, "website": "www.jpmorgan.com", "headquarters": "New York, United States", "size": "10000+ Employees", "founded": "1799", "type": "Company - Public (JPM)", "industry": "Investment & Asset Management", "revenue": "$10+ billion (USD)", "employer_description": "J.P. Morgan helps businesses, markets and communities grow and develop in more than 100 countries. Through our Corporate and Investment Bank, we provide banking, markets and investor services, treasury services and more for the world's most important corporations, governments and institutions. Our Asset and Wealth Management business provides global market insights and a range of investment capabilities for individuals and families, advisors and institutions.We are a diverse team of innovators with a commitment to building the best and most respected financial services company, giving back to our local communities and building a healthy, vibrant company that creates opportunities for all employees. We have an exceptional team of employees who work hard to do the right thing for our clients and the firm every day. This is why we are the most respected financial institution in the world — and why we can offer you an outstanding career.©2021 JPMorgan Chase & Co. All rights reserved. JPMorgan Chase is an equal opportunity and affirmative action employer Disability/Veteran.", "mission": "Not provided on Glassdoor"}, "Cloudflare": {"company_name": "Cloudflare", "company_code": 430862, "website": "www.cloudflare.com", "headquarters": "San Francisco, United States", "size": "1001 to 5000 Employees", "founded": "2010", "type": "Company - Public (NET)", "industry": "Internet & Web Services", "revenue": "Unknown / Non-Applicable", "employer_description": "Cloudflare is a leading performance and security company helping to build a better Internet. Today the company runs one of the world’s largest networks that powers trillions of requests per month.", "mission": "Cloudflare is on a mission to help build a better Internet. Today the company runs one of the world’s largest networks, with nearly 10 percent of the Fortune 1,000 as paying customers and approximately 19 percent of the top 10,000 websites using at least one Cloudflare product on a paid or free basis. Cloudflare’s platform protects and accelerates any Internet application online without adding hardware, installing software, or changing a line of code."}, "Ovintiv": {"company_name": "Ovintiv", "company_code": 3282291, "website": "www.ovintiv.com", "headquarters": "Denver, United States", "size": "1001 to 5000 Employees", "founded": "2002", "type": "Company - Public (OVV)", "industry": "Energy & Utilities", "revenue": "$5 to $10 billion (USD)", "employer_description": "Not provided on Glassdoor", "mission": "Not provided on Glassdoor"}, "NOV": {"company_name": "NOV", "company_code": 3306, "website": "www.nov.com", "headquarters": "Houston, United States", "size": "10000+ Employees", "founded": "1841", "type": "Company - Public (NOV)", "industry": "Energy & Utilities", "revenue": "$10+ billion (USD)", "employer_description": "NOV (NYSE: NOV)  For more than 150 years, NOV has pioneered innovations that empower the global energy industry, enabling our customers to safely produce abundant energy while minimizing their environmental impact. The energy industry depends on our deep expertise and technology to continually improve oilfield operations and assist in efforts to advance the energy transition towards a more sustainable future. Every day, more than 30,000 of the industry’s best minds put more than 150 years of experience to work to help our customers achieve lasting success. Our partnership with our customers has led to the innovation of some of the highest quality products on the market. Through our broad capabilities and vision, NOV’s family of companies is positioned and ready to serve the needs of this challenging, evolving industry. NOV has the technical expertise, advanced equipment and readily available support necessary for our customers’ success.", "mission": "We power the industry that powers the world.   NOV has a long and proud legacy of innovation and technology dating back to the earliest days of the oilfield. Building on that history, we continue to provide technology-driven solutions that empower the global energy industry. As ... Read more"}, "Lockheed-Martin": {"company_name": "Lockheed-Martin", "company_code": 404, "website": "www.lockheedmartin.com", "headquarters": "Bethesda, United States", "size": "10000+ Employees", "founded": "1995", "type": "Company - Public (LMT)", "industry": "Aerospace & Defence", "revenue": "$10+ billion (USD)", "employer_description": "At Lockheed Martin, we don’t just think big thoughts. We get things done.\rAnd we're bringing together the best minds in the industry to do it.\rFrom our Advanced Development Programs, also known as the Skunk Works® to advances in renewable energy, we're always adapting, always innovating, and always figuring out ways to meet the needs of the real challenges our customers face. \rIf you're ready to solve problems that don't have quick answers,  check us out.", "mission": "We solve complex challenges, advance scientific discovery and deliver innovative solutions to help our customers keep people safe."}, "Tencent": {"company_name": "Tencent", "company_code": 38281, "website": "www.tencent.com/en-us/", "headquarters": "Shenzhen, China", "size": "10000+ Employees", "founded": "1998", "type": "Company - Public (TCTZF)", "industry": "Internet & Web Services", "revenue": "Unknown / Non-Applicable", "employer_description": "Tencent is a world-leading internet and technology company that develops innovative products and services to improve the quality of life of people around the world. Founded in 1998 with its headquarters in Shenzhen, China, our guiding principle is to use technology for good.We are not only a major video game publisher, we also produce other high-quality digital content, enriching interactive entertainment experiences for people around the globe.We offer a range of services such as cloud computing, advertising and FinTech to support our clients' digital transformation and business growth. We have also been listed on the Stock Exchange of Hong Kong since 2004.", "mission": "Value for Users, Tech for Good."}, "RedHat": {"company_name": "RedHat", "company_code": 8868, "website": "www.redhat.com/jobs", "headquarters": "Raleigh, United States", "size": "10000+ Employees", "founded": "1993", "type": "Company - Public (RHT)", "industry": "Enterprise Software & Network Solutions", "revenue": "$2 to $5 billion (USD)", "employer_description": "At Red Hat, we connect an innovative community of customers, partners, and contributors to deliver an open source stack of trusted, high-performing solutions. We offer cloud, Linux, middleware, storage, and virtualization technologies, together with award-winning global customer support, consulting, and implementation services. Red Hat is a rapidly growing company supporting more than 90% of Fortune 500 companies.", "mission": "To be the catalyst in communities of customers, contributors, and partners creating better technology the open source way."}, "SLB": {"company_name": "SLB", "company_code": 588, "website": "www.slb.com", "headquarters": "Houston, United States", "size": "10000+ Employees", "founded": "1926", "type": "Company - Public (SLB)", "industry": "Energy & Utilities", "revenue": "$10+ billion (USD)", "employer_description": "No sleeper, Schlumberger (pronounced SHLUM-ber-ZHAY) is one of the world's largest oilfield services companies, along with Halliburton. It provides a full range of services, including seismic surveys, formation evaluation, drilling technologies and equipment, cementing, well construction and completion, and project management. Schlumberger also provides reservoir evaluation, development, and management services, and is developing new technologies for reservoir optimization. Through its WesternGeco business, the company provides seismic and other surveying services to customers worldwide. In 2010 Schlumberger acquired drilling services giant Smith International in deal valued at $11 billion.", "mission": "Not provided on Glassdoor"}, "Nanyang-Technological-University": {"company_name": "Nanyang-Technological-University", "company_code": 158708, "website": "www.ntu.edu.sg", "headquarters": "Singapore, Singapore", "size": "5001 to 10000 Employees", "founded": "1991", "type": "College / University", "industry": "Colleges & Universities", "revenue": "$100 to $500 million (USD)", "employer_description": "Young and research intensive, Nanyang Technological University, Singapore (NTU Singapore) has 33,000 undergraduate and postgraduate students in engineering, business, science, humanities, arts, social sciences, education and medicine.", "mission": "A great global university founded on science and technology, nurturing leaders and creating societal impact through interdisciplinary education and research."}, "Meta": {"company_name": "Meta", "company_code": 40772, "website": "www.metacareers.com", "headquarters": "Menlo Park, United States", "size": "10000+ Employees", "founded": "2004", "type": "Company - Public (META)", "industry": "Internet & Web Services", "revenue": "$10+ billion (USD)", "employer_description": "The Facebook company is now Meta. Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology.", "mission": "Not provided on Glassdoor"}, "International-Paper": {"company_name": "International-Paper", "company_code": 356, "website": "internationalpaper.com", "headquarters": "Memphis, United States", "size": "10000+ Employees", "founded": "1898", "type": "Company - Public (IP)", "industry": "Machinery Manufacturing", "revenue": "Unknown / Non-Applicable", "employer_description": "International Paper (NYSE: IP) is a leading global supplier of renewable fiber-based products. We produce corrugated packaging products that protect and promote goods, and enable worldwide commerce, and pulp for diapers, tissue and other personal care products that promote health and wellness.Headquartered in Memphis, Tenn., we employ approximately 38,000 colleagues globally. We serve customers worldwide, with manufacturing operations in North America, Latin America, North Africa and Europe. Net sales for 2022 were $21.2 billion.", "mission": "To improve people’s lives, the planet and our company’s performance by transforming renewable resources into products people depend on every day\rWe do the right things, in the right ways, for the right reasons, all of the time—this is The IP Way."}, "Air-Liquide": {"company_name": "Air-Liquide", "company_code": 10332, "website": "www.airliquide.com/", "headquarters": "Paris, France", "size": "10000+ Employees", "founded": "1902", "type": "Company - Public (AIQUY, AI.PA)", "industry": "Chemical Manufacturing", "revenue": "Unknown / Non-Applicable", "employer_description": "Air Liquide is a world leader in gases, technologies and services for Industry and Health. Oxygen, nitrogen and hydrogen are essential small molecules for life, matter and energy. They embody Air Liquide’s scientific territory and have been at the core of the company’s activities since its creation in 1902.Our 66,400 employees serve more than 3.8 million customers and patients.Inventors of the future:Our ambition is to be a leader in our industry, to deliver long term performance and to contribute to a more sustainable world.Through our positions in key markets of the future, we are at the heart of today's and tomorrow's challenges: energy and environmental transition, transformation of healthcare and technological progress. Our business expertise, our capacity for innovation, our proximity to our customers and patients, and the commitment and professionalism of our employees enable us to provide concrete solutions for the benefit of all our stakeholders and, beyond, of society.Our strategy:ADVANCE, Air Liquide’s new strategic plan for 2025, is a milestone in the company’s history. It places sustainable development at the heart of the Group’s strategy, firmly setting Air Liquide on course for a comprehensive performance by combining financial performance and extra-financial performance.The way we work:At Air Liquide, we listen to our employees’ expectations. We create an engaging environment, diverse and inclusive, that allows employees to grow and to thrive", "mission": "Not provided on Glassdoor"}, "Raytheon-Technologies": {"company_name": "Raytheon-Technologies", "company_code": 561, "website": "www.rtx.com", "headquarters": "Waltham, United States", "size": "10000+ Employees", "founded": "2020", "type": "Company - Public (RTX)", "industry": "Aerospace & Defence", "revenue": "$10+ billion (USD)", "employer_description": "Raytheon Technologies Corporation is an aerospace and defense company that provides advanced systems and services for commercial, military and government customers worldwide. It comprises four industry-leading businesses – Collins Aerospace Systems, Pratt & Whitney, Raytheon Intelligence & Space and Raytheon Missiles & Defense. Its 195,000 employees enable the company to operate at the edge of known science as they imagine and deliver solutions that push the boundaries in quantum physics, electric propulsion, directed energy, hypersonics, avionics and cybersecurity. The company, formed in 2020 through the combination of Raytheon Company and the United Technologies Corporation aerospace businesses, is headquartered in Waltham, Massachusetts.", "mission": "Not provided on Glassdoor"}, "Citi": {"company_name": "Citi", "company_code": 8843, "website": "www.citigroup.com", "headquarters": "New York, United States", "size": "10000+ Employees", "founded": "1812", "type": "Company - Public (C)", "industry": "Investment & Asset Management", "revenue": "$10+ billion (USD)", "employer_description": "Citi is more than a global financial services company. It’s an engine for progress. Join us, and you’ll have the chance to get involved in progress in all its shapes and forms, right across the world. From the micro to the macro, from Australia to Zambia, the work we do has real positive impact. Wherever you are and whatever you do, progress starts here. We’ve built a world famous, trusted brand over 200 years of continuously evolving financial services. And today, our influence continues to grow: with financial operations in 160 countries and 100 currencies. We have 200 million different clients, including some of the biggest names in the industries, sectors, businesses and governments that we serve every day. It all adds up to an exciting place to be for talented, ambitious people who want to build a truly remarkable career.Build your careers with Citi and be surrounded by brilliant minds - experts in their fields and you'll be able to draw on a huge variety and history of industry knowledge. Our business thrives even in the most challenging times, and our colleagues enjoy all the benefits that come with a truly global presence and deep client commitment. We offer a huge range of opportunities, for all experience levels. To find out more about the roles available in your region and apply, please visit www.jobs.citi.com", "mission": "Citi's mission is to serve as a trusted partner to our clients by responsibly providing financial services that enable growth and economic progress. Our core activities are safeguarding assets, lending money, making payments and accessing the capital markets on behalf of our ... Read more"}, "Rio-Tinto": {"company_name": "Rio-Tinto", "company_code": 6685, "website": "www.riotinto.com", "headquarters": "London, United Kingdom", "size": "10000+ Employees", "founded": "1873", "type": "Company - Public (RIO)", "industry": "Mining & Metals", "revenue": "$10+ billion (USD)", "employer_description": "As pioneers in mining and metals, we produce materials essential to human progress.\rOur long history is filled with firsts. We’ve developed some of the world’s largest and best quality mines and operations, and our people work in around 35 countries across six continents. Aluminium and copper, diamonds, gold and industrial minerals, iron ore, coal and uranium: our materials make up the world around us. You’ll find then in smartphones, planes, cars, hospitals and throughout your home.", "mission": "Not provided on Glassdoor"}, "OpenAI": {"company_name": "OpenAI", "company_code": 2210885, "website": "www.openai.com", "headquarters": "San Francisco, United States", "size": "51 to 200 Employees", "founded": "Not provided on Glassdoor", "type": "Non-profit Organisation", "industry": "Not provided on Glassdoor", "revenue": "Unknown / Non-Applicable", "employer_description": "Not provided on Glassdoor", "mission": "Not provided on Glassdoor"}, "Amazon": {"company_name": "Amazon", "company_code": 6036, "website": "www.amazon.jobs", "headquarters": "Seattle, United States", "size": "10000+ Employees", "founded": "1994", "type": "Company - Public (AMZN)", "industry": "Internet & Web Services", "revenue": "$10+ billion (USD)", "employer_description": "All Amazon teams and businesses, from Prime delivery to AWS, are guided by four key tenets: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking.  We are driven by the excitement of building technologies, inventing products, and providing services that transform the way our customers live their lives and run their businesses.", "mission": "Not provided on Glassdoor"}, "NCS": {"company_name": "NCS", "company_code": 138872, "website": "www.ncs.co", "headquarters": "Singapore, Singapore", "size": "10000+ Employees", "founded": "1981", "type": "Company - Private", "industry": "Information Technology Support Services", "revenue": "$2 to $5 billion (USD)", "employer_description": "NCS is a leading technology services firm with presence in Asia Pacific and partners with governments and enterprises to advance communities through technology. Combining the experience and expertise of its 10,000-strong team across 77 specialisations, NCS provides differentiated and end-to-end technology services to clients with its NEXT capabilities in digital, cloud and platform as well as core offerings in application, infrastructure, engineering and cyber security. NCS also believes in building a strong partner eco-system with leading technology players, research institutions and start-ups to support open innovation and co-creation. For more information, visit ncs.co.", "mission": "We advance our communities by partnering with governments and enterprises to harness technology.We do this by bringing people together to make the extraordinary happen."}, "Shopify": {"company_name": "Shopify", "company_code": 675933, "website": "www.shopify.com/careers", "headquarters": "Ottawa, Canada", "size": "5001 to 10000 Employees", "founded": "2006", "type": "Company - Public (SHOP)", "industry": "Internet & Web Services", "revenue": "$2 to $5 billion (USD)", "employer_description": "At Shopify, we build products that help entrepreneurs around the world to start and grow their businesses. We’re the world’s fastest growing commerce platform and we have no plans of slowing down!We're growing quickly and, like a rocket ship, we show no signs of slowing down. We want to define the future of entrepreneurship, be a 100 year company, and the global engine that powers commerce.We care about the people we work with. We demonstrate that care with benefits to help you and your family stay healthy and self-directed development budgets to support learning and growth.Talented people choose to work with us because we provide everything they need to feel challenged, hone their craft, and learn from one another. Surround yourself with a world-class team and level up quickly.We’ve grown to 10,000 plus employees, who are building the tools to help merchants generate over 200 billion in sales across 175 countries (including Singapore)", "mission": "Our mission at Shopify is to make commerce better for everyone. From building a new product feature for our commerce platform, to helping a merchant troubleshoot an issue over the phone, we want to empower our merchants through our work."}, "UPS": {"company_name": "UPS", "company_code": 3012, "website": "www.jobs-ups.com", "headquarters": "Atlanta, United States", "size": "10000+ Employees", "founded": "1907", "type": "Company - Public (UPS)", "industry": "Taxi & Car Services", "revenue": "$10+ billion (USD)", "employer_description": "At UPS, we love logistics.\rBut what's it really all about?\rEvery day, we choreograph the infinite movements of goods, funds, and information in more than 200 countries and territories.\rFrom our early roots as a Seattle, Washington bike-messenger company to our present day, multi-billion-dollar global corporation, our team has held a singular focus – empowering commerce around the world. We have become the world's largest package delivery company and a leading global provider of specialized transportation and logistics services.\rFrom global giants to local mom and pop businesses, we improve distribution networks and manage supply chains to help our customers to do what they do best. That’s how we make the world work better. And that’s how we build better careers and reward people like you for doing what they love to do most. Join us!", "mission": "Empowering careers & commerce around the globe takes more than the concerted efforts of innovative thinkers, collaborative teammates & incredible technology. It calls on the values, purpose & mission that have driven us right from the start. We build on our legacy as a caring & ... Read more"}, "Cenovus": {"company_name": "Cenovus", "company_code": 354451, "website": "www.cenovus.com", "headquarters": "Calgary, Canada", "size": "5001 to 10000 Employees", "founded": "2009", "type": "Company - Public (CVE)", "industry": "Energy & Utilities", "revenue": "$10+ billion (USD)", "employer_description": "We’re a Canadian integrated oil and natural gas company headquartered in Calgary. We’re committed to maximizing value by responsibly developing our assets in a safe, innovative and efficient way. Our operations include oil sands projects in northern Alberta, which use specialized methods to drill and pump the oil to the surface, and established natural gas and oil production in Alberta and British Columbia. We also have 50 percent ownership in two U.S. refineries. Our shares trade under the symbol CVE, and are listed on the Toronto and New York stock exchanges.", "mission": "Not provided on Glassdoor"}, "Ball-Corporation": {"company_name": "Ball-Corporation", "company_code": 74, "website": "www.ball.com", "headquarters": "Westminster, United States", "size": "10000+ Employees", "founded": "1880", "type": "Company - Public (BLL)", "industry": "Consumer Product Manufacturing", "revenue": "$10+ billion (USD)", "employer_description": "The well-rounded Ball Corporation pitches packaging to companies producing food, beverage, and household goods. Food and beverage packaging includes steel cans and aluminum slugs. Ball's packaging revenue derives primarily from long-term contracts with a relatively few customers, such as SABMiller and bottlers of Pepsi-Cola and Coca-Cola brands in Argentina, Brazil, China, Europe, and North America. Ball Aerospace & Technologies manufactures an array of defense systems, from remote-sensing satellites to telescopes, surveillance, and antenna and video devices, as well as provides systems engineering services. The Department of Defense, NASA, and their prime contractors, represent 90% of this segment's sales.", "mission": "Not provided on Glassdoor"}, "VMware": {"company_name": "VMware", "company_code": 12830, "website": "www.vmware.com/", "headquarters": "Palo Alto, United States", "size": "10000+ Employees", "founded": "1998", "type": "Company - Public (VMW)", "industry": "Enterprise Software & Network Solutions", "revenue": "$10+ billion (USD)", "employer_description": "At VMware, we believe that software has the power to unlock new opportunities for people and our planet. Our App Modernization, Cloud, Networking & Security, and Digital Workspace solutions power the apps, services, and experiences which enable organizations to deliver the best customer service and empower employees.Since our founding over two decades ago, our 34,000+ employee community and ecosystem of 75,000 partners have been behind the technology innovations transforming entire industries – from banking, healthcare, and government to retail, telecommunications, manufacturing, and transportation.Every day, we work to solve our customers’ toughest challenges through disruptive technologies like edge computing, artificial intelligence, blockchain, machine learning, Kubernetes, and more–to define the digital foundation that will accelerate the next wave of innovation.", "mission": "VMware streamlines the journey for organizations to become digital businesses that deliver better experiences to their customers and empower employees to do their best work."}, "Cintas": {"company_name": "Cintas", "company_code": 1256, "website": "www.cintas.com", "headquarters": "Cincinnati, United States", "size": "10000+ Employees", "founded": "1968", "type": "Company - Public (CTAS)", "industry": "Building & Personnel Services", "revenue": "$5 to $10 billion (USD)", "employer_description": "Cintas Corporation helps more than 900,000 businesses of all types and sizes get READY™ to open their doors with confidence every day by providing a wide range of products and services that enhance our customers’ image and help keep their facilities and employees clean, safe and looking their best. With products and services including uniforms, mats, mops, restroom supplies, first aid and safety products, fire extinguishers and testing, and safety and compliance training, Cintas helps customers get Ready for the Workday®.\rTo support our growth across North America, we’re seeking driven professionals with the ambition to move up within our company. Our professional culture, our dedication to our employee-partners and limitless career opportunities—these are just a few benefits we’re proud to offer. Our employee-partners know every job is critical, and that teamwork drives innovation.", "mission": "We will exceed our customers' expectations, in order to maximize our long-term value of our shareholders and working employee-partners."}, "Traveloka": {"company_name": "Traveloka", "company_code": 1032212, "website": "www.traveloka.com", "headquarters": "Jakarta, Indonesia", "size": "1001 to 5000 Employees", "founded": "2012", "type": "Company - Private", "industry": "Internet & Web Services", "revenue": "Unknown / Non-Applicable", "employer_description": "Traveloka is a leading tech startup based in Jakarta, Indonesia.  Founded in 2012 by ex-Silicon Valley engineers, the company aims to enrich lives by empowering people to discover the world around them. We build large impact consumer products and services, build real-time and big data systems and platforms, devise creative solutions to business and engineering problems, derive insights from massive amounts of data, and transform markets with technology.We started in travel. But, we have become so much more than that. We believe that lives are enriched by experiences, and discoveries promote experiences. The discovering process requires a reliable partner, who values dedication, intellectual honesty, empathy, humility, and empowers the curious to take action. Being a part of Traveloka means you embrace those values and bring more to our users, partners, and the communities we serve.", "mission": "Traveloka thrives to empower its employees to discover the best version of themselves. We provide various challenges as a medium for our employees to learn and prepare themselves to hold bigger responsibilities. We also recognize that our employees require different time to ... Read more"}, "Capital-One": {"company_name": "Capital-One", "company_code": 3736, "website": "www.capitalonecareers.com", "headquarters": "Mc Lean, United States", "size": "10000+ Employees", "founded": "1994", "type": "Company - Public (COF)", "industry": "Banking & Lending", "revenue": "$10+ billion (USD)", "employer_description": "You know who you are and you’re good at it. You never settle for “good enough.” That’s why we want you at Capital One. We’re doing some bold, transformative things here. Like changing banking for good. What’s in it for you? A career surrounded by brilliant minds. People from different backgrounds, experiences and education levels. Coming together to create a sense of belonging. Supporting you where you are and where you want to be. And the chance to create real, impactful work that matters—without giving up your life or integrity to achieve it. That’s life at Capital One.", "mission": "All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran"}, "General-Dynamics": {"company_name": "General-Dynamics", "company_code": 276, "website": "www.generaldynamics.com", "headquarters": "Reston, United States", "size": "10000+ Employees", "founded": "1952", "type": "Company - Public (GD)", "industry": "Aerospace & Defence", "revenue": "$10+ billion (USD)", "employer_description": "From Gulfstream business jets and combat vehicles to nuclear-powered submarines and communications systems, people around the world depend on our products and services for their safety and security.General Dynamics is a global aerospace and defense company, employing more than 100,000 people, with locations in 71 countries. At the heart of our company are our employees. We rely on their intimate knowledge of customer requirements and a unique blend of skill and innovation to develop and produce the best possible products and services.", "mission": "Our ethos — Transparency, Honesty, Alignment and Trust — undergirds our culture, our business model and our daily interactions. These values are a constant reminder of who we are and what we do. They drive how we operate our business, govern how we interact with each other and ... Read more"}, "Virgin-America": {"company_name": "Virgin-America", "company_code": 35336, "website": "www.virginamerica.com", "headquarters": "Burlingame, United States", "size": "1001 to 5000 Employees", "founded": "2004", "type": "Company - Public (VA)", "industry": "Airlines, Airports & Air Transportation", "revenue": "$2 to $5 billion (USD)", "employer_description": "An offspring of Sir Richard Branson's Virgin Group, Virgin America took flight just as high fuel prices and a recession rocked the airline industry. In 2007 the carrier launched service from San Francisco to Los Angeles and New York, and now serves more than a dozen destinations in the US as well as Canada and Mexico with a fleet of 25-plus Airbus A320 jets. It competes as a low-fare carrier, but distinguishes itself from rivals by providing first-class service and myriad in-flight entertainment options. In 2010 Virgin America's ownership shifted; a group of US investors picked up a 75% stake (including an affiliate of Cyrus Capital which holds more than a 55% stake). The remaining 25% is held by Virgin Group.", "mission": "Not provided on Glassdoor"}, "HubSpot": {"company_name": "HubSpot", "company_code": 227605, "website": "www.hubspot.com", "headquarters": "Singapore, Singapore", "size": "1001 to 5000 Employees", "founded": "2006", "type": "Company - Public (HUBS)", "industry": "Computer Hardware Development", "revenue": "$100 to $500 million (USD)", "employer_description": "HubSpot helps millions of organisations grow better, and we’d love to grow better with you. Our company culture builds connections, careers, and employee growth. How? By creating a workplace that values flexibility, autonomy, and transparency. If that sounds like something you’d like to be part of, we’d love to hear from you.\rYou can find out more about our company culture in the HubSpot Culture Code, which has more than 4M views, and learn about our commitment to creating a diverse and inclusive workplace, too. Thanks to the work of every HubSpotter globally who has helped build our remarkable culture, HubSpot has been named a top workplace by Glassdoor, Fortune, Entrepreneur, Great Place to Work and more.\rWe’re headquartered in Cambridge, Massachusetts, and we have offices in Dublin (Ireland), Sydney (Australia), New Hampshire, Singapore, Tokyo (Japan), Berlin (Germany), Paris (France), and Bogotá (Colombia).", "mission": "HubSpot’s mission is to help millions of organisations grow better. We build the software, tools, and resources that power our customers’ marketing, sales, and customer service efforts. We don’t only want our customers to grow their businesses by using HubSpot, we want them to ... Read more"}, "Albemarle": {"company_name": "Albemarle", "company_code": 2561, "website": "www.albemarle.com", "headquarters": "Charlotte, United States", "size": "5001 to 10000 Employees", "founded": "1994", "type": "Company - Public (ALB)", "industry": "Chemical Manufacturing", "revenue": "$2 to $5 billion (USD)", "employer_description": "Albemarle Corporation (NYSE: ALB), headquartered in Charlotte, NC, is a global specialty chemicals company with leading positions in lithium, bromine and refining catalysts. We power the potential of companies in many of the world's largest and most critical industries, from energy and communications to transportation and electronics. Working side-by-side with our customers, we develop value-added, customized solutions that make them more competitive. Our solutions combine the finest technology and ingredients with the knowledge and know-how of our highly experienced and talented team of operators, scientists and engineers.\rDiscovering and implementing new and better performance-based sustainable solutions is what motivates all of us. We think beyond business-as-usual to drive innovations that create lasting value. Albemarle employs approximately 5,400 people and serves customers in approximately 100 countries.", "mission": "Not provided on Glassdoor"}, "United-Technologies": {"company_name": "United-Technologies", "company_code": 697, "website": "www.utc.com", "headquarters": "Farmington, United States", "size": "10000+ Employees", "founded": "1975", "type": "Company - Public (UTX)", "industry": "Aerospace & Defence", "revenue": "$10+ billion (USD)", "employer_description": "UTC serves customers in the commercial aerospace, defense and building industries and ranks among the world’s most respected and innovative companies.​​​​​​​\rWe’re a company driven by ideas, innovation and\rexcellence. As a worldwide leader in the building and\raerospace industries, we constantly seek talented\rindividuals to create innovative products and solutions\rfor our customers. Our success depends on the unique\rperspectives, experience and ideas of our people.\rThat’s why some of the brightest minds in the world\rwork at UTC.\r2016: Fortune 50 Company - with operating units including:\rOtis\rUTC Climate, Controls & Security\rPratt & Whitney\rUTC Aerospace Systems", "mission": "Not provided on Glassdoor"}, "United-Airlines": {"company_name": "United-Airlines", "company_code": 683, "website": "careers.united.com/us/en/", "headquarters": "Chicago, United States", "size": "10000+ Employees", "founded": "1926", "type": "Company - Public (UAL)", "industry": "Airlines, Airports & Air Transportation", "revenue": "$10+ billion (USD)", "employer_description": "We're connecting people and uniting the world.We've paired the world's most comprehensive route network with our modern fleet, the most fuel-efficient among U.S. network carriers (when adjusted for cabin size). We have seven US hub locations, including hubs in the four largest cities in the United States and almost 90,000 employees residing in every U.S. state and in countries around the world.We also host an industry-leading loyalty program that provides more opportunities to earn and redeem miles worldwide and are leading the industry in our environmental initiatives.The time is right to join United. We're reinventing our company from the ground up, and opportunities exist for all experience levels. If you are a dedicated individual who is ready to move your career in a positive new direction, United Airlines is the place for you.", "mission": "Not provided on Glassdoor"}, "Rakuten": {"company_name": "Rakuten", "company_code": 40197, "website": "global.rakuten.com/corp", "headquarters": "Tokyo, Japan", "size": "10000+ Employees", "founded": "1997", "type": "Company - Public (4755)", "industry": "Internet & Web Services", "revenue": "$10+ billion (USD)", "employer_description": "Rakuten Group, Inc. is a global leader in internet services that empowers individuals, communities, businesses and society. The Rakuten brand is recognized worldwide for its leadership and innovation in e-commerce, financial technology, banking, entertainment, telecommunications and biotechnology. Rakuten has over 20,000 employees globally serving more than 1.4 billion members in more than 70 businesses ranging from financial services to travel planning to streaming video. Rakuten Americas is the North American division of Rakuten Group, Inc.  In the Americas, our portfolio includes market leaders in e-commerce, marketing, advertising, business intelligence, logistics, communications and entertainment. Our goal is to become the world’s most rewarding membership program. We believe that focusing on innovation and ethics creates value for consumers and businesses by aligning them together in a shared community.", "mission": "Rakuten's mission is to build a better, more optimistic future by empowering individuals, businesses and societies to realize their dreams.\n\nWe embrace new and disruptive ideas, are committed to acting on them and have the operational agility to implement and deliver at speed ... Read more"}, "United-Overseas-Bank": {"company_name": "United-Overseas-Bank", "company_code": 11462, "website": "www.uobgroup.com/careers/index.page", "headquarters": "Singapore, Singapore", "size": "10000+ Employees", "founded": "1935", "type": "Company - Public (U11.SI)", "industry": "Banking & Lending", "revenue": "$5 to $10 billion (USD)", "employer_description": "UOB: Right by you for 80 years & beyond.United Overseas Bank Limited (UOB) is a leading bank in Asia with a global network of more than 500 branches and offices in 19 countries and territories in Asia Pacific, Europe and North America. In Asia, we operate through our head office in Singapore and banking subsidiaries in China, Indonesia, Malaysia and Thailand, as well as branches and offices across the region.In 1935, amid the economic uncertainties following the Great Depression, UOB opened its doors to offer banking services for the merchant community in Singapore.Since then, UOB has grown organically and through a series of strategic acquisitions. Today, UOB is rated among the world’s top banks: ‘Aa1’ by Moody’s and ‘AA-’ by Standard & Poor’s and Fitch Ratings.Over more than eight decades, generations of UOB employees have carried through the entrepreneurial spirit, the focus on long-term value creation and an unwavering commitment to do what is right for our customers and our colleagues.At UOB, we believe in being a responsible financial services provider and we are committed to making a difference in the lives of our stakeholders and in the communities in which we operate. Just as we are dedicated to helping our customers manage their finances wisely and grow their businesses, UOB is steadfast in our support of social development, particularly in the areas of art, children and education.", "mission": "Not provided on Glassdoor"}, "Baker-Hughes": {"company_name": "Baker-Hughes", "company_code": 1902699, "website": "www.bakerhughes.com", "headquarters": "Houston, United States", "size": "10000+ Employees", "founded": "1907", "type": "Company - Public (BKR)", "industry": "Energy & Utilities", "revenue": "$10+ billion (USD)", "employer_description": "Working at Baker Hughes means being at the forefront of the energy transition. Our people are diverse, ambitious and collaborative. Together, we’re on a mission to redefine what’s possible in the energy sector by unlocking the power of engineering, data and science to take energy forward.Our team is over 67,000 strong. And we work in close partnership with local communities in over 120 countries, providing better solutions for our customers and richer opportunities for our people. As a leading partner to the energy industry, we’re not only committed to achieving zero-net carbon emissions by 2050, but also to deploying new solutions to reduce the footprint of our customers’ operations all over the world.", "mission": "Our inventions have revolutionized energy for over a century. But to keep going forward tomorrow, we know we have to push the boundaries today. So, we make it a priority to train and reward those who embrace challenge, developing leaders of all levels along the way.\n\nAs we ... Read more"}, "Qantas": {"company_name": "Qantas", "company_code": 3342, "website": "www.qantas.com.au", "headquarters": "Mascot, Australia", "size": "10000+ Employees", "founded": "1920", "type": "Company - Public (QAN)", "industry": "Airlines, Airports & Air Transportation", "revenue": "$10+ billion (USD)", "employer_description": "Qantas Airways, Australia's #1 airline, flies to about 60 destinations at home and another 100 (including some served by code-sharing partners) in about 40 countries. (Code-sharing enables carriers to sell tickets on one another's flights and thus extend their networks.) Qantas owns regional carrier QantasLink and low-fare carrier Jetstar, both of which operate in Australia and the Asia/Pacific region. Overall, the Qantas fleet includes about 230 aircraft. The company also generates revenue from cargo, catering, and tourism operations; it owns a 29% stake in Jetset Travelworld, a leading Australian travel agency. Qantas is part of the Oneworld alliance, which is led by British Airways and American Airlines.", "mission": "Not provided on Glassdoor"}, "Linde": {"company_name": "Linde", "company_code": 10436, "website": "www.linde.com", "headquarters": "Guildford, United Kingdom", "size": "10000+ Employees", "founded": "1879", "type": "Company - Public (LIN)", "industry": "Chemical Manufacturing", "revenue": "$10+ billion (USD)", "employer_description": "Linde is known as a world leader in gases, engineering and healthcare. We operate in more than 100 countries across the globe and generated pro forma sales of USD 28 billion (EUR 25 billion) in 2019. But what makes us great is our people, because they make great things happen. Guided by integrity, Linde employees take pride in what they do, because they know it makes a real difference to our customers. They are empowered to turn a challenge into an opportunity to learn and grow. This is how they take the lead, every day.For more information visit us on www.lindecareers.com", "mission": "Our mission: Making our world more productive.  \n\nVision\nWe’re working towards a single vision at Linde: to be the best performing global industrial gases and engineering company, delivering innovative and sustainable solutions for our customers and creating value for all our ... Read more"}, "BASF": {"company_name": "BASF", "company_code": 4231, "website": "www.basf.com", "headquarters": "Florham Park, United States", "size": "10000+ Employees", "founded": "1865", "type": "Company - Public", "industry": "Chemical Manufacturing", "revenue": "$10+ billion (USD)", "employer_description": "As the largest chemical company in the world with over 100,000 employees globally, we have been finding solutions for your everyday needs and addressing the most complex economic, environmental, and sustainability challenges for more than 150 years!We connect using science and innovation to enable our partners to meet the current and future needs of society in 6 business segments: •\tChemicals•\tMaterials•\tIndustrial Solutions•\tSurface Technology•\tNutrition and Care•\tAgricultural ProductsWe connect with you in the absorbents of your babies’ diapers, the coating on your car, the super comfy soles of your sneakers, etc. Now we’d like you to connect with us and be a part of the diverse team of professionals that make us who we are.", "mission": "We create chemistry for a sustainable future through the power of connected minds!"}, "Thai-Airways": {"company_name": "Thai-Airways", "company_code": 7528, "website": "www.thaiairways.com", "headquarters": "Chatuchak, Thailand", "size": "10000+ Employees", "founded": "Not provided on Glassdoor", "type": "Company - Public (THAI)", "industry": "Airlines, Airports & Air Transportation", "revenue": "$10+ billion (USD)", "employer_description": "Thai Airways (THAI) ties Thailand to the rest of the world. The carrier transports passengers and freight to some 60 destinations, including 40 Asian, Indian, and Middle Eastern regional routes and another 20 in Europe, Africa, Australia and New Zealand, and North America. It extends its network as a member of the Star Alliance marketing and code-sharing group, led by United Continental and Lufthansa. (Code-sharing enables airlines to sell tickets on one another's flights and thus offer potential passengers more options.) THAI operates a fleet of about 90 aircraft, nearly all of which are Boeing or Airbus jets. The government of Thailand holds a majority stake but is considering a future public offering.", "mission": "Not provided on Glassdoor"}, "PPG": {"company_name": "PPG", "company_code": 508, "website": "jobs.ppg.com", "headquarters": "Pittsburgh, United States", "size": "10000+ Employees", "founded": "1883", "type": "Company - Public (PPG)", "industry": "Chemical Manufacturing", "revenue": "$10+ billion (USD)", "employer_description": "With PPG, you will find meaning in your work every day, and engage in opportunities that will shape you, personally and professionally. \r•\tYour personal strengths will empower you to succeed and make an impact from day one.\r•\tYou will be inspired to learn and grow, and get the support you need to identify and achieve your boldest career aspirations. \r•\tYour passion to excel will be fueled by your connection to world-class partners, industry experts, the best and brightest colleagues, and future forward technologies.\r•\tYour contributions will not only meet the challenges of our global customers, but help them propel their industries forward.\r•\tYou will be welcomed into a culture where everyone’s ideas and contributions are valued and encouraged. \rJust like you, we are driven to make a difference in our world.", "mission": "At PPG, we work every day to develop & deliver the paints, coatings and materials that our customers have trusted for more than 130 years. Through dedication and creativity, we solve our customers’ biggest challenges, collaborating closely to find the right path forward. With ... Read more"}, "United-Rentals": {"company_name": "United-Rentals", "company_code": 7395, "website": "www.unitedrentals.com", "headquarters": "Stamford, United States", "size": "10000+ Employees", "founded": "1997", "type": "Company - Public (URI)", "industry": "Construction", "revenue": "$5 to $10 billion (USD)", "employer_description": "Great company. Great people. Great opportunities.\rAs the largest equipment rental company in the world, with a store network nearly three times the size of any other provider, and locations in 49 states, 11 in Europe and every Canadian province,  we’re committed to making United Rentals a great place to work. That means providing employees with opportunities for growth and fostering an environment based on teamwork, mutual respect, job satisfaction, diversity, and a shared responsibility to build a better future.\rUnited Rentals, Inc. is an Equal Opportunity Employer of women, minorities, protected veterans and individuals with disabilities. We offer a competitive benefits package, a strong sense of community, training and development, and recognition for a job well done. Please visit us at jobs.unitedrentals.com to learn more about the benefits of working at United Rentals.", "mission": "Deploy the best people, equipment and solutions to enable our customers to safely build a better and stronger future.\n\nOur Values:\n\nSafety First\nAct, and require others to act, in a manner that puts the safety of our employees, customers and communities first.\n\nA Passion For ... Read more"}, "Oracle": {"company_name": "Oracle", "company_code": 1737, "website": "www.oracle.com", "headquarters": "Austin, United States", "size": "10000+ Employees", "founded": "1977", "type": "Company - Public (ORCL)", "industry": "Enterprise Software & Network Solutions", "revenue": "$10+ billion (USD)", "employer_description": "Oracle is the world’s leading provider of business software. But you probably already knew that. With a presence in over 175 countries, we are one of the biggest technology companies on the planet. What you might not know is that we are leading a cloud revolution. We’re using emerging technologies like AI, machine learning, and blockchain to solve critical real-world problems. From advancing energy efficiency to reimagining online commerce, the work we do is not only transforming the world of business—it’s helping governments, powering nonprofits, and giving billions of people the tools they need to outpace change and make a difference.", "mission": "To help people see data in new ways, discover insights, unlock endless possibilities"}, "Air-Products": {"company_name": "Air-Products", "company_code": 17, "website": "www.airproducts.com", "headquarters": "Allentown, United States", "size": "10000+ Employees", "founded": "1940", "type": "Company - Public (APD)", "industry": "Chemical Manufacturing", "revenue": "$5 to $25 million (USD)", "employer_description": "Air Products (NYSE:APD) is a world-leading industrial gases company in operation for over 80 years. Focused on serving energy, environment and emerging markets, the Company provides essential industrial gases, related equipment and applications expertise to customers in dozens of industries, including refining, chemical, metals, electronics, manufacturing, and food and beverage. Air Products is also the global leader in the supply of liquefied natural gas process technology and equipment. The Company develops, engineers, builds, owns and operates some of the world's largest industrial gas projects, including: gasification projects that sustainably convert abundant natural resources into syngas for the production of high-value power, fuels and chemicals; carbon capture projects; and world-scale low- and zero-carbon hydrogen projects supporting global transportation and the energy transition.The Company had fiscal 2021 sales of $10.3 billion from operations in over 50 countries and has a current market capitalization of about $65 billion. More than 20,000 passionate, talented and committed employees from diverse backgrounds are driven by Air Products’ higher purpose to create innovative solutions that benefit the environment, enhance sustainability and address the challenges facing customers, communities, and the world. For more information, visit airproducts.com or follow us on LinkedIn, Twitter, Facebook or Instagram.", "mission": "Air Products will be the safest, most diverse, and most profitable industrial gas company in the world, providing excellent service to our customers."}, "Mastercard": {"company_name": "Mastercard", "company_code": 3677, "website": "www.mastercard.com", "headquarters": "Purchase, United States", "size": "10000+ Employees", "founded": "1966", "type": "Company - Public (MA)", "industry": "Financial Transaction Processing", "revenue": "$5 to $10 billion (USD)", "employer_description": "As a technology company in the global payments business our payments processing network, connects consumers, financial institutions, merchants, governments, and businesses in more than 210 countries and territories.", "mission": "We believe in connecting everyone to Priceless possibilities. We work to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart, and accessible."}, "SAP": {"company_name": "SAP", "company_code": 10471, "website": "jobs.sap.com", "headquarters": "Walldorf, Germany", "size": "10000+ Employees", "founded": "1972", "type": "Company - Public (SAP)", "industry": "Enterprise Software & Network Solutions", "revenue": "$10+ billion (USD)", "employer_description": "As market leader in enterprise application software, SAP helps companies of all sizes and industries run better. From back office to boardroom, warehouse to storefront, desktop to mobile device – SAP empowers people and organizations to work together more efficiently and use business insight more effectively to stay ahead of the competition. SAP helps simplify technology for companies of all sizes so they can consume our software the way they want – and without disruption. With an extensive global network of customers, partners, employees, and thought leaders around the world, SAP helps the world run better and improve people’s lives. For more information, visit https://jobs.sap.com", "mission": "At SAP,  our purpose is to help the world run better and improve people's lives."}, "Intel-Corporation": {"company_name": "Intel-Corporation", "company_code": 1519, "website": "jobs.intel.com/", "headquarters": "Santa Clara, United States", "size": "10000+ Employees", "founded": "1968", "type": "Company - Public (INTC)", "industry": "Computer Hardware Development", "revenue": "$10+ billion (USD)", "employer_description": "At Intel, building a better world is our business. Our mission is to utilize the power of Moore's Law to bring smart, connected devices to every person on earth while serving as a role model for how companies should operate.\rWe power amazing experiences through a diverse product line and exciting partnerships. Our strategy is a virtuous cycle of innovation—the cloud and the data center, the Internet of Things, memory and FPGAs all bound together by the goal of greater connectivity and enhanced performance. \rOur global team, over 107,000 strong across 58 countries, is a powerhouse of engineering and technological excellence that empowers solutions to the world's toughest problems while creating the technology of tomorrow. \rWe are Intel, and Amazing Works Here.", "mission": "Our Intel Mission: Utilize the power of Moore’s Law to bring smart, connected devices to every person on Earth"}, "Apache": {"company_name": "Apache", "company_code": 54, "website": "www.apachecorp.com", "headquarters": "Houston, United States", "size": "1001 to 5000 Employees", "founded": "1954", "type": "Company - Public (APA)", "industry": "Energy & Utilities", "revenue": "$10+ billion (USD)", "employer_description": "Since our founding in 1954, Apache has grown to become one of the world’s top independent oil and gas exploration and production companies. With operations in the United States, Egypt and the United Kingdom, Apache operates with a team unified by our values, our commitment to building shareholder value and our culture, which empowers every employee to make decisions and achieve the company’s goals. Our global team is brought together by a sense of ownership and the knowledge that best answers win. Apache is building for the future with a commitment to delivering long-term, returns-focused growth. Our continued focus on financial discipline, rigorous portfolio management and relentless performance optimization has advanced our strategy and positioned Apache for success today and in the future.", "mission": "Apache's mission is to grow in an innovative, safe, environmentally responsible and profitable manner for the long-term benefit of our stakeholders."}, "FedEx": {"company_name": "FedEx", "company_code": 246, "website": "www.fedex.com", "headquarters": "Memphis, United States", "size": "10000+ Employees", "founded": "1973", "type": "Company - Public (FDX)", "industry": "Shipping & Trucking", "revenue": "$10+ billion (USD)", "employer_description": "Holding company FedEx hopes its package of subsidiaries will keep delivering significant market share. Its FedEx Express unit is the world's #1 express transportation provider, delivering about 3.5 million packages daily to more than 220 countries and territories from about 2,000 FedEx Office shops. It maintains a fleet of about 690 aircraft and more than 50,000 motor vehicles and trailers. To complement the express delivery business, FedEx Ground provides small-package ground delivery in North America, and less-than-truckload (LTL) carrier FedEx Freight hauls larger shipments. FedEx Office stores offer a variety of document-related and other business services and serve as retail hubs for other FedEx units.", "mission": "Not provided on Glassdoor"}, "American-Airlines": {"company_name": "American-Airlines", "company_code": 8, "website": "jobs.aa.com", "headquarters": "Fort Worth, United States", "size": "10000+ Employees", "founded": "1926", "type": "Company - Public (AAL)", "industry": "Airlines, Airports & Air Transportation", "revenue": "$10+ billion (USD)", "employer_description": "Embark on an adventure with a commitment to service, excellence and humanity. Our team is what powers our airline. We are proudly dedicated to our purpose of caring for people on life’s journey, including connecting our customers to the people and places they love or providing our team members development and leadership opportunities to acquire new skills and explore their potential. With more than 1,300 aircraft in our mainline and regional fleets combined and an extensive route network that touches six continents, we’ve got a place for you to start — or continue — your career. Whether you’re stationed at one of our hundreds of airports, working out of our state-of-the-art headquarters in Fort Worth, Texas, or serving customers over the phone from your home office, there are endless opportunities for you to grow and lead at American.", "mission": "Not provided on Glassdoor"}, "nvidia": {"company_name": "nvidia", "company_code": 7633, "website": "www.nvidia.com", "headquarters": "Santa Clara, United States", "size": "10000+ Employees", "founded": "1993", "type": "Company - Public (NVDA)", "industry": "Computer Hardware Development", "revenue": "$5 to $10 billion (USD)", "employer_description": "Since its founding in 1993, NVIDIA (NASDAQ: NVDA) has been a pioneer in accelerated computing. The company’s invention of the GPU in 1999 sparked the growth of the PC gaming market, redefined computer graphics, ignited the era of modern AI and is fueling the creation of the metaverse. NVIDIA is now a full-stack computing company with data-center-scale offerings that are reshaping industry.", "mission": "Not provided on Glassdoor"}, "Aspire": {"company_name": "Aspire", "company_code": 2909271, "website": "www.aspireapp.com", "headquarters": "Singapore, Singapore", "size": "201 to 500 Employees", "founded": "2018", "type": "Company - Private", "industry": "Financial Transaction Processing", "revenue": "Unknown / Non-Applicable", "employer_description": "Aspire is the leading all-in-one finance operating system for growing businesses in South-East Asia. We are on a mission to reinvent business finance for a new generation of entrepreneurs and business owners, empowering startups to realise their full potential.Founded in 2018 by former Lazada founders and executives, Aspire has raised over USD 200M+ across equity and debt from world-class investors. To power our solutions we have partnered with some of the best companies in the world such as Visa and Wise. In 2020 we were awarded Hottest Startup by Singapore Business Review and Finalist MAS Fintech Awards, and in 2021 were named in LinkedIn’s Top 5 Startups to work for in Singapore. We currently have over 170 employees across offices in Singapore, Indonesia, Vietnam and a flexible working culture.You will be amazed by the energy and experience of our team. We are a team of ex-entrepreneurs, ex-founders, and high-achievers with international backgrounds. We team up to reach the highest standards in what we do, and don’t take NO for an answer.We are expanding rapidly. Are you a top talent? Are you passionate about entrepreneurship? Join us and make an impact in the fintech space.", "mission": "Our Mission\nBecome the #1 all-in-one B2B finance OS\n\nOur Vision\nHelp entrepreneurs to change the world\n\nOur Values\nPurpose - Push for excellence, Go the extra mile, Think big.\n\nBelonging - Speak your mind, Help out, Earn trust.\n\nOwnership - Deliver results, Dive deep , Default ... Read more"}, "Northrop-Grumman": {"company_name": "Northrop-Grumman", "company_code": 488, "website": "www.northropgrumman.com", "headquarters": "Falls Church, United States", "size": "10000+ Employees", "founded": "1939", "type": "Company - Public (NOC)", "industry": "Aerospace & Defence", "revenue": "$10+ billion (USD)", "employer_description": "Northrop Grumman solves the toughest problems in space, aeronautics, defense and cyberspace to meet the ever-evolving needs of our customers worldwide. Our 90,000 employees are Defining Possible every day using science, technology and engineering to create and deliver advanced systems, products and services. Northrop Grumman careers and internships are as varied as your interests, with a lifetime of potential that will allow you to work together with people from many backgrounds, personal passions and disciplines. © 2020 Northrop Grumman is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. U.S. Citizenship is required for most positions. For our complete EEO/AA and Pay Transparency statement, please visit www.northropgrumman.com/EEO.", "mission": "Our vision is to be the most trusted provider of systems and technologies that ensure the security and freedom of our nation and its allies. As the technology leader, we will define the future of defense - from undersea to outer space, and in cyberspace."}, "Credit-Suisse": {"company_name": "Credit-Suisse", "company_code": 3141, "website": "www.credit-suisse.com", "headquarters": "Zürich, Switzerland", "size": "10000+ Employees", "founded": "1856", "type": "Company - Public", "industry": "Investment & Asset Management", "revenue": "$10+ billion (USD)", "employer_description": "Credit Suisse is a leading global wealth manager with strong investment banking capabilities. Headquartered in Zurich, Switzerland, we have a global reach with operations in about 50 countries and employ more than 45,000 people from over 150 different nations. Embodying entrepreneurial spirit, Credit Suisse delivers holistic financial solutions to our clients, including innovative products and specially tailored advice. Striving for quality and excellence in our work, we recognize and reward extraordinary performance among our employees, provide wide-ranging training and development opportunities, and benefit from a diverse range of perspectives to create value for our clients, shareholders and communities. We are Credit Suisse.", "mission": "Not provided on Glassdoor"}, "AirAsia": {"company_name": "AirAsia", "company_code": 318753, "website": "www.airasia.com", "headquarters": "Sepang, Malaysia", "size": "10000+ Employees", "founded": "2001", "type": "Company - Private", "industry": "Internet & Web Services", "revenue": "Unknown / Non-Applicable", "employer_description": "We started off in 2001 as just an airline, but it is now something much, much more. Our products and services make it easier, cheaper and more convenient for people to visit places and shop for their travel and lifestyle needs. Our businesses now include an online marketplace (airasia shop) for food and groceries (airasia food, airasia fresh). We are making logistics and banking more accessible (Teleport, BigPay), linking farms with businesses (OurFarm), and offering online tech education and entrepreneurship (Redbeat Academy).  airasia.com, our one-stop travel, e-commerce and fintech platform, offers more than 15 lines of products online and by a super-app -- from travel to lifestyle to finance, there is something on airasia.com for everyone.", "mission": "Now, everyone can travel, experience, shop, eat, enjoy rewards and more with the new airasia.com super app. From travel needs to everyday lifestyle essentials, there is always something for everyone."}, "Micron": {"company_name": "Micron", "company_code": 1648, "website": "www.micron.com/", "headquarters": "Boise, United States", "size": "10000+ Employees", "founded": "1978", "type": "Company - Public (MU)", "industry": "Computer Hardware Development", "revenue": "$10+ billion (USD)", "employer_description": "Micron memory and storage solutions define what the world can do with data. Our more than 34,000 team members, in 17 different countries, work with countless customers to innovate every day and pursue the products that will shape how we live and work tomorrow.\rMemory and storage have moved beyond simply holding data to now unlocking its meaning and value. They transform data into insight that people use. Through our global brands — Micron, Crucial, and Ballistix — we offer the industry's broadest portfolio of memory and storage products for the latest applications.", "mission": "Our mission is to be a global leader in memory and storage solutions."}, "Shell": {"company_name": "Shell", "company_code": 5833, "website": "www.shell.com", "headquarters": "The Hague, Netherlands", "size": "10000+ Employees", "founded": "1907", "type": "Company - Public (RDSA)", "industry": "Energy & Utilities", "revenue": "$10+ billion (USD)", "employer_description": "We are a global group of energy and petrochemicals companies with around 94,000 employees in more than 70 countries and territories. We use advanced technologies and take an innovative approach to help build a sustainable energy future. Our headquarters are in The Hague, the Netherlands, and our Chief Executive Officer is Ben van Beurden. The parent company of the Shell group is Shell plc, which is incorporated in England and Wales.Our strategy to generate profitable growth remains to drive forward with our investment programme, to deliver sustainable growth and provide competitive returns to shareholders, while helping to meet global energy demand in a responsible way.Our core values of honesty, integrity and respect for people form the basis of the Shell General Business Principles.  Discover more http://www.shell.com/global/aboutshell.html", "mission": "The objectives of the Shell group are to engage efficiently, responsibly and profitably in oil, oil products, gas, chemicals and other selected businesses and to participate in the search for and development of other sources of energy to meet evolving customer needs and the ... Read more"}, "DowDupont": {"company_name": "DowDupont", "company_code": 2123565, "website": "www.dow-dupont.com", "headquarters": "Midland, United States", "size": "10000+ Employees", "founded": "Not provided on Glassdoor", "type": "Company - Public", "industry": "Not provided on Glassdoor", "revenue": "$10+ billion (USD)", "employer_description": "Not provided on Glassdoor", "mission": "Not provided on Glassdoor"}, "Cake DeFi": {"company_name": "Cake DeFi", "company_code": 3557919, "website": "www.cakedefi.com", "headquarters": "Singapore, Singapore", "size": "51 to 200 Employees", "founded": "2019", "type": "Company - Private", "industry": "Information Technology Support Services", "revenue": "$100 to $500 million (USD)", "employer_description": "Cake was founded in early 2019 by Dr. Julian Hosp and U-Zyn Chua as a way to bring the benefits of passive income into the mainstream through a simple user interface. In less than a year’s time, Cake has become one of the most well known platforms for helping customers to get cashflow for their cryptocurrencies in the most transparent way. Cake combines the best elements of DeFi and CeFi for users to take advantage of some of the highest rates that staking and centralized finance can offer, all in a simple way through a Singapore registered and licensed entity.We are strong believers in the potential of DeFi, and we are working everyday to push the boundaries of DeFi and Bitcoin.We work independently, take ownership of our jobs, and are passionate about making a real impact in the world we live in.", "mission": "Providing cashflow from cryptocurrencies."}, "bytedance": {"company_name": "bytedance", "company_code": 1624196, "website": "www.bytedance.com", "headquarters": "Beijing, China", "size": "10000+ Employees", "founded": "2012", "type": "Company - Private", "industry": "Internet & Web Services", "revenue": "Unknown / Non-Applicable", "employer_description": "Founded in 2012, ByteDance is a technology company operating a range of content platforms that encourage and inspire creation and communication. We are one of the first companies to launch mobile-first products powered by machine learning technology.", "mission": "Our vision is to build highly inclusive and diverse platforms - we aim to not just deliver information but serve as a creative hub, hosting and nurturing creators. This belief guides our strategy in product development. Alongside our flagship product Toutiao, the largest content discovery and creation platform in China, we have also developed a diverse portfolio of products that are popular around the world, most notably TikTok and TopBuzz."}, "Marathon-Petroleum": {"company_name": "Marathon-Petroleum", "company_code": 7657, "website": "www.marathonpetroleum.com", "headquarters": "Findlay, United States", "size": "10000+ Employees", "founded": "1887", "type": "Company - Public (MPC)", "industry": "Energy & Utilities", "revenue": "$10+ billion (USD)", "employer_description": "Marathon Petroleum has a long running commitment to its customers. Spun off from Marathon Oil Corporation in 2011, the company operates six refineries with the capacity to process about 1.1 million barrels of crude oil a day. Marathon Petroleum sells refined products at some 5,100 Marathon-branded gas stations and through retail subsidiary Speedway SuperAmerica's 1,350 outlets. It also holds stakes in 4,500 miles of pipeline and is one of the largest asphalt and light oil product terminal operators in the US. The company distributes petroleum products wholesale to private-brand marketers and to large commercial and industrial consumers, as well as to the spot market. It has operations in almost 20 US states.", "mission": "Not provided on Glassdoor"}, "Sherwin-Williams": {"company_name": "Sherwin-Williams", "company_code": 599, "website": "www.sherwin-williams.com", "headquarters": "Cleveland, United States", "size": "10000+ Employees", "founded": "1866", "type": "Company - Public (SHW)", "industry": "Consumer Product Manufacturing", "revenue": "$10+ billion (USD)", "employer_description": "Here, there's no one path to success. Our 60,000+ employees are diverse, innovative and passionate. Our employees worldwide bring their energy and unique perspectives to each new day. We believe in careers that grow with you and open up new opportunities. With the support of a global team, you can innovate, grow and discover a career where you can thrive and Let Your Colors Show.Equal Opportunity Employer of all protected statuses, including disability and veteran.", "mission": "Our mission began more than 150 years ago in 1866 when Henry Sherwin and Edward Williams founded the company in Cleveland, Ohio. The duo went on to shape an industry and create a global legacy. That legacy continues on today as we look ahead and continue to innovate our future. ... Read more"}, "Singapore-Polytechnic": {"company_name": "Singapore-Polytechnic", "company_code": 254756, "website": "www.sp.edu.sg", "headquarters": "Singapore, Singapore", "size": "1001 to 5000 Employees", "founded": "1954", "type": "College / University", "industry": "Colleges & Universities", "revenue": "$1 to $5 million (USD)", "employer_description": "Not provided on Glassdoor", "mission": "Not provided on Glassdoor"}, "Nanyang-Polytechnic": {"company_name": "Nanyang-Polytechnic", "company_code": 299931, "website": "www.nyp.edu.sg", "headquarters": "Singapore, Singapore", "size": "1001 to 5000 Employees", "founded": "1992", "type": "Government", "industry": "Colleges & Universities", "revenue": "$5 to $25 million (USD)", "employer_description": "Not provided on Glassdoor", "mission": "Not provided on Glassdoor"}, "foodpanda": {"company_name": "foodpanda", "company_code": 709546, "website": "www.foodpanda.com", "headquarters": "Berlin, Germany", "size": "1001 to 5000 Employees", "founded": "2012", "type": "Company - Public", "industry": "Internet & Web Services", "revenue": "Unknown / Non-Applicable", "employer_description": "At foodpanda, we're on a mission to redefine how food, people, culture and tech are connected. Our panda family consists of problem solvers, designers and thinkers, working around the clock to make foodpanda the most powerful online tool for food convenience in the universe- and we’re just getting started!foodpanda operates in 11 countries worldwide. Through the energy of our teams in all of our offices, we connect lovers of food to our brilliant partner restaurants through our amazing riders. We're changing the way food delivery is viewed and experienced worldwide.", "mission": "To be the go-to delivery choice for good food and great deals."}, "ICBC": {"company_name": "ICBC", "company_code": 40639, "website": "www.icbc-cz.com", "headquarters": "Beijing, China", "size": "1 to 50 Employees", "founded": "1984", "type": "Company - Public (1398)", "industry": "Banking & Lending", "revenue": "Unknown / Non-Applicable", "employer_description": "In the event not every young man wants to go west, Industrial and Commercial Bank of China (ICBC) is able to finance trips elsewhere. The firm is one of China's biggest banks -- and one of the largest in the world. ICBC, which went public in 2006 in a record-setting IPO, manages around 17,000 domestic branches and more than 160 overseas branches and offices. The bank's financial services, offered in Chinese renminbi and foreign currencies, include wholesale, retail, and international banking for more than 3 million corporate clients and some 190 million individuals. It oversees about a quarter of the total domestic assets owned by China's commercial banks. The Chinese government controls about 70% of ICBC.", "mission": "Not provided on Glassdoor"}, "Vale": {"company_name": "Vale", "company_code": 683893, "website": "www.vale.com", "headquarters": "Rio de Janeiro, Brazil", "size": "10000+ Employees", "founded": "Not provided on Glassdoor", "type": "Company - Private", "industry": "Mining & Metals", "revenue": "$10+ billion (USD)", "employer_description": "We are a global mining company producing iron ore, pellets, and nickel, and we are committed to becoming one of the safest, most trustworthy mining company in the world. With a workforce of 120,000 employees, we work every day to transform natural resources into prosperity and sustainable development for the approximately 30 countries in which we operate.In addition to mining, we have operations in logistics, energy, and steelmaking. We self-generate 54% of the energy we use, and in Brazil alone, more than 1 million people travel on our passenger trains on the Vitória-Minas and Carajás railroads every year.We continuously reassert our commitment to the future of our planet by, among other initiatives, protecting 8,500 km² of natural land and investing in R&D to lead the sustainable mining revolution, with the ultimate goal of becoming a carbon-neutral company by 2050. We are constantly evolving, always aiming to be a diverse and inclusive company. We are pursuing a goal of doubling our female workforce by 2030 and increasing representation among our leadership. Our activities are governed by a policy of transparency, safety and security, ethics, and respect in order to protect the environment and encourage the development of our employees.We are Vale.", "mission": "Not provided on Glassdoor"}, "indeed": {"company_name": "indeed", "company_code": 100561, "website": "www.indeed.com", "headquarters": "Austin, United States", "size": "10000+ Employees", "founded": "2004", "type": "Company - Private", "industry": "Internet & Web Services", "revenue": "$2 to $5 billion (USD)", "employer_description": "Indeed is the #1 job site in the world* with over 300M unique visitors every month**. Indeed strives to put job seekers first, giving them free access to search for jobs, post resumes, and research companies. Every day, we connect millions of people to new opportunities.*Comscore, Total Visits, September 2022**Indeed Internal Data, average monthly unique visitors April – September 2022", "mission": "We help people get jobs."}, "BHP": {"company_name": "BHP", "company_code": 3459, "website": "www.bhp.com", "headquarters": "Singapore, Singapore", "size": "10000+ Employees", "founded": "1885", "type": "Company - Public (BHP)", "industry": "Mining & Metals", "revenue": "$10+ billion (USD)", "employer_description": "We are BHP Billiton, a leading global resources company.We are among the world’s top producers of major commodities, including iron ore, metallurgicaland energy coal, conventional and unconventional oil and gas, copper, aluminium, manganese,uranium, nickel and silver.", "mission": "Not provided on Glassdoor"}, "Agency-for-Science-Technology-and-Research": {"company_name": "Agency-for-Science-Technology-and-Research", "company_code": 254781, "website": "www.a-star.edu.sg/", "headquarters": "Singapore, Singapore", "size": "5001 to 10000 Employees", "founded": "1991", "type": "Government", "industry": "Research & Development", "revenue": "Unknown / Non-Applicable", "employer_description": "Not provided on Glassdoor", "mission": "Not provided on Glassdoor"}, "TotalEnergies": {"company_name": "TotalEnergies", "company_code": 1038, "website": "www.totalenergies.com", "headquarters": "Paris, France", "size": "10000+ Employees", "founded": "1924", "type": "Company - Public (TOT)", "industry": "Energy & Utilities", "revenue": "$25 to $50 million (USD)", "employer_description": "With operations in more than 130 countries, we are a leading international oil and gas company. We produce, refine and market oil and manufacture petrochemicals. We are also a major player in natural gas and rank second in solar energy with SunPower. Demonstrating their commitment to better energy, our 100,000 employees help supply our customers around the world with safer, cleaner, more efficient and more innovative products that are accessible to as many people as possible. We work alongside our stakeholders to ensure that our operations consistently deliver economic, social and environmental benefits.", "mission": "Total's mission is to responsibly enable as many people as possible to access energy in a world of constantly growing demand, by focusing on three basic cornerstones:\r\n- Ethics\r\n- Safety\r\n- Corporate social responsibility (CSR)\r\nAs an energy company, we are also leveraging our ... Read more"}, "Caterpillar": {"company_name": "Caterpillar", "company_code": 137, "website": "www.caterpillar.com", "headquarters": "Irving, United States", "size": "10000+ Employees", "founded": "1925", "type": "Company - Public (CAT)", "industry": "Machinery Manufacturing", "revenue": "$10+ billion (USD)", "employer_description": "At Caterpillar, you build what matters—whether it’s the career you want, crucial work skills, strong relationships or new digital technologies. There are big jobs to be done worldwide—building critical infrastructure, bolstering local economies, meeting the demand for energy—and that work is powered by our people.Every single Caterpillar employee moves our company forward. Piece by piece, part by part, person by person. Together we create sustainable, world-changing solutions that impact lives around the globe. Join our winning team and help build a better world.", "mission": "Not provided on Glassdoor"}, "Accenture": {"company_name": "Accenture", "company_code": 4138, "website": "www.accenture.com", "headquarters": "Dublin, Ireland", "size": "10000+ Employees", "founded": "1989", "type": "Company - Public (ACN)", "industry": "Business Consulting", "revenue": "$10+ billion (USD)", "employer_description": "Accenture is a global professional services company with leading capabilities in digital, cloud and security. Combining unmatched experience and specialized skills across more than 40 industries, we offer Strategy and Consulting, Interactive, Technology and Operations services — all powered by the world’s largest network of Advanced Technology and Intelligent Operations centers. Our 569,000 people deliver on the promise of technology and human ingenuity every day, serving clients in more than 120 countries. We embrace the power of change to create value and shared success for our clients, people, shareholders, partners and communities. Visit us at www.accenture.com.", "mission": "Our 569,000 people deliver on the promise of technology and human ingenuity every day, serving clients in more than 120 countries. We embrace the power of change to create value and shared success for our clients, people, shareholders, partners and communities."}, "Coupang": {"company_name": "Coupang", "company_code": 914956, "website": "www.coupang.jobs/", "headquarters": "Seoul, South Korea", "size": "10000+ Employees", "founded": "2010", "type": "Company - Public (CPNG)", "industry": "Internet & Web Services", "revenue": "Unknown / Non-Applicable", "employer_description": "We exist to wow our customers. We know we’re doing the right thing when we hear our customers say, “How did we ever live without Coupang?” Born out of an obsession to make shopping, eating, and living easier than ever, we’re collectively disrupting the multi-billion-dollar e-commerce industry from the ground up. We are one of the fastest-growing e-commerce companies that established an unparalleled reputation for being a dominant and reliable force in South Korean commerce.We are proud to have the best of both worlds — a startup culture with the resources of a large global public company. This fuels us to continue our growth and launch new services at the speed we have been since our inception. We are all entrepreneurial surrounded by opportunities to drive new initiatives and innovations. At our core, we are bold and ambitious people that like to get our hands dirty and make a hands-on impact. At Coupang, you will see yourself, your colleagues, your team, and the company grow every day. Our mission to build the future of commerce is real. We push the boundaries of what’s possible to solve problems and break traditional tradeoffs. Join Coupang now to create an epic experience in this always-on, high-tech, and hyper-connected world.", "mission": "Our mission is to create a world in which our customers ask \"How did I ever live without Coupang?\""}, "bp": {"company_name": "bp", "company_code": 9011, "website": "www.bp.com/en/global/corporate/careers.html", "headquarters": "London, United Kingdom", "size": "10000+ Employees", "founded": "1908", "type": "Company - Public (BP)", "industry": "Energy & Utilities", "revenue": "$10+ billion (USD)", "employer_description": "At bp, we provide heat, light and mobility to customers all over the world, with a purpose to reimagine energy for people and the planet and an ambition to be a net zero company by 2050 or sooner.", "mission": "Our purpose is reimagining energy for people and our planet. We want to help the world reach net zero and improve people’s lives. We will aim to dramatically reduce carbon in our operations and in our production, and grow new low carbon businesses, products and services.We will advocate for fundamental and rapid progress towards Paris and strive to be a leader in transparency.We know we don’t have all the answers and will listen and work with others. We want to be an energy company with purpose; one that is trusted by society, valued by shareholders and motivating for everyone who works at bp. We believe we have the experience and expertise, the relationships and the reach, the skill and the will, to do this."}, "Agoda": {"company_name": "Agoda", "company_code": 461386, "website": "www.agoda.com/", "headquarters": "Singapore, Singapore", "size": "5001 to 10000 Employees", "founded": "2005", "type": "Company - Public", "industry": "Internet & Web Services", "revenue": "$500 million to $1 billion (USD)", "employer_description": "Agoda is transforming travel for millions of customers across the globe. Headquartered in Asia, Agoda is one of the world’s largest online travel accommodation platforms. Founded in 2005 and now part of Booking Holdings (Nasdaq:BKNG), Agoda has a network of over 2,000,000 vacation rentals and hotels worldwide. Our web and mobile products provide a first-rate reservation service in 38 languages that uniquely combines local knowledge and local connections to provide the best deals for business and leisure travelers.Agoda employs over 5,000 professionals from 70 nationalities in locations around the globe. In every department – from engineering to customer experience – we provide an environment rich with creativity, collaboration, and experimentation, and the tools to work faster and smarter.At Agoda, we believe our people are our strength. We work hard and have fun, and we choose people who are dedicated to making things great.", "mission": "Managing a system this complex requires a passion for technology. In offices from Bangkok to New York and dozens of places in between, our talented people work hard every day to find solutions, create value, and push boundaries."}, "Newmont": {"company_name": "Newmont", "company_code": 479, "website": "www.newmont.com", "headquarters": "Denver, United States", "size": "10000+ Employees", "founded": "1921", "type": "Company - Public (NEM)", "industry": "Mining & Metals", "revenue": "$5 to $10 billion (USD)", "employer_description": "Newmont Goldcorp is the world’s leading gold company and a producer of copper, silver, zinc and lead. The Company’s world-class portfolio of assets, prospects and talent is anchored in favorable mining jurisdictions in North America, South America, Australia and Africa. Newmont Goldcorp is the only gold producer listed in the S&P 500 Index and is widely recognized for its principled environmental, social and governance practices. The Company is an industry leader in value creation, supported by robust safety standards, superior execution and technical proficiency. Newmont Goldcorp was founded in 1921 and has been publicly traded since 1925.", "mission": "Our purpose is to create value and improve lives through sustainable and responsible mining."}, "Shopee": {"company_name": "Shopee", "company_code": 1263091, "website": "www.shopee.sg", "headquarters": "Singapore, Singapore", "size": "5001 to 10000 Employees", "founded": "2015", "type": "Company - Private", "industry": "Internet & Web Services", "revenue": "Unknown / Non-Applicable", "employer_description": "Not provided on Glassdoor", "mission": "Not provided on Glassdoor"}, "Southwest-Airlines-Reviews": {"company_name": "Southwest-Airlines-Reviews", "company_code": 611, "website": "www.southwest.com", "headquarters": "Dallas, United States", "size": "10000+ Employees", "founded": "1967", "type": "Company - Public (LUV)", "industry": "Airlines, Airports & Air Transportation", "revenue": "$10+ billion (USD)", "employer_description": "We're the low fare, high-flying airline whose People set us apart.Looking for a career? You can always find the latest at https://careers.southwestair.com/ Don’t see what you’re looking for? Join our Talent Community so you can be notified when relevant positions become available: https://careers.southwestair.com/jointalentcommunityWant to book travel for your business? https://www.southwest.com/html/air/business-groups/Just wanna get away? https://www.southwest.com/Southwest Airlines is all about moving People—by helping them travel from one place to another, and by genuinely caring for Employees and Customers. Our Employees make us who we are, so it’s fitting that the Heart at the center of our brand showcases the strength of Southwest Employees—whose dedication can be felt by every Customer each time Southwest Airlines connects them to what's important in their life. Southwest is one of the most honored airlines in the world, known for a triple bottom line approach that contributes to our performance and productivity, the importance of our People and the communities we serve, and an overall commitment to efficiency and the planet. Learn more about how we gives back to communities across the world by visiting Southwest.com/citizenship.  Southwest Airlines recognizes, respects, and values differences. By fostering a Culture that embraces and utilizes our diversity, we create competitive advantages in Teamwork and innovation that contribute to our overall success. Our PurposeConnect People to what’s important in their lives through friendly, reliable, and low-cost air travel.Our VisionTo be the world’s most loved, most efficient, and most profitable airline.Our Company PromiseSouthwest will provide a stable work environment with equal opportunity for learning and personal growth. Employees will be provided the same concern, respect, and caring attitude within the organization that they are expected to share externally with every Southwest Customer.Our Employee PromiseI will demonstrate my Warrior Spirit by striving to be my best and never giving up. I will show my Servant’s Heart by delivering Legendary Customer Service and treating others with respect. I will express my Fun-LUVing Attitude by not taking myself too seriously and embracing my Southwest Family.", "mission": "Not provided on Glassdoor"}, "Quess": {"company_name": "Quess", "company_code": 977654, "website": "www.quesscorp.com", "headquarters": "Bangalore, India", "size": "10000+ Employees", "founded": "2007", "type": "Company - Public (QUESS)", "industry": "HR Consulting", "revenue": "$2 to $5 billion (USD)", "employer_description": "About Quess Corp Limited: Quess Corp Limited (BSE: 539978, NSE: QUESS), established in 2007, is India’s leading integrated business services provider. Based out of Bengaluru, Quess today has a Pan-India presence with 65 offices across 34 cities along with overseas footprint in North America, the Middle East and South East Asia. It serves over 1700+ customers across 4 segments namely, Global Technology Solutions, People & Services, Integrated Facility Management and Industrials. Quess has over 195,000 employees (including Manipal Integrated Services and Terrier Security Services) and market cap of over INR 11,500 Crores as on June 30, 2017. For further details on Quess Corp Ltd. please visit: http://www.quesscorp.com", "mission": "To be a global company that provides world-class customer experience while continuously working towards creating better lives."}, "circles-life": {"company_name": "circles-life", "company_code": 1739088, "website": "www.circlesglobal.com/", "headquarters": "Singapore, Singapore", "size": "501 to 1000 Employees", "founded": "2014", "type": "Company - Private", "industry": "Telecommunications Services", "revenue": "Unknown / Non-Applicable", "employer_description": "Circles Global is the fastest growing technology firm in the telco industry, offering a SaaS based ‘Digital Telco as a Service’ to global telcos around the world. Circles-X, the world’s first cloud-native, full-stack Telco Operating System, has enabled our partners, such as KDDI in Japan and XL in Indonesia, to provide a best-in-class experience and an ecosystem of digital services to their own customers. They achieved that while reducing their OPEX and CAPEX by >50%.Circles-X also powers Circles' own consumer operations (under its own Circles.Life brand) to grow exponentially in multiple markets (Singapore, Australia, and Taiwan), becoming the region's fastest growing telco offering multiple digital services while attaining record breaking NPS (+50).", "mission": "1. Giving power to the customer2. Leading innovation in the digital services3. Building a great place to work and grow"}, "NTT-DATA": {"company_name": "NTT-DATA", "company_code": 7649, "website": "www.nttdata.com/global/en", "headquarters": "Tokyo, Japan", "size": "10000+ Employees", "founded": "1967", "type": "Company - Public (9613)", "industry": "Information Technology Support Services", "revenue": "$10+ billion (USD)", "employer_description": "NTT DATA partners with clients to navigate and simplify the modern complexities of business and technology, delivering the insights, solutions and outcomes that matter most. We deliver tangible business results by combining deep industry expertise with applied innovations in digital, cloud and automation across a comprehensive portfolio of consulting, applications, infrastructure and business process services. \rNTT DATA is a top 10 global business and IT services provider with 118,000+ professionals in more than 50 countries, and is part of NTT Group, a partner to 88 percent of the Fortune Global 100.", "mission": "NTT DATA uses information technology to create new paradigms and values, which help contribute to a more affluent and harmonious society."}, "Lenovo": {"company_name": "Lenovo", "company_code": 8034, "website": "www.lenovo.com", "headquarters": "Morrisville, United States", "size": "10000+ Employees", "founded": "1984", "type": "Company - Public (LNVGY)", "industry": "Computer Hardware Development", "revenue": "$10+ billion (USD)", "employer_description": "We're the world's fastest-growing computer company. \rWe make the technology that powers the world's best ideas. We are fueled by innovation. And we support awesome people doing awesome things. Together, we hope to make the world a better, more interesting, more connected place.\rLenovo Social Accounts:\r*Check out our Facebook Page: https://www.facebook.com/lenovoUS/timeline\r* Follow us on Twitter: https://twitter.com/lenovo \r* Watch our Videos here: http://www.youtube.com/LenovoVision", "mission": "Lenovo is not just the #1 PC company in the world anymore. We are transforming into a PC+ company. The market is changing quickly and Lenovo is nimble enough to change with it. Lenovo is now looking to become a global leader in both Mobile phones and Servers. Lenovo recently ... Read more"}, "BB-and-T": {"company_name": "BB-and-T", "company_code": 1893, "website": "www.bbt.jobs", "headquarters": "Winston-Salem, United States", "size": "10000+ Employees", "founded": "1872", "type": "Company - Public (BBT)", "industry": "Investment & Asset Management", "revenue": "$5 to $10 billion (USD)", "employer_description": "BB&T is much more than a bank. We are the nation’s 10th largest financial holding company, providing our clients with banking, insurance, investment and other financial solutions. We have more than 30,000 associates and more than 1,800 locations in 13 states and Washington, D.C.  Our success as an organization is based on the vision, mission and values that comprise the BB&T philosophy. Fundamental principles guide us in every decision we make. Our values are the foundation for our relationships with our associates, clients and shareholders.  At BB&T, we believe our associates are our most valuable asset. We operate on the principle that each individual is capable of having a positive impact on the organization. This belief has allowed BB&T to evolve into one of the financial service industry's top performers.", "mission": "To make the world a better place to live by:\r\n\r\n■ Helping our Clients achieve economic success and financial security;\r\n■ Creating a place where our Employees can learn, grow and be fulfilled in their work;\r\n■ Making the Communities in which we work better places to ... Read more"}, "OCBC": {"company_name": "OCBC", "company_code": 9773, "website": "www.ocbc.com/group/careers/index.html", "headquarters": "Singapore, Singapore", "size": "10000+ Employees", "founded": "1932", "type": "Company - Public (O39)", "industry": "Banking & Lending", "revenue": "$10+ billion (USD)", "employer_description": "We are the longest established Singapore financial services group, formed in 1932 from the merger of three local banks, the oldest of which was founded in 1912. We are now the second largest financial services group in Southeast Asia by assets and one of the world’s most highly-rated banks, with an Aa1 rating from Moody’s. We have been ranked Asean’s strongest bank and among the world’s five strongest banks by Bloomberg Markets for five consecutive years since the ranking’s inception in 2011. Our insurance subsidiary, Great Eastern Holdings, is the largest insurance group in Singapore and Malaysia by assets. Our asset management subsidiary, Lion Global Investors, is one of the largest private sector asset management companies in Southeast Asia. Private banking services are provided by our subsidiary, Bank of Singapore, which operates on a unique open-architecture product platform to source for the best-in-class products to meet its clients’ goals.", "mission": "We help individuals and businesses across communities achieve their aspirations by providing innovative financial services that meet their needs."}, "Blackrock": {"company_name": "Blackrock", "company_code": 9331, "website": "www.blackrock.com", "headquarters": "New York, United States", "size": "10000+ Employees", "founded": "1988", "type": "Company - Public (BLK)", "industry": "Investment & Asset Management", "revenue": "$10+ billion (USD)", "employer_description": "BlackRock helps investors build better financial futures. As a fiduciary to investors and a leading provider of financial technology, our clients turn to us for the solutions they need when planning for their most important goals. As of December 31, 2018, the firm managed approximately $5.98 trillion in assets on behalf of investors worldwide. For additional information on BlackRock, please visit www.blackrock.com | Twitter: @blackrock | Blog: www.blackrockblog.com | LinkedIn: www.linkedin.com/company/blackrock", "mission": "BlackRock’s mission is to create a better financial future for our clients. As we pursue this mission, our guide is our BlackRock culture and Principles—that is, our shared understanding of who we are, what we stand for and how we will conduct ourselves each and every day."}, "Delta-Air-Lines": {"company_name": "Delta-Air-Lines", "company_code": 197, "website": "www.delta.com/us/en/careers/overview", "headquarters": "Atlanta, United States", "size": "10000+ Employees", "founded": "1928", "type": "Company - Public (DAL)", "industry": "Airlines, Airports & Air Transportation", "revenue": "$10+ billion (USD)", "employer_description": "We’ve been connecting people since our first passenger flight in 1929. Since then, we’ve been steadily climbing toward our goal of being the world’s best airline. We serve more worldwide destinations than any other airline, we’ve added more international capacity than all other major U.S. airlines combined, and we’re the leader in trans-Atlantic flights. We’re guided by the belief that connecting the world is the most important work there is. That our purpose is to erase the distance that separates us. And that the farther we go, the closer we land.", "mission": "Not provided on Glassdoor"}, "Singtel": {"company_name": "Singtel", "company_code": 3971, "website": "www.singtel.com", "headquarters": "Singapore, Singapore", "size": "10000+ Employees", "founded": "1879", "type": "Company - Public (SGTJY)", "industry": "Telecommunications Services", "revenue": "$10+ billion (USD)", "employer_description": "Singtel is Asia's leading communications technology group, providing a portfolio of services from next-generation communication, 5G and technology services to infotainment to both consumers and businesses. The Group has presence in Asia, Australia and Africa and reaches over 740 million mobile customers in 21 countries. Its infrastructure and technology services for businesses span 21 countries, with more than 428 direct points of presence in 362 cities.  For consumers, Singtel delivers a complete and integrated suite of services, including mobile, broadband and TV. For businesses, Singtel offers a complementary array of workforce mobility solutions, data hosting, cloud, network infrastructure, analytics and cyber security capabilities. Singtel is dedicated to continuous innovation, harnessing next-generation technologies to create new and exciting customer experiences as we shape a more sustainable, digital future. The Group’s purpose is grounded in empowering our people to innovate better ways to connect with customers, unlock new possibilities for future businesses to thrive and foster a sense of ownership and belonging to better serve our stakeholders, partners and communities.", "mission": "We believe that the world is a better place when technology is used to help people and businesses communicate effortlessly. We make communication easier, faster and more reliable for customers, while delivering value to our stakeholders."}, "Anadarko-Petroleum": {"company_name": "Anadarko-Petroleum", "company_code": 48, "website": "www.anadarko.com", "headquarters": "The Woodlands, United States", "size": "1001 to 5000 Employees", "founded": "1959", "type": "Company - Public (APC)", "industry": "Energy & Utilities", "revenue": "$10+ billion (USD)", "employer_description": "Anadarko is among the world’s largest independent oil and natural gas exploration and production companies, with corporate offices in The Woodlands, Texas. Our deep and balanced portfolio of assets encompasses premier positions in the Delaware and DJ basins onshore U.S., and oil-focused opportunities in the Gulf of Mexico and deepwater basins worldwide.  Our employees are committed to our core values of integrity and trust, servant leadership, commercial focus, people and passion and open communication in all of our business activities.  At Anadarko, we directly employ more than 4,900 men and women, and we who strive for excellence in all that they do. We know the best vision in the world will not be realized without the right people.", "mission": "Anadarko's mission is to deliver a competitive and sustainable rate of return to shareholders by developing, acquiring and exploring for oil and gas resources vital to the world's health and welfare."}, "Goldmans-Sachs": {"company_name": "Goldmans-Sachs", "company_code": 2800, "website": "www.goldmansachs.com", "headquarters": "New York, United States", "size": "10000+ Employees", "founded": "1869", "type": "Company - Public (GS)", "industry": "Investment & Asset Management", "revenue": "$10+ billion (USD)", "employer_description": "The Goldman Sachs Group, Inc. is a leading global investment banking, securities and investment management firm that provides a wide range of financial services to a substantial and diversified client base that includes corporations, financial institutions, governments and high-net-worth individuals. Founded in 1869, the firm is headquartered in New York and maintains offices in all major financial centers around the world.", "mission": "Not provided on Glassdoor"}, "Google": {"company_name": "Google", "company_code": 9079, "website": "goo.gle/3ygdkgv", "headquarters": "Mountain View, United States", "size": "10000+ Employees", "founded": "1998", "type": "Company - Public (GOOG)", "industry": "Internet & Web Services", "revenue": "$10+ billion (USD)", "employer_description": "Since our founding in 1998, Google has grown by leaps and bounds. Starting from two computer science students in a university dorm room, we now have over a hundred thousand employees and over one hundred offices around the world. These Googlers build products that help create opportunities for everyone, whether down the street or across the globe. So whether you want to be a part of developing innovative technology, campaigns, products or partnerships, your work here is a chance to accomplish things that matter. To learn more about our job opportunities, teams, offices, benefits and workplace culture, visit careers.google.com.", "mission": "To organize the world’s information and make it universally accessible and useful."}, "Duke-NUS": {"company_name": "Duke-NUS", "company_code": 422270, "website": "www.duke-nus.edu.sg", "headquarters": "Singapore, Singapore", "size": "1001 to 5000 Employees", "founded": "2005", "type": "College / University", "industry": "Colleges & Universities", "revenue": "$100 to $500 million (USD)", "employer_description": "Duke-NUS is Singapore’s flagship graduate entry medical school, established in 2005 with a strategic, government-led partnership between two world-class institutions: Duke University School of Medicine and the National University of Singapore (NUS). Through an innovative curriculum, students at Duke-NUS are nurtured to become multi-faceted Clinicians Scientists  poised to steer the healthcare and biomedical ecosystem in Singapore and beyond. A leader in ground-breaking research and translational innovation, Duke-NUS has gained international renown through its five signature research programmes and eight centres. The enduring impact of its discoveries is amplified by its successful Academic Medicine partnership with Singapore Health Services (SingHealth), Singapore’s largest healthcare group. This strategic alliance has spawned 15 Academic Clinical Programmes, which harness multi-disciplinary research and education to transform medicine and improve lives.  For more information, please visit www.duke-nus.edu.sg", "mission": "Our vision:Transforming medicine, improving lives"}, "National-University-of-Singapore": {"company_name": "National-University-of-Singapore", "company_code": 222778, "website": "www.nus.edu.sg", "headquarters": "Singapore, Singapore", "size": "10000+ Employees", "founded": "1905", "type": "College / University", "industry": "Not provided on Glassdoor", "revenue": "$500 million to $1 billion (USD)", "employer_description": "Not provided on Glassdoor", "mission": "Not provided on Glassdoor"}, "Crown-Holdings": {"company_name": "Crown-Holdings", "company_code": 186, "website": "careers.eur.crowncork.com/", "headquarters": "Yardley, United States", "size": "10000+ Employees", "founded": "1892", "type": "Company - Public (CCK)", "industry": "Consumer Product Manufacturing", "revenue": "$10+ billion (USD)", "employer_description": "Crown is a worldwide leader in the design, manufacture, and sale of packaging products and equipment for consumer and industrial products. Crown's packaging for consumer products include steel and aluminum cans for food, beverage, household and other consumer products, glass bottles for beverage product and metal vacuum closures and steel crowns sold through Crown's sales organization to the soft drink, food, citrus, brewing, household products, personal care and various other industries. Crown's packaging for industrial products includes steel and plastic strap consumables and equipment, paper based protective packaging, and plastic film consumables and equipment, which are sold into the metals, food and beverage, construction, agricultural, corrugated, and general industries.At December 31, 2018, the Company operated 241 plants along with sales and service facilities throughout 47 countries and had approximately 33,000 employees. Consolidated net sales for Company in 2018 were $11.2 billion with 72% derived from operations outside the US.", "mission": "Not provided on Glassdoor"}, "Carousell": {"company_name": "Carousell", "company_code": 988629, "website": "www.carousell.com", "headquarters": "Singapore, Singapore", "size": "501 to 1000 Employees", "founded": "2012", "type": "Company - Private", "industry": "Internet & Web Services", "revenue": "Unknown / Non-Applicable", "employer_description": "Carousell Group is the leading multi-category platform for secondhand in Greater Southeast Asia on a mission to inspire the world to start selling, and to make secondhand the first choice. Founded in August 2012 in Singapore, the Group has a leading presence in seven markets under the brands Carousell, Cho Tot, Laku6, Mudah.my, OneShift, Ox Luxe, Ox Street, and Refash, serving tens of millions of monthly active users. Carousell is backed by leading investors including Telenor Group, Rakuten Ventures, Naver, STIC Investments and Sequoia Capital India. As a team of passionate individuals working together to solve meaningful problems, there is so much more for you to discover in a career with Carousell. Our culture is made up of hiring, developing, and promoting people who embody our values of HEART, which is an acronym for Humility, Empathy, Accountability, Relentlessly resourceful and Teamwork. Together as an organisation, we make magic happen.", "mission": "Our mission is to inspire every person in the world to start selling and buying to make more possible for one another."}, "Barrick-Gold": {"company_name": "Barrick-Gold", "company_code": 5793, "website": "www.barrick.com", "headquarters": "Toronto, Canada", "size": "10000+ Employees", "founded": "1983", "type": "Company - Public (GOLD)", "industry": "Mining & Metals", "revenue": "$5 to $10 billion (USD)", "employer_description": "In the world of mining, Barrick's name is golden. The company became the world's #1 gold producer after acquiring Placer Dome in 2006. Barrick churns out almost 8 million ounces of gold annually and has 140 million ounces in proved and probable reserves. More than a third of the company's production comes from its North American operations, which include the Goldstrike property, located in Nevada's Carlin Trend gold-producing region. Its properties outside of North America include projects in Tanzania, Peru, and Australia. The acquisition of Placer Dome and the merger of Barrick and Newmont Goldcorp in Nevada solidifies Barrick's place as the leader in the mining industry.", "mission": "We aim to be the leading mining company focused on gold, growing our cash flow per share by developing and operating high quality assets through disciplined allocation of human and financial capital and operational excellence."}, "Yale-NUS-College": {"company_name": "Yale-NUS-College", "company_code": 581172, "website": "www.yale-nus.edu.sg", "headquarters": "Singapore, Singapore", "size": "51 to 200 Employees", "founded": "2013", "type": "College / University", "industry": "Colleges & Universities", "revenue": "Unknown / Non-Applicable", "employer_description": "Not provided on Glassdoor", "mission": "Not provided on Glassdoor"}, "Adecco": {"company_name": "Adecco", "company_code": 1089, "website": "www.adecco.com", "headquarters": "Zürich, Switzerland", "size": "201 to 500 Employees", "founded": "1996", "type": "Company - Public (ADEN)", "industry": "Staffing, Recruitment & Subcontracting", "revenue": "$10+ billion (USD)", "employer_description": "Not provided on Glassdoor", "mission": "Not provided on Glassdoor"}, "Temasek-Polytechnic": {"company_name": "Temasek-Polytechnic", "company_code": 581628, "website": "www.tp.edu.sg", "headquarters": "Singapore, Singapore", "size": "1001 to 5000 Employees", "founded": "1990", "type": "College / University", "industry": "Colleges & Universities", "revenue": "$25 to $50 million (USD)", "employer_description": "Not provided on Glassdoor", "mission": "Not provided on Glassdoor"}, "Ufinity-Singapore": {"company_name": "Ufinity-Singapore", "company_code": 385955, "website": "www.ufinity.com", "headquarters": "Singapore, Singapore", "size": "201 to 500 Employees", "founded": "2001", "type": "Company - Private", "industry": "Computer Hardware Development", "revenue": "Unknown / Non-Applicable", "employer_description": "Ufinity provides the industry's most innovative and integrated business Information Technology (IT) systems for Asia's leading enterprises, including large multinational groups, educational institutions and government ministries and agencies. We continue to be the driver of innovative solutions, delivering many industry's firsts with exceptional value.Incorporated in 2001, Ufinity Pte Ltd is a highly successful IT solutions engineering company which specializes in the implementation of enterprise software and services and working with the Singapore Government to realise some of the most exciting public services.Today, the company employs more than 200 developers and engineers with strong expertise and experience in Custom Solutions Development, Identity Access Management, Education and Agile co-development.Our solution strategy provides our clients unmatched benefits from leading standard software and systems, including excellent system availability, scalability, process efficiency and powerful performance.", "mission": "Not provided on Glassdoor"}, "Maybank": {"company_name": "Maybank", "company_code": 7664, "website": "www.maybank.com.my", "headquarters": "Kuala Lumpur, Malaysia", "size": "10000+ Employees", "founded": "Not provided on Glassdoor", "type": "Company - Public (MAYBANK)", "industry": "Banking & Lending", "revenue": "$10+ billion (USD)", "employer_description": "Malaysia's largest bank, Malayan Banking Berhad (better known as Maybank) and its subsidiaries operate some 500 branches, mostly in Malaysia, but also in Singapore, Indonesia, the Philippines, and elsewhere throughout Southeast Asia. Its core services consist of deposits, mortgages and other loans, and credit cards to individuals and businesses. Other offerings include investment banking, asset management, online banking, brokerage, insurance, unit trusts and other investments, and corporate finance. Amanah Raya, a trust company controlled by the Malaysian government, owns more than 45% of Maybank.", "mission": "Not provided on Glassdoor"}, "Republic-Services": {"company_name": "Republic-Services", "company_code": 8328, "website": "www.republicservices.com", "headquarters": "Phoenix, United States", "size": "10000+ Employees", "founded": "1998", "type": "Company - Public (RSG)", "industry": "Energy & Utilities", "revenue": "$5 to $10 billion (USD)", "employer_description": "Republic Services, Inc. is an industry leader in U.S. recycling and waste services. Through its subsidiaries, Republic’s collection operations, transfer stations, recycling processing centers, landfills and environmental services provide effective solutions to make responsible recycling and waste disposal effortless for customers across the country.Each day, Republic empowers more than 35,000 exceptional employees to do their best work. The Company takes pride in the commitment to the safety of employees and communities; customer engagement; environmental stewardship and sustainable practices; community involvement, and innovation in all aspects of its business operations. Republic strives to be an employer of choice for top talent and works to create and maintain an environment that attracts, develops and retains people who are aligned to serve customers and preserve the planet.", "mission": "Our Vision\nTo be America's preferred recycling and waste services partner\n\nOur Purpose \nTo create value for all...our employees...our customers...our communities & planet...our shareholders\n\nOur Values \nRespectful: We value others and demonstrate \nResponsible: We do the right ... Read more"}, "expressvpn": {"company_name": "expressvpn", "company_code": 3355140, "website": "www.expressvpn.com", "headquarters": "Road Town, British Virgin Islands", "size": "501 to 1000 Employees", "founded": "2009", "type": "Contract", "industry": "Internet & Web Services", "revenue": "Unknown / Non-Applicable", "employer_description": "Founded in 2009, ExpressVPN is one of the world’s largest providers of VPN services, enabling millions of active users in 180+ countries to protect their privacy and security online with just a few clicks. The company’s award-winning software for Windows, Mac, iOS, Android, Linux, routers, and browsers secures user information and identities with best-in-class encryption and leakproofing.With 3,000+ servers across 94 countries and new servers added each week, ExpressVPN provides a fast connection wherever users are and offers uncensored access to sites and services from around the world. Based in the British Virgin Islands, ExpressVPN has a globally distributed team working in cities including Toronto, Lisbon, London, Zagreb, Singapore, Hong Kong, Perth, Manila, and Tokyo.A vocal advocate for internet freedom and privacy, ExpressVPN is a proud financial supporter of nonprofit organizations fighting to protect digital rights, including the Electronic Frontier Foundation, the Internet Defense League, OpenMedia, and others.ExpressVPN is part of the Kape Technologies family of leading privacy and security brands.", "mission": "Our mission is to make it easy for everyone to use the internet with security, privacy, and freedom.\n\nWe’re hiring in all departments, covering a wide range of roles with many paths for career growth.  Come and join a vibrant team that's making a difference.\n\nIf you care about ... Read more"}, "motional": {"company_name": "motional", "company_code": 3439934, "website": "www.motional.com", "headquarters": "Boston, United States", "size": "501 to 1000 Employees", "founded": "2020", "type": "Company - Private", "industry": "Computer Hardware Development", "revenue": "Unknown / Non-Applicable", "employer_description": "Our team is commercializing a world-class driverless system. The Motional team is behind some of the industry’s largest leaps forward in the last decade, including the first fully-autonomous cross-country drive in the U.S, the launch of the world’s first robotaxi pilot, and operation of the world’s most-established public robotaxi fleet. Strategically formed by Hyundai Motor Group, one of the world’s largest vehicle manufacturers offering smart mobility solutions, and Aptiv, a global technology leader in advanced safety, electrification, and vehicle connectivity, Motional is fundamentally changing how people move through their lives.Headquartered in Boston, Motional has operations in the US and Asia. For more information, visit www.Motional.com and follow us on social media.", "mission": "We’re making driverless vehicles a safe, reliable, and accessible reality."}, "WestRock": {"company_name": "WestRock", "company_code": 1033056, "website": "www.westrock.com", "headquarters": "Atlanta, United States", "size": "10000+ Employees", "founded": "2015", "type": "Company - Public (WRK)", "industry": "Consumer Product Manufacturing", "revenue": "$10+ billion (USD)", "employer_description": "WestRock (NYSE: WRK) partners with our customers to provide differentiated paper and packaging solutions that help them win in the marketplace. WestRock’s 45,000 team members support customers around the world from more than 300 operating and business locations spanning North America, South America, Europe, Asia and Australia. Learn more at www.westrock.com.", "mission": "At WestRock, we provide packaging solutions designed to give our customers a winning edge in the global marketplace. We partner closely with them to deliver the best value on everything from paperboard used for a wide variety of packaging and shipping containers to specialty ... Read more"}, "Southwest-Airlines": {"company_name": "Southwest-Airlines", "company_code": 611, "website": "www.southwest.com", "headquarters": "Dallas, United States", "size": "10000+ Employees", "founded": "1967", "type": "Company - Public (LUV)", "industry": "Airlines, Airports & Air Transportation", "revenue": "$10+ billion (USD)", "employer_description": "We're the low fare, high-flying airline whose People set us apart.Looking for a career? You can always find the latest at https://careers.southwestair.com/ Don’t see what you’re looking for? Join our Talent Community so you can be notified when relevant positions become available: https://careers.southwestair.com/jointalentcommunityWant to book travel for your business? https://www.southwest.com/html/air/business-groups/Just wanna get away? https://www.southwest.com/Southwest Airlines is all about moving People—by helping them travel from one place to another, and by genuinely caring for Employees and Customers. Our Employees make us who we are, so it’s fitting that the Heart at the center of our brand showcases the strength of Southwest Employees—whose dedication can be felt by every Customer each time Southwest Airlines connects them to what's important in their life. Southwest is one of the most honored airlines in the world, known for a triple bottom line approach that contributes to our performance and productivity, the importance of our People and the communities we serve, and an overall commitment to efficiency and the planet. Learn more about how we gives back to communities across the world by visiting Southwest.com/citizenship.  Southwest Airlines recognizes, respects, and values differences. By fostering a Culture that embraces and utilizes our diversity, we create competitive advantages in Teamwork and innovation that contribute to our overall success. Our PurposeConnect People to what’s important in their lives through friendly, reliable, and low-cost air travel.Our VisionTo be the world’s most loved, most efficient, and most profitable airline.Our Company PromiseSouthwest will provide a stable work environment with equal opportunity for learning and personal growth. Employees will be provided the same concern, respect, and caring attitude within the organization that they are expected to share externally with every Southwest Customer.Our Employee PromiseI will demonstrate my Warrior Spirit by striving to be my best and never giving up. I will show my Servant’s Heart by delivering Legendary Customer Service and treating others with respect. I will express my Fun-LUVing Attitude by not taking myself too seriously and embracing my Southwest Family.", "mission": "Not provided on Glassdoor"}, "IBM": {"company_name": "IBM", "company_code": 354, "website": "www.ibm.com", "headquarters": "Armonk, United States", "size": "10000+ Employees", "founded": "1911", "type": "Company - Public (IBM)", "industry": "Information Technology Support Services", "revenue": "$10+ billion (USD)", "employer_description": "IBM works to design, advance, and scale the technologies that define each era. Restlessly reinventing since 1911, we are one of the largest technology, consulting and research companies in the world. IBMers are agents of change – in this team, you’ll become a part of a historic, prestigious, and global community in which you’ll be respected, and your talents will have a real impact. Join our team of experts and thrive in a collaborative and friendly environment where you can bring your whole self at work. Use your skills to empower clients and partners to create something that is bigger than what any one of us could produce alone.Come and let’s create together!", "mission": "Our purpose is to be the catalyst that makes the world work better, guided by principles of trust, transparency and support for a more inclusive society. We are committed to being a responsible technology innovator and a force for good in the world."}, "Chevron": {"company_name": "Chevron", "company_code": 13524, "website": "www.chevron.com", "headquarters": "San Ramon, United States", "size": "10000+ Employees", "founded": "1879", "type": "Company - Public (CVX)", "industry": "Energy & Utilities", "revenue": "$10+ billion (USD)", "employer_description": "At Chevron, we are relentlessly focused on producing safe, reliable energy now and for the future. How are we doing it? By applying the energy we have most in abundance: Human Energy.", "mission": "Not provided on Glassdoor"}, "Martin-Marietta": {"company_name": "Martin-Marietta", "company_code": 3568, "website": "www.martinmarietta.com", "headquarters": "Raleigh, United States", "size": "5001 to 10000 Employees", "founded": "1939", "type": "Company - Public (MLM)", "industry": "Mining & Metals", "revenue": "$2 to $5 billion (USD)", "employer_description": "A member of the S&P 500 Index, Martin Marietta is an American-based company and a leading supplier of building materials -- including aggregates, cement, ready mixed concrete and asphalt. Through a network of operations spanning 26 states, Canada and the Bahamas, dedicated Martin Marietta teams supply the resources necessary for building the solid foundations on which our communities thrive.", "mission": "As a leading provider of natural resource-based building materials, Martin Marietta provides the foundation upon which our communities improve and grow."}, "Barclays": {"company_name": "Barclays", "company_code": 3456, "website": "search.jobs.barclays", "headquarters": "London, United Kingdom", "size": "10000+ Employees", "founded": "1690", "type": "Company - Public (BARC)", "industry": "Banking & Lending", "revenue": "$10+ billion (USD)", "employer_description": "Not provided on Glassdoor", "mission": "Not provided on Glassdoor"}, "Valero-Energy": {"company_name": "Valero-Energy", "company_code": 704, "website": "www.valero.com", "headquarters": "San Antonio, United States", "size": "10000+ Employees", "founded": "1980", "type": "Company - Public (VLO)", "industry": "Energy & Utilities", "revenue": "$10+ billion (USD)", "employer_description": "Valero Energy Corporation, through its subsidiaries (collectively, “Valero”), is an international manufacturer and marketer of transportation fuels and petrochemical products. Valero is a Fortune 50 company based in San Antonio, Texas, and it operates 15 petroleum refineries with a combined throughput capacity of approximately 3.1 million barrels per day and 14 ethanol plants with a combined production capacity of 1.73 billion gallons per year. The petroleum refineries are located in the United States, Canada and the United Kingdom, and the ethanol plants are located in the Mid-Continent region of the U.S. Valero also is a joint venture partner in Diamond Green Diesel, which operates a renewable diesel plant in Norco, Louisiana. Diamond Green Diesel is North America’s largest biomass-based diesel plant. Valero sells its products in the wholesale rack or bulk markets in the U.S., Canada, the U.K., Ireland and Latin America. Approximately 7,000 outlets carry Valero’s brand names.", "mission": "Not provided on Glassdoor"}, "Singapore Institute of Technology": {"company_name": "Singapore Institute of Technology", "company_code": 771198, "website": "www.singaporetech.edu.sg", "headquarters": "Singapore, Singapore", "size": "Unknown", "founded": "2009", "type": "College / University", "industry": "Colleges & Universities", "revenue": "Unknown / Non-Applicable", "employer_description": "Not provided on Glassdoor", "mission": "Not provided on Glassdoor"}, "Acer-Group": {"company_name": "Acer-Group", "company_code": 3802, "website": "www.acer-group.com", "headquarters": "New Taipei City, Taiwan", "size": "5001 to 10000 Employees", "founded": "Not provided on Glassdoor", "type": "Company - Public (ACER)", "industry": "Computer Hardware Development", "revenue": "$5 to $10 billion (USD)", "employer_description": "Acer has more than one PC brand up its sleeve. The company is a leading manufacturer of notebook, desktop, and netbook computers. Other Acer products include servers, storage systems, smartphones, projectors, LCD televisions, digital cameras, and computer displays. The company also provides IT support services, and its Acer eDC facility is the largest stand-alone data center in Asia. Acer, which outsources its manufacturing, sells through resellers and distributors worldwide. In addition to Acer-branded equipment, the company oversees the Gateway, eMachines, and Packard Bell brands. Acer generates nearly half of its sales in Europe.", "mission": "Not provided on Glassdoor"}, "Texas-Instruments": {"company_name": "Texas-Instruments", "company_code": 651, "website": "www.ti.com", "headquarters": "Dallas, United States", "size": "10000+ Employees", "founded": "1930", "type": "Company - Public (TXN)", "industry": "Electronics Manufacturing", "revenue": "$10+ billion (USD)", "employer_description": "Texas Instruments has been making progress possible for decades. We are a global semiconductor company that designs, manufactures, tests and sells analog and embedded processing chips. Our more than 80,000 products help over 100,000 customers efficiently manage power, accurately sense and transmit data and provide the core control or processing in their designs, going into markets such as industrial, automotive, personal electronics, communications equipment and enterprise systems. Our passion to create a better world by making electronics more affordable through semiconductors is alive today as each generation of innovation builds upon the last to make our technology smaller, more efficient, more reliable and more affordable – opening new markets and making it possible for semiconductors to go into electronics everywhere. We think of this as Engineering Progress. It’s what we do and have been doing for decades. TI is continually recognized as a 'best place to work' - offering a creative and friendly work environment, a variety of assignments, and extensive professional development & training opportunities. Come change the world with us. Visit careers.ti.com", "mission": "We're changing the world, one chip at a time. Our analog and embedded processing products power electronics across every industry and help to make the world smarter, safer, greener, healthier and more fun."}, "TikTok": {"company_name": "TikTok", "company_code": 2230881, "website": "www.tiktok.com", "headquarters": "Singapore, Singapore", "size": "1001 to 5000 Employees", "founded": "2016", "type": "Company - Private", "industry": "Internet & Web Services", "revenue": "Unknown / Non-Applicable", "employer_description": "TikTok is the leading destination for short-form mobile video. Our mission is to inspire creativity and bring joy. TikTok has global offices including Los Angeles, New York, London, Paris, Berlin, Dubai, Mumbai, Singapore, Jakarta, Seoul and Tokyo.", "mission": "Our mission is to inspire creativity and bring joy."}, "Uber": {"company_name": "Uber", "company_code": 575263, "website": "www.uber.com", "headquarters": "San Francisco, United States", "size": "10000+ Employees", "founded": "2009", "type": "Company - Public (UBER)", "industry": "Internet & Web Services", "revenue": "$10+ billion (USD)", "employer_description": "Uber’s mission is to reimagine the way the world moves for the better. We started in 2010 to solve a simple problem: how do you get access to a ride at the touch of a button? More than 34 billion trips later, we’re building products to get people closer to where they want to be. By changing how people, food, and things move through cities, Uber is a platform that opens up the world to new possibilities.We welcome people from all backgrounds who seek the opportunity to help build a future where everyone and everything can move independently. If you have the curiosity, passion, and collaborative spirit, work with us, and let’s move the world forward, together.", "mission": "We reimagine the way the world moves for the better."}, "Wells-Fargo": {"company_name": "Wells-Fargo", "company_code": 8876, "website": "www.wellsfargojobs.com/en/well-life/", "headquarters": "San Francisco, United States", "size": "10000+ Employees", "founded": "1852", "type": "Company - Public (WFC)", "industry": "Banking & Lending", "revenue": "$10+ billion (USD)", "employer_description": "Wells Fargo & Company (NYSE: WFC) is a diversified, community-based financial services company with $1.98 trillion in assets. Wells Fargo’s vision is to satisfy our customers’ financial needs and help them succeed financially. Founded in 1852 and headquartered in San Francisco, Wells Fargo provides banking, investment and mortgage products and services, as well as consumer and commercial finance, through 7,400 locations, more than 13,000 ATMs, the internet (wellsfargo.com) and mobile banking, and has offices in 31 countries and territories to support customers who conduct business in the global economy. With approximately 263,000 team members, Wells Fargo serves one in three households in the United States. Wells Fargo & Company was ranked No. 30 on Fortune’s 2020 rankings of America’s largest corporations. News, insights and perspectives from Wells Fargo are also available at Wells Fargo Stories. Additional information may be found at www.wellsfargo.com | Twitter: @WellsFargo.", "mission": "We have five primary values that are based on our vision and provide the foundation for everything we do:\r\n\r\nPeople as a competitive advantage\r\nEthics\r\nWhat’s right for customers\r\nDiversity and inclusion\r\nLeadership\r\n\r\nWe value and support our team members as a competitive ... Read more"}, "binance": {"company_name": "binance", "company_code": 1816824, "website": "www.binance.com", "headquarters": "Singapore, Singapore", "size": "5001 to 10000 Employees", "founded": "2017", "type": "Company - Private", "industry": "Internet & Web Services", "revenue": "$2 to $5 billion (USD)", "employer_description": "https://www.binance.com/  \rBinance is the world's no.1 crypto-currency exchange. \rWe provide access to hundreds of digital currency pairs on our leading exchange platform while maintaining security, liquidity and high-speed with some of the lowest costs in the industry at 0.1% or 0.05% by using our BNB coin.   \rWe strive to give our users access to some of the latest blockchain/DLT technologies with new cryptocurrencies being listed all the time. \rBinance stands for “Binary with Finance”, integrating digital technology with finance. Just as the name suggests, we are digital currency enthusiasts having more than 20 years of combined finance, security and development experience with top exchange platforms at companies including Tokyo Stock Exchange, Morgan Stanley, Accenture and other Top 100 companies all over the world.", "mission": "Not provided on Glassdoor"}, "Avanade": {"company_name": "Avanade", "company_code": 11701, "website": "www.avanade.com", "headquarters": "Seattle, United States", "size": "10000+ Employees", "founded": "2000", "type": "Company - Private", "industry": "Information Technology Support Services", "revenue": "$2 to $5 billion (USD)", "employer_description": "People who thrive at Avanade are motivated, interested in learning and want to be the best at what they do. If that sounds like you, you sound like us. We believe in making a genuine human impact in everything we do, through the power of our people and cutting-edge Microsoft technology. \rBring an open mind and we’ll show you a diverse community, proud of its culture that welcomes every individual. At Avanade, you'll find access to incredible clients, unparalleled training and an exciting career path, whether you're just starting out or you have decades of experience under your belt.\rWe have over 30,000 people working in more than 34 countries worldwide. Our people have helped thousands of clients transform their businesses, uncover ways technology can improve the way we work and live, and change the world for the better. \rAvanade was founded in 2000 by Accenture LLP and Microsoft Corporation, and is majority owned by Accenture. You can find out more at www.avanade.com/careers", "mission": "Avanade is the leading provider of innovative digital and cloud services, business solutions and design-led experiences for its clients, delivered through the power of people and the Microsoft ecosystem.\r\n\r\nOur values guide how we work and ultimately shape the experience for our ... Read more"}, "Honeywell": {"company_name": "Honeywell", "company_code": 28, "website": "www.honeywell.com", "headquarters": "Charlotte, United States", "size": "10000+ Employees", "founded": "1885", "type": "Company - Public (HON)", "industry": "Computer Hardware Development", "revenue": "$10+ billion (USD)", "employer_description": "Honeywell is a Fortune 100 company that invents and manufactures technologies to address tough challenges linked to global macrotrends such as safety, security, and energy. With approximately 100,000 employees worldwide, including more than 19,000 engineers and scientists, we have an unrelenting focus on quality, delivery, value, and technology in everything we make and do.", "mission": "Not provided on Glassdoor"}, "Devon-Energy": {"company_name": "Devon-Energy", "company_code": 839, "website": "www.devonenergy.com", "headquarters": "Oklahoma City, United States", "size": "5001 to 10000 Employees", "founded": "Not provided on Glassdoor", "type": "Company - Public (DVN)", "industry": "Energy & Utilities", "revenue": "$10+ billion (USD)", "employer_description": "Devon Energy Corporation is a leading independent oil and natural gas exploration and production company. Devon's operations are focused onshore in the United States and Canada. We also own natural gas pipelines and treatment facilities in many of our producing areas, making us one of North America's larger processors of natural gas liquids.\rThe company's portfolio of oil and gas properties provides stable, environmentally responsible production and a platform for future growth. Devon has nearly doubled its onshore North American oil production since 2008 and has a deep inventory of development opportunities to deliver future oil growth. Devon also produces about 2.3 billion cubic feet of natural gas a day — roughly 3 percent of all the gas consumed in North America.  \rHeadquartered in Oklahoma City, Devon is a Fortune 500 company and is included in the S&P 500 Index. Its common shares trade on the New York Stock Exchange under the ticker symbol DVN.", "mission": "Devon's mission and values create a strong foundation for the company.They represent the core beliefs upon which the company was built and are essential to its continuing success.\r\n\r\nDevon is a results-oriented oil and gas company that builds value for shareholders through our ... Read more"}, "Cisco-Systems": {"company_name": "Cisco-Systems", "company_code": 1425, "website": "www.cisco.com", "headquarters": "San Jose, United States", "size": "10000+ Employees", "founded": "1984", "type": "Company - Public (CSCO)", "industry": "Enterprise Software & Network Solutions", "revenue": "$10+ billion (USD)", "employer_description": "#WeAreCisco, where each person is unique. We bring our talents to work as a team each day, helping power an inclusive future for all. Here's how we do it. At Cisco, we embody transformation and help our customers excel in their digital worlds. Some may think we're \"old\" (36+ years strong!) and only about hardware, but we're also a software company, a security company, a blockchain company, and an AI/Machine Learning company. We even invented an intuitive network that adapts, predicts, learns, and protects. Our innovation never stops! Cisco values the perspectives and skillsets that arise from employees with diverse backgrounds. That's why Cisco is expanding the boundaries of discovering top talent by not only focusing on candidates with college degrees and experience but instead placing more emphasis on unlocking potential. As one of the leading forces in connecting the world, we understand our unique opportunity to bring communities together and create meaningful change for everyone, everywhere. That's why connecting starts within Cisco. Over 30,000 Cisconians participate in our Employee Resource Groups, called Inclusive Communities, where we network, learn to be informed allies, and help make a difference. Cisco didn't just build the Internet. We keep building it. And while our technology helps connect the unconnected, that's not where our edge comes from. It comes from our people—unique, innovative, and diverse. Be you, with us!", "mission": "Cisco wants you to bring your uniqueness, join teams to solve challenges, and work together to build an inclusive future for all with our technology! #WeAreCisco"}, "Airbnb": {"company_name": "Airbnb", "company_code": 391850, "website": "www.airbnb.com", "headquarters": "San Francisco, United States", "size": "5001 to 10000 Employees", "founded": "2008", "type": "Company - Public (ABNB)", "industry": "Internet & Web Services", "revenue": "Unknown / Non-Applicable", "employer_description": "Founded in August of 2008 and based in San Francisco, California, Airbnb is a trusted community marketplace for people to list, discover, and book unique accommodations around the world — online or from a mobile phone.\rWhether an apartment for a night, a castle for a week, or a villa for a month, Airbnb connects people to unique travel experiences, at any price point, in more than 34,000 cities and 192 countries. And with world-class customer service and a growing community of users, Airbnb is the easiest way for people to monetize their extra space and showcase it to an audience of millions.", "mission": "Not provided on Glassdoor"}, "Fujitsu": {"company_name": "Fujitsu", "company_code": 3524, "website": "www.fujitsu.com", "headquarters": "Tokyo, Japan", "size": "10000+ Employees", "founded": "1935", "type": "Company - Public (FJTSY)", "industry": "Enterprise Software & Network Solutions", "revenue": "$5 to $10 billion (USD)", "employer_description": "As a global ICT company, Fujitsu touches the lives of millions of people every day through our technology and solutions. From enabling airline bookings and issuing driving licenses to facilitating banking transactions, high street shopping and much more.\rExplore the variety of jobs available at Fujitsu and take your chance to shape your future at our company. What can we offer you? Fujitsu attracts and retains the best people by providing an exciting working environment where collaboration, customer focus and the passion to achieve results make the difference. Furthermore, we offer ideal start and development opportunities for junior and senior employees. Fujitsu is committed to the development of a diverse workforce. Therefore applications for employment are considered irrespective of gender, ethnic origin, race, faith or sexual orientation.\rAre you ready to shape tomorrow with us?", "mission": "Our vision is to work with our clients from around the world, across many different sectors, to create new business value and help drive a more prosperous and sustainable future for society.  In a time increasingly shaped by digital technology, we are also helping our clients to ... Read more"}, "Phillips-66": {"company_name": "Phillips-66", "company_code": 498821, "website": "www.phillips66.com", "headquarters": "Houston, United States", "size": "10000+ Employees", "founded": "2012", "type": "Company - Public (PSX)", "industry": "Energy & Utilities", "revenue": "$10+ billion (USD)", "employer_description": "With more than 140 years of experience, we are well-positioned to help fulfill global energy needs. We are a diversified energy manufacturing and logistics company with unique businesses in Refining, Midstream, Chemicals and Marketing and Specialties. For more information, visit www.phillips66.com or follow us on Twitter @Phillips66Co.", "mission": "Providing Energy. Improving Lives.\n\nWe are excited about the future of energy. Our advantaged and nimble company is full of seasoned leadership and talented people making responsible choices to adapt and explore the opportunities the changing market brings.\n\nWe do this while ... Read more"}, "GovTech": {"company_name": "GovTech", "company_code": 1371268, "website": "www.tech.gov.sg", "headquarters": "Singapore, Singapore", "size": "1001 to 5000 Employees", "founded": "2016", "type": "Government", "industry": "National Services & Agencies", "revenue": "Unknown / Non-Applicable", "employer_description": "We use technology to improve the lives of everyday Singaporeans – tackling real-world problems of transport, housing, security, healthcare, and the environment. We are working hard every day to design and build solutions that will make a difference to the citizens and businesses. It thrills us to know that our work can impact lives.\rWe need people who share the same excitement and passion – individuals who are excited about building the Government Tech Stack, and developing meaningful products, platforms, and solutions for the public good.\rAgile. Bold. Collaborative. We are growing in ways we may never have predicted. We are challenging ourselves to innovate. We are seeking collaborators to co-create. Join us, and help build the next impactful solution for our citizens and businesses.", "mission": "Engineering Digital Government. Making Lives Better."}, "Autodesk": {"company_name": "Autodesk", "company_code": 1155, "website": "www.autode.sk/autodesklife", "headquarters": "San Francisco, United States", "size": "10000+ Employees", "founded": "1982", "type": "Company - Public (ADSK )", "industry": "Enterprise Software & Network Solutions", "revenue": "$2 to $5 billion (USD)", "employer_description": "Autodesk makes software for people who make things.  If you’ve ever driven a high-performance car, admired a towering skyscraper, used a smartphone, or watched a great film, chances are you’ve experienced what millions of Autodesk customers are doing with our software. Autodesk gives you the power to make anything.  \rAutodesk is consistently named a Great Place to Work&reg;, globally.  We provide exceptional compensation/benefit packages and we’d love for you to join us. We’re proud to be an equal opportunity employer and we consider all qualiﬁed applicants without regard to race, gender, disability, veteran status or other protected category.  To see our culture in action, check out #AutodeskLife.", "mission": "Our vision is to help people imagine, design, and create a better world.\r Our mission is to deliver products and services that enable the Future of Making Things."}, "American Express": {"company_name": "American Express", "company_code": 35, "website": "www.americanexpress.com", "headquarters": "New York, United States", "size": "10000+ Employees", "founded": "1850", "type": "Company - Public (AXP)", "industry": "Financial Transaction Processing", "revenue": "$10+ billion (USD)", "employer_description": "With the right backing, people and businesses have the power to progress in incredible ways. When you join Team Amex, you become part of a global and diverse community of colleagues with an unwavering commitment to back our customers, communities and each other. Here, you’ll learn and grow as we help you create a career journey that’s unique and meaningful to you with benefits, programs, and flexibility that support you personally and professionally.At American Express, you’ll be recognized for your contributions, leadership, and impact—every colleague has the opportunity to share in the company’s success. Together, we’ll win as a team, striving to uphold our company values and powerful backing promise to provide the world’s best customer experience every day. And we’ll do it with the utmost integrity, and in an environment where everyone is seen, heard and feels like they belong.Join Team Amex and let’s lead the way together.Check out the recent awards we’re proud of:• #8 on FORTUNE 100 Best Companies to Work For - 2022• Human Rights Campaign Corporate Equality Index Score of 100% (since 2004)- 2022• Forbes America's Best Employers for Diversity - 2022• Seramount 100 Best Companies - 2022• FORTUNE World’s Most Admired Companies - 2022• #3 on FORTUNE 100 Best Large Workplaces in New York - 2022• Fast Company's 2022 Finance Brands That Matter", "mission": "Become essential to our customers by providing differentiated products and services to help them achieve their aspirations."}, "PCA": {"company_name": "PCA", "company_code": 9610, "website": "www.packagingcorp.com", "headquarters": "Lake Forest, United States", "size": "10000+ Employees", "founded": "1955", "type": "Company - Public (PKG)", "industry": "Wood & Paper Manufacturing", "revenue": "$5 to $10 billion (USD)", "employer_description": "PCA is the third largest producer of containerboard in the United States and the third largest producer of uncoated freesheet in North America, based on production capacity. PCA’s Packaging segment includes six containerboard mills and 93 converting operations. In 2019, PCA produced about 4.2 million tons of containerboard and shipped about 59.4 billion square feet (BSF) of corrugated products. PCA’s Paper segment operates under the trade name Boise Paper, a Division of Packaging Corporation of America. We manufacture and sell white papers, including both commodity and specialty papers. PCA combines great products with a creative and knowledgeable total-service team to provide ideas and solutions for any packaging need. When you choose Packaging Corporation of America, you work with people who do the right things for each other and for our customers. We believe in utilizing the power of strong collaborative relationships, bound by the trust we have earned, to deliver innovative packaging solutions and an outstanding service experience.", "mission": "The cornerstone of our business is the strong relationship between our customers and our PEOPLE. Our success is made possible by a highly engaged, results-oriented workforce operating in an entrepreneurial culture.\n\nOur simple rule at PCA is: We do the \"hard to do.” We do what’s ... Read more"}, "Visa": {"company_name": "Visa", "company_code": 3035, "website": "www.visa.com", "headquarters": "Foster City, United States", "size": "10000+ Employees", "founded": "1958", "type": "Company - Public (V)", "industry": "Information Technology Support Services", "revenue": "$10+ billion (USD)", "employer_description": "Not provided on Glassdoor", "mission": "Not provided on Glassdoor"}, "Riot-Gamees": {"company_name": "Riot-Gamees", "company_code": 247538, "website": "www.riotgames.com", "headquarters": "Los Angeles, United States", "size": "1001 to 5000 Employees", "founded": "2006", "type": "Company - Private", "industry": "Video Game Publishing", "revenue": "Unknown / Non-Applicable", "employer_description": "Riot Games was founded in 2006 by Brandon Beck and Marc Merrill with the intent to change the way video games are made and supported for players. In 2009, Riot released its debut title League of Legends to worldwide acclaim. The game has since gone on to become the most played PC game in the world and a key driver of the explosive growth of esports. Players are the foundation of our community and it’s for them we continue to evolve and improve the League of Legends experience. Riot Games is headquartered in Los Angeles, CA and has 23 offices worldwide. Riot was featured on Fortune’s 100 Best Companies to Work For list in 2016. Riot also ranked on Fortune's \"25 Best Companies to Work for in Technology\", \"100 Best Workplaces for Millennials\", and \"50 Best Workplaces for Flexibility\" lists, accolades based on Glassdoor reviews of Riot by Rioters.", "mission": "Riot aspires to be the most player-focused company in the world."}, "Zoom": {"company_name": "Zoom", "company_code": 924644, "website": "zoom.us/", "headquarters": "San Jose, United States", "size": "5001 to 10000 Employees", "founded": "2011", "type": "Company - Public (ZM)", "industry": "Information Technology Support Services", "revenue": "$2 to $5 billion (USD)", "employer_description": "Zoomies help people stay connected so they can get more done together. We set out on a mission to make video communications frictionless and secure by building the world’s best video product for the enterprise, but we didn’t stop there. With products like Zoom Contact Center, Zoom Phone, Zoom Events, Zoom Apps, Zoom Rooms, and Zoom Webinar, we bring innovation to a wide variety of customers, from the conference room to the classroom, from doctor’s offices to financial institutions to government agencies, from global brands to small businesses.We do what we do because of our core value of Care: care for our community, our customers, our company, our teammates, and ourselves. Our global employees help our customers meet happier, communicate better, and create meaningful connections the world over. Zoomies are problem-solvers and self-starters, working hard to get results and moving quickly to design solutions with our customers and users in mind. Here, you’ll work across teams to dig deep into impactful projects that are changing the way people communicate, and find room to grow with opportunities to stretch your skills and advance your career in a diverse, inclusive environment. Learn more about careers at Zoom by visiting our careers site: https://careers.zoom.us/home", "mission": "Founded in 2011, Zoom's mission is to develop people-centric cloud services that transforms the real-time collaboration experience and improves the quality and effectiveness of communications forever. We deliver happiness."}, "Netflix": {"company_name": "Netflix", "company_code": 11891, "website": "www.netflix.com", "headquarters": "Los Gatos, United States", "size": "5001 to 10000 Employees", "founded": "1997", "type": "Company - Public (NFLX)", "industry": "Internet & Web Services", "revenue": "$5 to $10 billion (USD)", "employer_description": "Netflix is the world's leading streaming entertainment service with 193 million paid memberships in over 190 countries enjoying TV series, documentaries and feature films across a wide variety of genres and languages. Members can watch as much as they want, anytime, anywhere, on any internet-connected screen. Members can play, pause and resume watching, all without commercials or commitments.", "mission": "Not provided on Glassdoor"}, "Singapore-Management-University": {"company_name": "Singapore-Management-University", "company_code": 342146, "website": "www.smu.edu.sg", "headquarters": "Singapore, Singapore", "size": "201 to 500 Employees", "founded": "2000", "type": "College / University", "industry": "Colleges & Universities", "revenue": "$100 to $500 million (USD)", "employer_description": "Singapore Management University is a place where high-level professionalism blends together with a healthy informality. The 'family-like' atmosphere among the SMU community fosters a culture where employees work, plan, organise and play together – building a strong collegiality and morale within the university.Our commitment to attract and retain talent is ongoing. We offer attractive benefits and welfare, competitive compensation packages, and generous professional development opportunities – all to meet the work-life needs of our staff. No wonder, then, that SMU continues to be given numerous awards and recognition for its human resource excellence.", "mission": "Not provided on Glassdoor"}, "WM": {"company_name": "WM", "company_code": 2094, "website": "www.wm.com", "headquarters": "Houston, United States", "size": "10000+ Employees", "founded": "1971", "type": "Company - Public (WM)", "industry": "Building & Personnel Services", "revenue": "$10+ billion (USD)", "employer_description": "Waste Management (WM), a Fortune 250 company, is North America's largest environmental solutions provider and recycler. WM serves over 20 million customers in residential, commercial, industrial and municipal markets throughout North America through a network of collection operations, transfer stations, landfills, recycling facilities and waste-based energy production projects.Waste Management is also a renewable energy provider, producing enough electricity to power more than one million homes. One of the ways we do this is by recovering the naturally occurring gas inside our landfills to generate electricity, called landfill-gas-to-energy. By the end of 2018, we operated 130 beneficial-use landfill-gas facilities, operated 7,944 alternative fuel vehicles, had 255 habitat, species and education programs ‘on-the-ground’, and donated over $14M to charitable foundations and programs.Today, we're changing waste collection, creating alternative fuels, and forging a more sustainable tomorrow for all of us.", "mission": "We have made commitments to sustainability that help drive our business. By 2038, we plan to offset four times the GHG emissions we generate through our operations. We also aim to help make communities in which we live and work safe, resilient and sustainable by concentrating on ... Read more"}, "Chesapeake-Energy": {"company_name": "Chesapeake-Energy", "company_code": 906, "website": "www.chk.com/", "headquarters": "Oklahoma City, United States", "size": "1001 to 5000 Employees", "founded": "1989", "type": "Company - Public (CHK)", "industry": "Energy & Utilities", "revenue": "$1 to $5 million (USD)", "employer_description": "Founded in 1989, Chesapeake discovers and responsibly develops leading positions in three top U.S. oil and gas plays: the Eagle Ford, Haynesville and Marcellus Shales.Chesapeake is based out of Oklahoma City — arguably the industry's biggest \"small town\" and homebase to notable natural gas and oil companies. To reinforce our entrepreneurial and collaborative spirit and the area's superior quality of life, Chesapeake leaders developed a corporate campus that encourages teamwork with dedicated space for innovation (meet our Reservoir Technology Center as an example). Employees also enjoy a number of on-campus benefits, including a restaurant, fitness center and best-in-class childcare, which promote productivity and retention.Our corporate headquarters also supports field offices in Louisiana, Pennsylvania and Texas.​", "mission": "Not provided on Glassdoor"}, "PayPal": {"company_name": "PayPal", "company_code": 9848, "website": "www.paypal.com", "headquarters": "San Jose, United States", "size": "10000+ Employees", "founded": "1998", "type": "Company - Public (PYPL)", "industry": "Internet & Web Services", "revenue": "$10+ billion (USD)", "employer_description": "At PayPal, we believe that now is the time to democratize financial services so that moving and managing money is a right for all citizens, not just the affluent. We are driven by this purpose, and we uphold our cultural values of collaboration, innovation, wellness and inclusion as our guide for making decisions and conducting business every day. It is our duty and privilege to be customer champions and put those we serve at the center of everything we do.\rWe are one team that respects and values diversity of thought for everyone, everywhere, and we actively seek to create an energizing workplace that brings out the best in all of us. If you’re ready to shape the future of money, join the team at PayPal. We're proud to work here. You will be too.", "mission": "At PayPal (Nasdaq: PYPL),  we put people at the center of everything we do. Founded in 1998, we continue to be at the forefront of the digital payments revolution, last year we processed 4 billion payments, of which 1 billion were made on mobile devices. PayPal gives people ... Read more"}, "ShopBack": {"company_name": "ShopBack", "company_code": 1169892, "website": "corporate.shopback.com/", "headquarters": "Singapore, Singapore", "size": "501 to 1000 Employees", "founded": "2014", "type": "Company - Private", "industry": "Internet & Web Services", "revenue": "Unknown / Non-Applicable", "employer_description": "ShopBack was born one night when Henry and Joel (co-founders) were toying around (with entrepreneurial ideas) in Henry's car. The discussion led to the idea of devising a smarter way to spend, starting with the concept of giving online Cashback. Built on a strong foundation of multiple failures and iterations, ShopBack has now scaled to 9 countries in less than 7 years, paving The Smarter Way for shoppers across the region.Today, ShopBack is the dominant player in the Southeast Asia ecommerce Cashback market, with established presence in Singapore, Malaysia, Indonesia, Philippines, Taiwan, Thailand,  Australia, and more recently, Vietnam and Korea - partnering with over 10,000 merchants, both online and in-store.In 2022, ShopBack launched ShopBack Pay and PayLater, extending the platform's offerings into financial services, providing shoppers responsible and convenient payment options at checkout.Keen to transform the e-commerce landscape with us?  Check out our available openings at: https://careers.shopback.com", "mission": "ShopBack: For the wins"}, "Nokia": {"company_name": "Nokia", "company_code": 3494, "website": "www.nokia.com", "headquarters": "Espoo, Finland", "size": "10000+ Employees", "founded": "1865", "type": "Company - Public (NOK)", "industry": "Telecommunications Services", "revenue": "$10+ billion (USD)", "employer_description": "Join us in creating the technology that helps the world act together.We are a B2B technology innovation leader pioneering the future where networks meet cloud.At Nokia you will have a positive impact on people’s lives and help build the capabilities needed for a more productive, sustainable, and accessible world. Be part of a culture built on an inclusive way of working where we are open to your ideas, you are empowered to take risks and are encouraged to be fearless in bringing your authentic self to work.  www.nokia.com/careers", "mission": "We create the critical networks and technologies to bring together the world’s intelligence, across businesses, cities, supply chains and societies."}, "Eastman": {"company_name": "Eastman", "company_code": 2452, "website": "www.eastman.com", "headquarters": "Kingsport, United States", "size": "10000+ Employees", "founded": "1920", "type": "Company - Public (EMN)", "industry": "Chemical Manufacturing", "revenue": "$5 to $10 billion (USD)", "employer_description": "Founded in 1920, Eastman is a global specialty materials company that produces a broad range of products found in items people use every day. With the purpose of enhancing the quality of life in a material way, Eastman works with customers to deliver innovative products and solutions while maintaining a commitment to safety and sustainability. The company's innovation-driven growth model takes advantage of world-class technology platforms, deep customer engagement, and differentiated application development to grow its leading positions in attractive end-markets such as transportation, building and construction, and consumables. As a globally inclusive and diverse company, Eastman employs approximately 14,000 people around the world and serves customers in more than 100 countries. The company had 2021 revenues of approximately $10.5 billion and is headquartered in Kingsport, Tennessee, USA.Eastman fosters a culture of inclusion and diversity, steeped in collaboration and team member involvement. The company provides competitive compensation and benefits through a performance-driven culture, determined to attract, retain, reward, and engage world-class employees.  And to provide a healthy work-life balance, Eastman also provides services that address the entire continuum of your health and safety. With a focus on lifestyle, recreation, condition management, and preventative care, there are plenty of opportunities for employees to find programs to meet their individual needs and actively manage their health.  At Eastman, we work hard at having the right people, with the right skills, working on the right things, in the right environment. To do that, the company invests in individual growth through training, mentorship, and development opportunities.    For more information, visit www.eastman.com.", "mission": "Our Purpose: To enhance the quality of life in a material way."}, "Jetstar-Airways": {"company_name": "Jetstar-Airways", "company_code": 405259, "website": "www.jetstar.com", "headquarters": "Collingwood, Australia", "size": "5001 to 10000 Employees", "founded": "2004", "type": "Subsidiary or Business Segment", "industry": "Airlines, Airports & Air Transportation", "revenue": "$2 to $5 billion (USD)", "employer_description": "Not provided on Glassdoor", "mission": "Not provided on Glassdoor"}, "Morgan Stanley": {"company_name": "Morgan Stanley", "company_code": 2282, "website": "www.morganstanley.com", "headquarters": "New York, United States", "size": "10000+ Employees", "founded": "1935", "type": "Company - Public (MS)", "industry": "Investment & Asset Management", "revenue": "$10+ billion (USD)", "employer_description": "Morgan Stanley mobilizes capital to help governments, corporations, institutions and individuals around the world achieve their financial goals. For over 85 years, the firm’s reputation for using innovative thinking to solve complex problems has been well earned and rarely matched. A consistent industry leader throughout decades of dramatic change in modern finance, Morgan Stanley will continue to break new ground in advising, serving and providing new opportunities for its clients. Morgan Stanley is committed to maintaining the first-class service and high standard of excellence that have always defined the firm. At its foundation are five core values — putting clients first, doing the right thing, leading with exceptional ideas, committing to diversity and inclusion, and giving back — that guide its more than 80,000 employees in 1,200 offices across 41 countries.Discover what makes Morgan Stanley such a great place to work by using the resources on this page to learn more about our people, our business, and our heritage.", "mission": "Not provided on Glassdoor"}, "CSX": {"company_name": "CSX", "company_code": 124, "website": "www.csx.com", "headquarters": "Jacksonville, United States", "size": "10000+ Employees", "founded": "1978", "type": "Company - Public (CSX)", "industry": "Rail Transportation", "revenue": "Unknown / Non-Applicable", "employer_description": "CSX is a company on the move. As the nation’s best run railroad, we’re redefining freight rail with a progressive vision and real results – setting new industry performance standards and building a force of highly skilled professionals who are energized to help us move the economy safely, efficiently and reliably.Headquartered in Jacksonville, Fla., the CSX transportation network extends about 21,000 route miles, connecting customers to major ports, distribution centers, and every major metropolitan area in the eastern United States. When customers need comprehensive rail solutions, CSX is powered to perform.", "mission": "To be the best run railroad in North America."}, "Suncor": {"company_name": "Suncor", "company_code": 6818, "website": "www.suncor.com", "headquarters": "Calgary, Canada", "size": "10000+ Employees", "founded": "1967", "type": "Company - Public (SU)", "industry": "Energy & Utilities", "revenue": "$10+ billion (USD)", "employer_description": "Suncor Energy (U.S.A.) Inc. is a wholly-owned subsidiary of Suncor Energy Inc., an integrated energy company based in Calgary, Canada. We want you to have rewarding opportunities for you to apply your knowledge, contribute and grow in a variety of career-building positions. Our business portfolio spans the entire energy sector, from a leadership position in oil sands development, to refining and marketing operations, natural gas, and conventional oil production, internationally and offshore East Coast Canada.\rAnd while we are working to responsibly develop petroleum resources and contribute to the communities where we live and work, we are also developing our renewable energy portfolio, which includes wind power and biofuels.\rSuncor’s downstream business operates four refineries including the Commerce City refinery, the only petroleum refinery in the area and one of the largest in the Rocky Mountain region.", "mission": "At Suncor we have a mission - to create energy for a better world - that defines our core purpose and helps to direct our actions and activities. We have a vision that describes our view of the future and our place in it. Our values are a set of beliefs that guide our behaviour ... Read more"}, "3M": {"company_name": "3M", "company_code": 446, "website": "www.3m.com", "headquarters": "Saint Paul, United States", "size": "10000+ Employees", "founded": "1902", "type": "Company - Public (MMM)", "industry": "Consumer Product Manufacturing", "revenue": "$10+ billion (USD)", "employer_description": "At 3M, you can apply your talent in bold ways that matter. As one of the world’s leading companies, we have the best and brightest working to advance more than their own career. They're working to advance the entire world.", "mission": "Not provided on Glassdoor"}, "Klook": {"company_name": "Klook", "company_code": 1907040, "website": "klookcareers.com/homepage", "headquarters": "Hong Kong, Hong Kong", "size": "1001 to 5000 Employees", "founded": "2014", "type": "Company - Private", "industry": "Travel Agencies", "revenue": "Unknown / Non-Applicable", "employer_description": "Klook is the leading travel & leisure e-commerce platform for experiences and services anytime, anywhere. We curate the most joyful experiences so that users can satisfy their relentless curiosity for adventure and experiences at home and around the world. With our website & app, users can experience a world of joy, from attractions, tours to local transportation and stays. Founded in 2014, we are here to inspire and enable more moments of joy through 490,000+ activities in 1,000+ destinations.Join us in reimagining the world of travel today! Learn more about us and our current openings here: https://klookcareers.com", "mission": "Klook exists to inspire and enable more moments of joy for people around the world."}, "Wise": {"company_name": "Wise", "company_code": 637715, "website": "www.wise.com", "headquarters": "London, United Kingdom", "size": "1001 to 5000 Employees", "founded": "2011", "type": "Company - Public", "industry": "Financial Transaction Processing", "revenue": "Unknown / Non-Applicable", "employer_description": "In the words of our founder, ‘people don’t join a company. They join a mission’. And ours is big. Current banking systems don’t let us send, spend or receive money across borders easily. Or quickly. Or cheaply. So we’re building a new one.Our mission is to make money without borders the new normal. We won’t stop until everyone can send, spend and receive money wherever they are, in any currency. But we can’t do it alone. We’re growing incredibly fast and there’s still lots to get done.Visit wise.jobs to join us. This is just the beginning.", "mission": "Money without borders - instant, convenient, transparent and eventually free. We’re powering money for people and businesses in their increasingly global lives - to pay, to get paid, to spend, in any currency, wherever you are, whatever you’re doing."}, "Revolut": {"company_name": "Revolut", "company_code": 1176471, "website": "www.revolut.com", "headquarters": "London, United Kingdom", "size": "5001 to 10000 Employees", "founded": "2015", "type": "Company - Private", "industry": "Financial Transaction Processing", "revenue": "Unknown / Non-Applicable", "employer_description": "We started Revolut in 2015 with a bold goal — to turn the financial world upside down. We are now building the first truly global financial platform, a superapp that is just as progressive as today’s hyperconnected world. Fee-free spending, currency exchange, international transfers, free ATM withdrawals, personal loans, insurance, cryptocurrency, stocks trading, budgeting control tools and much more. Our 2,500+ team caters for more than 15 million customers around the world. We have teams in London, Krakow, New York, Porto, Vilnius, Milan, Berlin, Moscow, Saint Petersburg, Singapore, Japan & much more. Join us now and become a part of this amazing adventure.", "mission": "Not provided on Glassdoor"}, "NetApp": {"company_name": "NetApp", "company_code": 5406, "website": "www.netapp.com", "headquarters": "San Jose, United States", "size": "10000+ Employees", "founded": "1992", "type": "Company - Public (NTAP)", "industry": "Enterprise Software & Network Solutions", "revenue": "$5 to $10 billion (USD)", "employer_description": "NetApp is a global cloud-led, data-centric software company that empowers organizations to lead with data in the age of accelerated digital transformation. The company provides systems, software, and cloud services that enable them to run their applications optimally from data center to cloud, whether they are developing in the cloud, moving to the cloud, or creating their own cloudlike experiences on-premises. With solutions that perform across diverse environments, NetApp helps organizations build their own data fabric and securely deliver the right data, services, and applications to the right people—anytime, anywhere. Learn more at www.netapp.com", "mission": "Not provided on Glassdoor"}, "ASUS": {"company_name": "ASUS", "company_code": 40093, "website": "www.asus.com", "headquarters": "Taipei, Taiwan", "size": "10000+ Employees", "founded": "1989", "type": "Company - Public (AKCIF)", "industry": "Computer Hardware Development", "revenue": "$10+ billion (USD)", "employer_description": "Not provided on Glassdoor", "mission": "Not provided on Glassdoor"}, "State-Street": {"company_name": "State-Street", "company_code": 1911, "website": "www.statestreet.com", "headquarters": "Boston, United States", "size": "10000+ Employees", "founded": "1792", "type": "Company - Public (STT)", "industry": "Investment & Asset Management", "revenue": "$10+ billion (USD)", "employer_description": "From technology and product innovation to corporate responsibility and community development, we’re making our mark on the financial services industry. For more than two centuries, we’ve been helping our clients safeguard and steward the investments of millions of people – strengthening markets, building communities and creating opportunities for growth.\rWe owe that longevity to the commitment, expertise and creativity of our employees. Our continued success depends on our ability to attract and develop the best talent in the industry. That’s why we’re keenly focused on employee development, corporate citizenship and inclusion.\rFor us, success comes in the mark we make as an organization – for the industry, our clients, our communities and each other.\rLearn more:\r- http://www.statestreet.com/about.html\r- http://listen.statestreet.com/", "mission": "At State Street, inclusion and diversity are embedded in our values and culture.  We know that an inclusive culture and a diverse workforce make us stronger and more successful.  In a fast-paced and evolving world, we make it a priority to ensure that all of our employees across ... Read more"}, "O-I-Glass": {"company_name": "O-I-Glass", "company_code": 2129, "website": "www.o-i.com", "headquarters": "Perrysburg, United States", "size": "10000+ Employees", "founded": "1903", "type": "Company - Public (OI)", "industry": "Metal & Mineral Manufacturing", "revenue": "$5 to $10 billion (USD)", "employer_description": "Remember the last time you opened a bottle of champagne, a cold beer after a hard day's work, or a bottle of sparkling water to quench your thirst? Well, it was probably made by O-I. We love glass and we're proud to make more of it than any other glass bottle or jar producer in the world. What matters to you at work? Maybe it's building skills, making friends or creating something tangible. It might be working with big name customers or smaller craft businesses, contributing to society, or making a difference in a sustainable industry. Whatever it is, you can do any and all of it at O-I. We are masters of glass. With us, you can be part of producing and branding something pure, healthy, and infinitely recyclable. And, as we remain open to new possibilities and ways of working, you can also be part of creating a better, more exciting future, for yourself, your colleagues, our business, and the plant. O-I operates 72 plants in 20 countries, with over 25,000 talented people around the world. And, together we Make What Matters.", "mission": "We will be the most innovative, sustainable, and chosen supplier of brand-building packaging solutions."}, "Alibaba-Group": {"company_name": "Alibaba-Group", "company_code": 225974, "website": "www.alibabagroup.com", "headquarters": "Hangzhou, China", "size": "1001 to 5000 Employees", "founded": "Not provided on Glassdoor", "type": "Company - Public (BABA)", "industry": "Computer Hardware Development", "revenue": "$10+ billion (USD)", "employer_description": "Not provided on Glassdoor", "mission": "Not provided on Glassdoor"}, "Broadcom": {"company_name": "Broadcom", "company_code": 6926, "website": "www.broadcom.com", "headquarters": "San Jose, United States", "size": "10000+ Employees", "founded": "1991", "type": "Company - Public (BRCM)", "industry": "Electronics Manufacturing", "revenue": "$10+ billion (USD)", "employer_description": "Broadcom harbors broad ambitions for its semiconductors' impact on broadband communications: it wants them to drive every part of the high-speed wired and wireless networks of the future. The core applications for its integrated circuits (ICs) are digital set-top boxes, cable modems, servers, and networking gear for homes and offices. Broadcom also makes semiconductors for carrier access, DSL, and wireless communications equipment, including mobile phones. Customers include Apple (13% of sales), Samsung Electronics (10% of sales) Cisco, Dell, Hewlett-Packard, LG, and Nokia.", "mission": "Not provided on Glassdoor"}, "Norfolk-Southern": {"company_name": "Norfolk-Southern", "company_code": 483, "website": "www.norfolksouthern.com/content/nscorp/en.html", "headquarters": "Atlanta, United States", "size": "10000+ Employees", "founded": "1982", "type": "Company - Public (NSC)", "industry": "Rail Transportation", "revenue": "$10+ billion (USD)", "employer_description": "Norfolk Southern is a Fortune 300 and a 2018 Forbes America's Best Employers Company.\rIts main subsidiary, Norfolk Southern Railway, transports freight over an asset network consisting 4,000 locomotives, 69,000 rail cars, and 19,500 track miles in 22 states in the Eastern, Southeastern, and Midwestern US and in Canada (Ontario and Quebec). The rail system is made up of more than 14,700 route miles owned by Norfolk Southern and nearly 4,700 route miles of trackage rights, which allows NS to use tracks owned by other railroads. \rNorfolk Southern transports coal and general merchandise, including; automotive products, chemicals, metals, agriculture and forest products.  NS offers an extensive intermodal (freight transportation by a combination of train and truck) network and is strategically located at all major eastern US river, Atlantic, and Gulf ports.", "mission": "Our vision is to be the safest, most customer-focused, and successful transportation company in the world."}, "Singapore-Airlines": {"company_name": "Singapore-Airlines", "company_code": 3379, "website": "www.singaporeair.com", "headquarters": "Singapore, Singapore", "size": "10000+ Employees", "founded": "1972", "type": "Company - Public (C6L)", "industry": "Airlines, Airports & Air Transportation", "revenue": "$10+ billion (USD)", "employer_description": "For people in Singapore, traveling far means traveling by air, and that means Singapore Airlines (SIA). The carrier flies to about 65 cities in some 30 countries, primarily in the Asia/Pacific region but also in Europe and North America. It boasts a fleet of more than 100 aircraft. SIA extends its network via code-sharing with fellow members of the Star Alliance marketing partnership, including United Airlines and Air China. (Code-sharing allows airlines to sell tickets on one another's flights and thus offer service to additional destinations.) The government of Singapore, through Temasek Holdings, owns about 55% of SIA.", "mission": "Not provided on Glassdoor"}, "MediaTek": {"company_name": "MediaTek", "company_code": 40142, "website": "www.mediatek.com", "headquarters": "Hsinchu, Taiwan", "size": "10000+ Employees", "founded": "1997", "type": "Company - Public (2454)", "industry": "Electronics Manufacturing", "revenue": "$5 to $10 billion (USD)", "employer_description": "MediaTek is a pioneering fabless semiconductor company, and a market leader in cutting-edge systems on a chip for wireless communications, HDTV, DVD and Blu-ray. MediaTek created the world's first octa-core smartphone platform with LTE and our CorePilot technology released the full power of multi-core mobile processors. MediaTek [TSE:2454] is headquartered in Taiwan and has offices worldwide, including across Europe, the US, the Middle East and Asia.\rhttps://www.youtube.com/watch?v=t7Zt19jeUPg", "mission": "Our Mission: Enhance and enrich everyone’s life.\rOur Vision: MediaTek strives to be a global operation and technology leading company, enabling customer success with the most innovative products and services."}, "Alaska-Airlines": {"company_name": "Alaska-Airlines", "company_code": 19, "website": "careers.alaskaair.com", "headquarters": "Seattle, United States", "size": "10000+ Employees", "founded": "1932", "type": "Company - Public (ALK)", "industry": "Airlines, Airports & Air Transportation", "revenue": "$5 to $10 billion (USD)", "employer_description": "Alaska Airlines is the airline that cares. Since 1932, care has been in our DNA, and we embrace it whenever—and wherever—we can, through care for our team, our guests, our communities and our earth. As the only West-Coast based airline, we offer more nonstop flights from our five hubs than any other airline.  Whether you’re a first-time or MVP frequent flier, prospective talent or tenured colleague, our priority is your happiness and safety, on the ground and in the skies. The Airline That Cares!", "mission": "The most care in the air starts here! Whether we’re fueling career pathways and increasing representation, accelerating innovation and setting meaningful sustainability goals, we are committed to caring for our employees, our guests, our communities and our planet."}, "crypto-com": {"company_name": "crypto-com", "company_code": 1984553, "website": "www.crypto.com", "headquarters": "Singapore, Hong Kong", "size": "1001 to 5000 Employees", "founded": "2016", "type": "Company - Private", "industry": "Internet & Web Services", "revenue": "Unknown / Non-Applicable", "employer_description": "Not provided on Glassdoor", "mission": "Not provided on Glassdoor"}, "Twilio": {"company_name": "Twilio", "company_code": 410790, "website": "www.twilio.com", "headquarters": "San Francisco, United States", "size": "5001 to 10000 Employees", "founded": "2008", "type": "Company - Public (TWLO)", "industry": "Internet & Web Services", "revenue": "$2 to $5 billion (USD)", "employer_description": "Twilio powers the future of business communications. Enabling phones, VoIP, and messaging to be embedded into web, desktop, and mobile software.", "mission": "Not provided on Glassdoor"}, "hp": {"company_name": "hp", "company_code": 1093161, "website": "jobs.hp.com", "headquarters": "Palo Alto, United States", "size": "10000+ Employees", "founded": "1939", "type": "Company - Public (HPQ)", "industry": "Computer Hardware Development", "revenue": "Unknown / Non-Applicable", "employer_description": "Since its inception in Singapore in 1970, HP has grown to two Centers of Excellence, manufacturing sites and a Customer Welcome Center. The latest addition is the new Asia Pacific and Japan (APJ) headquarters and Smart Manufacturing Applications & Research Center (SMARC) at Depot Close. HP believes that people are at the core of its success and it brings together representation from 35 nationalities, reflecting the diversity of the region. HP also seeks to cultivate a growth mindset that drives innovation and empowerment. This includes initiatives that promote a strong sales culture, improve regional talent plans, career rotations and hiring.", "mission": "We create technology that makes life better for everyone, everywhere. Our mission is to engineer experiences that amaze. \r\n\r\nThat's just who we are. It's what we do. \r\nNow it's your turn! It's up to you to make the world a better place to live and work. We are here to help you ... Read more"}, "grab": {"company_name": "grab", "company_code": 958580, "website": "www.grab.careers", "headquarters": "Singapore, Singapore", "size": "5001 to 10000 Employees", "founded": "2012", "type": "Company - Public (Grab)", "industry": "Internet & Web Services", "revenue": "Unknown / Non-Applicable", "employer_description": "Grab was founded on the belief that a technology company could both run profitably and create sustainable impact. As we continue to innovate and serve our communities, we seek to ensure that our profitability is tied to the welfare of the communities we operate in, and the protection of the environment for future generations to come.Grab began as a taxi-hailing app in 2012, but has extended its product platform to include private car services (GrabCar & GrabShare), motorcycle taxis (GrabBike), social carpooling (GrabHitch), food delivery (GrabFood), last mile delivery (GrabExpress) as well as a mobile payments services (GrabFinancial Services Asia).We currently operate in Singapore, Indonesia, Philippines, Malaysia, Thailand, Vietnam, Myanmar and Cambodia. Our R&D centres are in Bangalore, Beijing, Cluj, Ho Chi Minh City, Jakarta, Singapore, Seattle, Seoul and Taipei.", "mission": "Grab believes that what is good for society is also good for business. We are a triple bottom line company, one that seeks to ensure that our success as a business has a positive social impact on communities we operate in and their environment. \n\nWe enable millions of consumers ... Read more"}, "Standard-Chartered": {"company_name": "Standard-Chartered", "company_code": 226853, "website": "www.sc.com", "headquarters": "London, United Kingdom", "size": "10000+ Employees", "founded": "1969", "type": "Company - Public (SCBFF)", "industry": "Investment & Asset Management", "revenue": "$5 to $25 million (USD)", "employer_description": "Standard Chartered is a leading international banking group. It has operated for over 150 years in some of the world's most dynamic markets and earns around 90 per cent of its income and profits in Asia, Africa and the Middle East. This geographic focus and commitment to developing deep relationships with clients and customers has driven the Bank's growth in recent years. Standard Chartered PLC is listed on the London and Hong Kong stock exchanges as well as the Bombay and National Stock Exchanges in India.\rWith 1,700 offices in 68 markets, the Group offers exciting and challenging international career opportunities for 89,000 staff. It is committed to building a sustainable business over the long term and is trusted worldwide for upholding high standards of corporate governance, social responsibility, environmental protection and employee diversity. Standard Chartered’s heritage and values are expressed in its brand promise, 'Here for good'.", "mission": "Not provided on Glassdoor"}, "Freeport-McMoRan": {"company_name": "Freeport-McMoRan", "company_code": 266, "website": "fcx.com", "headquarters": "Phoenix, United States", "size": "10000+ Employees", "founded": "Not provided on Glassdoor", "type": "Company - Public (FCX)", "industry": "Mining & Metals", "revenue": "Unknown / Non-Applicable", "employer_description": "Freeport-McMoRan (FCX) is a leading international mining company with headquarters in Phoenix, Arizona. Our company was incorporated under the laws of the state of Delaware on November 10, 1987. We operate large, long-lived geographically diverse assets with significant proven and probable reserves of copper, gold and molybdenum, and we are the world’s largest publicly traded copper producer. Our portfolio of assets includes the Grasberg minerals district in Indonesia, one of the world’s largest copper and gold deposits; and significant mining operations in the Americas, including the large-scale Morenci minerals district in North America and the Cerro Verde operation in South America.The safety and health of all employees is our highest priority. Management believes that safety and health considerations are integral to, and compatible with, all other functions in the organization and that proper safety and health management will enhance production and reduce costs. Our approach towards the health and safety of our workforce is to continuously improve performance through implementing robust management systems and providing adequate training, safety incentive and occupational health programs.", "mission": "Not provided on Glassdoor"}, "Samsung-Electronics": {"company_name": "Samsung-Electronics", "company_code": 3363, "website": "www.samsung.com", "headquarters": "Suwŏn, South Korea", "size": "10000+ Employees", "founded": "1969", "type": "Company - Public (SMSN)", "industry": "Electronics Manufacturing", "revenue": "$10+ billion (USD)", "employer_description": "Samsung Electronics is a global leader in technology, opening new possibilities for people everywhere. Through relentless innovation and discovery, we are transforming the worlds of TVs, smartphones, wearable devices, tablets, digital appliances, network systems, medical devices, semiconductors and LED solutions. Samsung is also leading in the Internet of Things space through, among others, our Smart Home and Digital Health initiatives. \rSince being established in 1969, Samsung Electronics has grown into one of the world’s leading technology companies, and become recognized as one of the top 10 global brands. Our network now extends across the world, and Samsung takes great pride in the creativity and diversity of its talented people, who drive our growth.\rTo discover more, please visit our website at www.samsung.com and our official newsroom at news.samsung.com.", "mission": "Not provided on Glassdoor"}, "continental": {"company_name": "continental", "company_code": 3768, "website": "www.continental-careers.com", "headquarters": "Hannover, Germany", "size": "10000+ Employees", "founded": "1871", "type": "Company - Public (CTTAY)", "industry": "Transportation Equipment Manufacturing", "revenue": "$10+ billion (USD)", "employer_description": "Continental develops pioneering technologies and services for sustainable and connected mobility of people and their goods. Founded in 1871, the technology company offers safe, efficient, intelligent and affordable solutions for vehicles, machines, traffic and transportation. In 2020, Continental generated sales of €37.7 billion and currently employs more than 192,000 people in 58 countries and markets. On October 8, 2021, the company celebrated its 150th anniversary.", "mission": "Not provided on Glassdoor"}, "seagate-technology": {"company_name": "seagate-technology", "company_code": 1864, "website": "www.seagate.com", "headquarters": "Fremont, United States", "size": "10000+ Employees", "founded": "1979", "type": "Company - Public (STX)", "industry": "Computer Hardware Development", "revenue": "$10+ billion (USD)", "employer_description": "Since 1978, Seagate has been creating precision-engineered data storage technologies that deliver superior capacity, speed, safety, and performance. We are a diverse workforce of about 40,000 creative, hard-working, passionate people all over the world—places including Silicon Valley, the United Kingdom, Singapore, India, and China.", "mission": "At Seagate, we know that data is always in motion, alive, connected—and we harness it in order to maximize human potential. Our mission is to give people peace of mind by helping them to protect their digital lives."}, "Philip-Morris-International": {"company_name": "Philip-Morris-International", "company_code": "7745", "website": "www.pmi.com", "headquarters": "New York, United States", "size": "10000+ Employees", "founded": "2008", "type": "Company - Public (PM)", "industry": "Consumer Product Manufacturing", "revenue": "$10+ billion (USD)", "employer_description": "Philip Morris International Inc (PMI) is the leading international tobacco company with a difference. With a team of colleagues worldwide, we’re ready to have global impact and disrupt an industry, together.", "mission": "We’re the only tobacco company in history to commit to a smoke-free future - why? Because change needs to happen, quickly.With the creation of our innovative products, we encourage existing adult smokers to make the switch if they don’t quit cigarette smoking. This isn’t going to be an easy task but with our passion, dedication and help of our colleagues, we believe that we can inspire change and truly Make History."}, "Kraft-Heinz-Company": {"company_name": "Kraft-Heinz-Company", "company_code": "1026712", "website": "www.kraftheinzcompany.com", "headquarters": "Chicago, United States", "size": "10000+ Employees", "founded": "2015", "type": "Company - Public (KHC)", "industry": "Food & Beverage Manufacturing", "revenue": "$10+ billion (USD)", "employer_description": "The Kraft Heinz Company is revolutionizing the food industry – we will be the most profitable food company powered by the most talented people with unwavering commitment to our communities, leading brands and highest product quality in every category in which we compete. As a global powerhouse, Kraft Heinz represents over $26.5 billion in revenue and is the 5th largest food and beverage company in the world. At Kraft Heinz, to be the BEST food company, growing a BETTER world is more than a dream – it is our GLOBAL VISION.  To be the best, we want the best – best brands, best practices and, most importantly, the best people.", "mission": "Not provided on Glassdoor"}, "Pernod-Ricard": {"company_name": "Pernod-Ricard", "company_code": "5317", "website": "www.pernod-ricard.com/en", "headquarters": "Paris, France", "size": "10000+ Employees", "founded": "1975", "type": "Company - Private", "industry": "Food & Beverage Manufacturing", "revenue": "$5 to $10 billion (USD)", "employer_description": "Pernod Ricard is the world’s n°2 in wines and spirits with consolidated Sales of € 8,558 million in 2014/15. \rCreated in 1975 by the merger of Ricard and Pernod, the Group has undergone sustained development, based on both organic growth and acquisitions: Seagram (2001), Allied Domecq (2005) and Vin&Sprit (2008). \rPernod Ricard holds one of the most prestigious brand portfolios in the sector: Absolut Vodka, Ricard pastis, Ballantine’s, Chivas Regal, Royal Salute and The Glenlivet Scotch whiskies, Jameson Irish whiskey, Martell cognac, Havana Club rum, Beefeater gin, Kahlúa and Malibu liqueurs, Mumm and Perrier- Jouët champagnes, as well Jacob’s Creek, Brancott Estate, Campo Viejo, Graffigna and Kenwood wines.", "mission": "Pernod Ricard employs a workforce of approximately 18,000 people and operates through a decentralised organisation, with 6 “Brand Companies” and 80 “Market Companies” established in each key market. \r\n\r\nPernod Ricard is strongly committed to a sustainable development policy and ... Read more"}, "Anheuser-Busch-InBev": {"company_name": "Anheuser-Busch-InBev", "company_code": "428473", "website": "www.ab-inbev.com", "headquarters": "Leuven, Belgium", "size": "10000+ Employees", "founded": "1852", "type": "Company - Public (BUD)", "industry": "Food & Beverage Manufacturing", "revenue": "$10+ billion (USD)", "employer_description": "Anheuser-Busch InBev is a publicly traded company (Euronext: ABI) based in Leuven, Belgium, with secondary listings on the Mexico (MEXBOL: ANB) and South Africa (JSE: ANH) stock exchanges and with American Depositary Receipts on the New York Stock Exchange (NYSE: BUD). \rOur Dream is to bring people together for a better world. Beer, the original social network, has been bringing people together for thousands of years. We are committed to building great brands that stand the test of time and to brewing the best beers using the finest natural ingredients. Our diverse portfolio of well over 400 beer brands includes global brands Budweiser, Corona, and Stella Artois; multi-country brands Beck’s; Castle; Castle Lite; Hoegaarden; and Leffe; and local champions such as Aguila; Antarctica; Bud Light; Brahma; Cass; Chernigivske; Cristal; Harbin; Jupiler; Klinskoye; Michelob Ultra; Modelo Especial; Quilmes; Victoria; Sedrin; Sibirskaya Korona; and Skol", "mission": "Not provided on Glassdoor"}, "Molson-Coors-Beverage-Company": {"company_name": "Molson-Coors-Beverage-Company", "company_code": "1091", "website": "www.molsoncoors.com", "headquarters": "Chicago, United States", "size": "10000+ Employees", "founded": "1774", "type": "Company - Public (TAP)", "industry": "Food & Beverage Manufacturing", "revenue": "$2 to $5 billion (USD)", "employer_description": "Molson Coors Brewing Company is a leading global brewer delivering extraordinary brands that delight the world's beer drinkers. We brew, market and sell a portfolio of leading premium brands such as Coors Light, Molson Canadian, Carling, Staropramen and Blue Moon across The Americas, Europe and Asia. We operate in Canada through Molson Coors Canada; in the US through MillerCoors; across Europe through Molson Coors Europe; and outside these core markets through Molson Coors International. \rThe company has been listed on the Dow Jones Sustainability World Index for the past four years and was named global Beverage Sector Leader in 2012 and 2013. We are constantly looking for ways to improve Our Beer Print. For more information, visit www.molsoncoors.com.\rHere's to celebrating responsibly!", "mission": "Delighting the world's beer drinkers."}, "The-HEINEKEN-Company": {"company_name": "The-HEINEKEN-Company", "company_code": "3514", "website": "www.theheinekencompany.com", "headquarters": "Amsterdam, Netherlands", "size": "10000+ Employees", "founded": "1864", "type": "Company - Private", "industry": "Food & Beverage Manufacturing", "revenue": "$10+ billion (USD)", "employer_description": "We build true human connections and break down barriers, because we believe great moments shared together are the best in life.We are inspired by our consumers to brew the best beers and we extend that same passion to all our brands, products and activities.We are proud of our family history and Dutch heritage. They are the foundation of our entrepreneurial spirit, which takes us to every corner of the world.We are brand builders. The Heineken® brand defines and unites us while our many local, regional and global brands make our range of beers and ciders diverse and unique.People are at the heart of our company. We see our strength in trust, diversity and progress.We stand by our values: passion for quality, enjoyment of life, respect for people and for the planet.We always advocate responsible consumption. We are committed to our communities and strive to reduce the impact we make on the planet.We work with our customers and partners to grow together and seek to win with integrity and fairness.And we are convinced that by staying true to these commitments, we create value for our shareholders.WE ARE HEINEKEN", "mission": "Not provided on Glassdoor"}, "MondelÄ“z-International": {"company_name": "MondelÄ“z-International", "company_code": "628257", "website": "www.mondelezinternational.com/united-kingdom", "headquarters": "Bournville, United Kingdom", "size": "1001 to 5000 Employees", "founded": "2012", "type": "Company - Public (MDLZ)", "industry": "Food & Beverage Manufacturing", "revenue": "$10+ billion (USD)", "employer_description": "Mondelēz International, Inc. (NASDAQ: MDLZ) is one of the world’s largest snacks companies with the mission to lead the future of snacking.You could say our story began in 1761 with Fry’s (who produced the first modern day chocolate bar) … or when John Cadbury opened his first grocery shop in 1824 … or in 1846 with the creation of LU biscuits … or in 1901 with the production of the first Nabisco cookies. But we really came together in 2012 with the creation of Mondelēz International. We combine the energy and passion of a new company with the strength and heritage of 100+ year-old brands - and nearly 90,000+ employees working across 165 countries. We have the scale and resources of a big organization, together with the speed, hunger, creativity and agility of a smaller company.", "mission": "LEAD THE FUTURE OF SNACKING\r\n\r\nOur Mission is crystal clear: lead the future of snacking\r\nby offering the right snack for the right moment made\r\nthe right way.\r\n\r\nThis is not only our Mission. It is our growth opportunity.\r\n\r\nWhy? Snacking is the place to be! It performs ... Read more"}, "Unilever": {"company_name": "Unilever", "company_code": "3513", "website": "careers.unilever.com/", "headquarters": "London, United Kingdom", "size": "10000+ Employees", "founded": "1872", "type": "Company - Public (ULVR:LN)", "industry": "Consumer Product Manufacturing", "revenue": "$10+ billion (USD)", "employer_description": "On any given day, two billion people use Unilever products to look good, feel good and get more out of life. \rWith more than 400 brands focused on health and wellbeing, no company touches so many people’s lives in so many different ways. \rOur portfolio ranges from nutritionally balanced foods to indulgent ice creams, affordable soaps, luxurious shampoos and everyday household care products. We produce world-leading brands including Lipton, Knorr, Dove, Axe, Hellmann’s and Omo, alongside trusted local names such as Blue Band, Pureit and Suave. \rFor us, sustainability is integral to how we do business. With 7 billion people on our planet, the earth’s resources can be strained. This means sustainable growth is the only acceptable model of growth for our business. The Unilever Sustainable Living Plan sets out to decouple our growth from our environmental impact, while at the same time increasing our positive social impact.", "mission": "We believe that as a business we have a responsibility to our consumers and to the communities in which we have a presence. Around the world we invest in local economies and develop people’s skills inside and outside of Unilever. And through our business and brands, we run a ... Read more"}, "Carrefour": {"company_name": "Carrefour", "company_code": "3118", "website": "www.carrefour.com", "headquarters": "Massy, France", "size": "10000+ Employees", "founded": "1958", "type": "Company - Private", "industry": "General Merchandise & Superstores", "revenue": "$10+ billion (USD)", "employer_description": "At the junction of groceries, merchandise, and services, you'll find Carrefour (which means \"crossroads\"). The world's second-largest retailer (behind Wal-Mart), Carrefour operates more than 15,600 stores under various banners, including hypermarkets (Carrefour), supermarkets (Carrefour Market, formerly Champion), convenience stores (City, Express), and cash-and-carry outlets (Promocash) in about 35 countries in Europe, Latin America, and Asia. France, with more than 5,400 Carrefour stores, accounts for some 40% of the retailer's sales. Carrefour secured its spot as the #1 European retailer when it merged with food retailer Promodès and raised its banner over those stores.", "mission": "Not provided on Glassdoor"}, "Keurig-Dr-Pepper": {"company_name": "Keurig-Dr-Pepper", "company_code": "2134135", "website": "www.keurigdrpepper.com", "headquarters": "Burlington, United States", "size": "10000+ Employees", "founded": "2018", "type": "Company - Public (KDP)", "industry": "Food & Beverage Manufacturing", "revenue": "$10+ billion (USD)", "employer_description": "Keurig Dr Pepper (KDP) is a leading beverage company in North America, with annual revenue in excess of $11 billion and nearly 26,000 employees. KDP holds leadership positions in soft drinks, specialty coffee and tea, water, juice and juice drinks and mixers, and markets the #1 single serve coffee brewing system in the U.S. and Canada. The Company’s portfolio of more than 125 owned, licensed and partner brands is designed to satisfy virtually any consumer need, any time, and includes Keurig, Dr Pepper, Green Mountain Coffee Roasters, Canada Dry, Snapple, Bai, Mott's, CORE and The Original Donut Shop. Through its powerful sales and distribution network, KDP can deliver its portfolio of hot and cold beverages to nearly every point of purchase for consumers.  The Company is committed to sourcing, producing and distributing its beverages responsibly through its Drink Well. Do Good. corporate responsibility platform, including efforts around circular packaging, efficient natural resource use and supply chain sustainability.  For more information, visit, www.keurigdrpepper.com.", "mission": "Not provided on Glassdoor"}, "Procter-and-Gamble": {"company_name": "Procter-and-Gamble", "company_code": "544", "website": "www.pg.com", "headquarters": "Cincinnati, United States", "size": "10000+ Employees", "founded": "1837", "type": "Company - Public (PG)", "industry": "Consumer Product Manufacturing", "revenue": "$10+ billion (USD)", "employer_description": "Procter & Gamble Co. (P&G, NYSE: PG) is one of the largest corporations in the world by market capitalization and is a Fortune Top 10 Most Admired Company. At P&G, we produce globally recognized brands, and we grow and embrace the best business leaders in the industry. For more than 175 years, we have been innovating to touch and improve consumers’ lives. \rP&G serves nearly five billion people around the world with its brands. The Company has one of the strongest portfolios of trusted, quality, leadership brands, including Always®, Ambi Pur®, Ariel®, Bounty®, Charmin®, Crest®, Dawn®, Downy®, Fairy®, Febreze®, Gain®, Gillette®, Head & Shoulders®, Lenor®, Olay®, Oral-B®, Pampers®, Pantene®, SK-II®, Tide®, Vicks®  and Whisper®. The P&G community includes operations in approximately 70 countries worldwide. P&G, Building Leaders and Leadership Brands.", "mission": "Not provided on Glassdoor"}, "NestlÃ©": {"company_name": "NestlÃ©", "company_code": "3492", "website": "www.nestle.com", "headquarters": "Vevey, Switzerland", "size": "10000+ Employees", "founded": "1867", "type": "Company - Public (NSRGY)", "industry": "Food & Beverage Manufacturing", "revenue": "$10+ billion (USD)", "employer_description": "As the world’s largest food and beverage company we are driven by a simple aim: enhancing quality of life and contributing to a healthier future. To deliver on this, we serve with passion, with a spirit of excellence, offering products and services for all stages of life, every moment of the day, helping people care for themselves and their families. Our culture is based on our values rooted in respect: respect for ourselves, respect for others, respect for diversity and respect for the future.We can trace our origin back to 1866, when the first European condensed milk factory was opened in Cham, Switzerland, by the Anglo-Swiss Condensed Milk Company. One year later, Henri Nestlé, a trained pharmacist, launched one of the world’s first prepared infant cereals ‘Farine lactée’ in Vevey, Switzerland.Today, we employ around 328,000 people and have factories or operations in almost every country in the world. With our headquarters still based in the Swiss town of Vevey, we had sales of CHF 89.5 billion in 2016.Our portfolio covers almost every food and beverage category –offering products abeveragend services for all stages of life, every moment of the day, helping people care for themselves and their families.", "mission": "Unlocking the power of food to enhance quality of life for everyone, today and for generations to come."}, "Walgreens-Boots-Alliance": {"company_name": "Walgreens-Boots-Alliance", "company_code": "3779", "website": "www.walgreensbootsalliance.com", "headquarters": "Deerfield, United States", "size": "10000+ Employees", "founded": "2014", "type": "Company - Public (WBA)", "industry": "Drug & Health Stores", "revenue": "$10+ billion (USD)", "employer_description": "Alliance Boots Holdings makes an even bigger footprint in Europe's retail and wholesale drug markets since the UK's #1 drugstore chain, Boots the Chemists (BTC), combined its operations with that of drug wholesaler and retailer Alliance UniChem. Formed by the 2006 merger of the two firms, Alliance Boots Holdings is Europe's leading drug wholesaler, serving more than 140,000 pharmacies, hospitals, and clinics in about 16 countries, including China. The health and beauty group operates more than 3,200 pharmacies in the UK and more than a half a dozen European and Asian countries. US private-equity giant Kohlberg Kravis Roberts took the company private in 2007 in a deal valued at about $22.2 billion.", "mission": "Not provided on Glassdoor"}, "Coca-Cola-Company": {"company_name": "Coca-Cola-Company", "company_code": "161", "website": "www.coca-colacompany.com", "headquarters": "Atlanta, United States", "size": "10000+ Employees", "founded": "1886", "type": "Company - Public (KO)", "industry": "Food & Beverage Manufacturing", "revenue": "$10+ billion (USD)", "employer_description": "The Coca-Cola Company (NYSE: KO) is a total beverage company with products sold in more than 200 countries and territories.Our company’s purpose is to refresh the world and make a difference.  We sell multiple billion-dollar brands across several beverage categories worldwide. Our portfolio of sparkling soft drink brands includes Coca-Cola, Sprite and Fanta. Our water, sports, coffee and tea brands include Dasani, smartwater, vitaminwater, Topo Chico, BODYARMOR, Powerade, Costa, Georgia, Gold Peak and Ayataka. Our juice, value-added dairy and plant-based beverage brands include Minute Maid, Simply, innocent, Del Valle, fairlife and AdeS.We’re constantly transforming our portfolio, from reducing sugar in our drinks to bringing innovative new products to market. We seek to positively impact people’s lives, communities and the planet through water replenishment, packaging recycling, sustainable sourcing practices and carbon emissions reductions across our value chain. Together with our bottling partners, we employ more than 700,000 people, helping bring economic opportunity to local communities worldwide.", "mission": "Our vision is to craft the brands and choice of drinks that people love, to refresh them in body & spirit. And done in ways that create a more sustainable business and better shared future that makes a difference in people’s lives, communities and our planet."}, "Costco-Wholesale": {"company_name": "Costco-Wholesale", "company_code": "2590", "website": "www.costco.com/", "headquarters": "Issaquah, United States", "size": "10000+ Employees", "founded": "1976", "type": "Company - Public (COST)", "industry": "General Merchandise & Superstores", "revenue": "Unknown / Non-Applicable", "employer_description": "Costco is a membership warehouse club, dedicated to bringing our members the best possible prices on quality brand-name merchandise. With hundreds of locations worldwide, Costco provides a wide selection of merchandise, plus the convenience of specialty departments and exclusive member services, all designed to make your shopping experience a pleasurable one.", "mission": "To continually provide our members with quality goods and services at the lowest possible prices."}, "Altria": {"company_name": "Altria", "company_code": "528", "website": "www.altria.com", "headquarters": "Richmond, United States", "size": "5001 to 10000 Employees", "founded": "1919", "type": "Company - Public (MO)", "industry": "Consumer Product Manufacturing", "revenue": "$10+ billion (USD)", "employer_description": "Altria has a leading portfolio of tobacco products for U.S. tobacco consumers 21+. Our tobacco companies – which have been the undisputed market leaders in the U.S. tobacco industry for decades – include some of the most enduring names in American business.In combustibles, we own Philip Morris USA, the maker of Marlboro cigarettes and John Middleton, manufacturer of Black & Mild cigars. Our smoke-free portfolio includes ownership of U.S. Smokeless Tobacco Company, the maker of Copenhagen and Skoal, and Helix Innovations, the maker of on! oral nicotine pouches.Additionally, we have a majority-owned joint venture with JT Group, Horizon Innovations, for the U.S. marketing and commercialization of heated tobacco stick products. Through a separate agreement with Philip Morris International, we have the exclusive U.S. commercialization rights to the IQOS* Tobacco Heating System® and Marlboro HeatSticks® through April 2024.Our equity investments include Anheuser-Busch InBev SA/NV, the world’s largest brewer and Cronos Group, a leading Canadian cannabinoid company.The brand portfolios of Altria’s tobacco operating companies include Marlboro®, Black & Mild®, Copenhagen®, Skoal® and on!®. Trademarks and service marks related to Altria referenced on this channel are the property of Altria or its subsidiaries or are used with permission.*Due to an order issued by the International Trade Commission, IQOS Devices and HeatSticks® are currently unavailable for sale in the United States.", "mission": "It’s an exciting and dynamic time for our company. As the leader in an evolving industry, we have the duty and the opportunity to shape a better future for adult tobacco consumers, our employees and shareholders. \n\nTo do so, we need clarity of purpose and a Vision for where ... Read more"}, "Danone": {"company_name": "Danone", "company_code": "3471", "website": "www.danone.com", "headquarters": "Paris, France", "size": "10000+ Employees", "founded": "1919", "type": "Company - Public (BN)", "industry": "Food & Beverage Manufacturing", "revenue": "$10+ billion (USD)", "employer_description": "Danone is an international company present on all continents. The group holds top positions in healthy food through four businesses: Fresh Dairy Products, Early Life Nutrition, Waters, and Medical Nutrition. Its mission is to bring health through food to as many people as possible. \rDanone has over 190 production plants and around 104,000 employees. Present in over 130 markets, Danone generated sales of €22.4 billion in 2015, with more than half in emerging countries. Danone’s brand portfolio includes international brands (Activia, Actimel, Danette, Danonino, evian, Nutrilon/Aptamil, Nutricia) and local brands (Oikos, Prostokvashino, AQUA, Bledina). Listed on Euronext Paris, Danone is a component stock of leading social responsibility indexes including the Dow Jones Sustainability Indexes.\rThis is in keeping with a business model that aims to create value shared among all stakeholders—not only shareholders, but also employees, business partners, public authorities and local communities.", "mission": "Bring health through food to as many people as possible"}, "Colgate-Palmolive": {"company_name": "Colgate-Palmolive", "company_code": "162", "website": "www.colgatepalmolive.com", "headquarters": "New York, United States", "size": "10000+ Employees", "founded": "1806", "type": "Company - Public (CL)", "industry": "Consumer Product Manufacturing", "revenue": "$10+ billion (USD)", "employer_description": "Colgate-Palmolive Company is a caring, innovative growth company reimagining a healthier future for all people, their pets and our planet. Focused on Oral Care, Personal Care, Home Care and Pet Nutrition, we sell our products in more than 200 countries and territories under brands such as Colgate, Palmolive, elmex, hello, meridol, Sorriso, Tom’s of Maine, EltaMD, Filorga, Irish Spring, PCA SKIN, Protex, Sanex, Softsoap, Speed Stick, Ajax, Axion, Fabuloso, Soupline and Suavitel, as well as Hill’s Science Diet and Hill’s Prescription Diet.We are recognized for our leadership and innovation in promoting sustainability and community wellbeing, including our achievements in decreasing plastic waste and promoting recyclability, saving water, conserving natural resources and improving children’s oral health through the Colgate Bright Smiles, Bright Futures program, which has reached more than 1.4 billion children since 1991.For more information about Colgate-Palmolive's global business and how we are building a future to smile about,visit our website at www.ColgatePalmolive.com. To learn more about Colgate Bright Smiles, Bright Futures, Colgate's global oral health education program, please visit www.ColgateBSBF.com.Connect with us:Linkedin- Colgate Palmolive@ColgateCareersYouTube.com/ColgatePalmoliveJobsSpecialtiesOral Care, Personal Care, Skin Health, Home Care and Pet Nutrition", "mission": "We are Colgate, a caring, innovative growth company that is reimagining a healthier future for all people, their pets and our planet."}, "Diageo": {"company_name": "Diageo", "company_code": "7438", "website": "www.diageo.com", "headquarters": "London, United Kingdom", "size": "10000+ Employees", "founded": "1997", "type": "Company - Public (DEO)", "industry": "Food & Beverage Manufacturing", "revenue": "$10+ billion (USD)", "employer_description": "Not provided on Glassdoor", "mission": "Not provided on Glassdoor"}, "Walmart": {"company_name": "Walmart", "company_code": "715", "website": "careers.walmart.com", "headquarters": "Bentonville, United States", "size": "10000+ Employees", "founded": "1962", "type": "Company - Public (WMT)", "industry": "General Merchandise & Superstores", "revenue": "$10+ billion (USD)", "employer_description": "What started small, with a single discount store and the simple idea of selling more for less, has grown over the last 50 years into the largest retailer in the world. Each week, approximately 220 million customers and members visit approximately 10,500 stores and clubs under 48 banners in 24 countries and eCommerce websites. With fiscal year 2021 revenue of $559 billion, Walmart employs over 2.3 million associates worldwide. Walmart continues to be a leader in sustainability, corporate philanthropy and employment opportunity. It’s all part of our unwavering commitment to creating opportunities and bringing value to customers and communities around the world.Working at WalmartOur people make the difference. That phrase started as a meeting theme in 1979 and has since been our way of thinking. We couldn’t serve our customers without the continued support of our greatest asset: our associates. We’re proud to support them by offering jobs at all levels – and investing in our workforce through training and skills development so that all jobs lead to careers.At Walmart, we remind ourselves each day that our work isn’t just about what we achieve but how we achieve it. The way we conduct our business is as important as the products we sell and the services we provide. That means complying with the laws of the communities where we do business. But that is not enough. Associates who work at Walmart are expected to operate based on our high standards and values—respect, service, excellence, and integrity.Acting consistently with these values demands that a culture of integrity guides all our decisions. Our Code of Conduct reflects who we are as a company and how we bring our culture to life in our work every day. It applies to every Walmart associate. We also expect our business partners to embrace our values and meet these high standards. Associates and partners who do not share these values do not belong at Walmart.Our commitment to integrity is reflected in our actions. From ensuring the food and products we sell are safe; to using technology and data ethically and responsibly; to investigating concerns raised by our customers, associates, and stakeholders. Our commitments are embedded into every action we take.Integrity builds trust. That’s why our associates, customers, investors, suppliers, and business partners choose Walmart—they know we are a business they can trust.", "mission": "\"To save people money so they can live better.”"}, "PepsiCo": {"company_name": "PepsiCo", "company_code": "522", "website": "www.pepsico.com", "headquarters": "Purchase, United States", "size": "10000+ Employees", "founded": "1965", "type": "Company - Public (PEP)", "industry": "Food & Beverage Manufacturing", "revenue": "$10+ billion (USD)", "employer_description": "PepsiCo is a global food and beverage leader with a product portfolio including 22 brands that generate more than $1 billion each in annual retail sales. Our main businesses – Quaker, Tropicana, Gatorade, Frito-Lay and Pepsi-Cola – make hundreds of enjoyable foods and beverages that are loved throughout the world.At PepsiCo, you get the best of both worlds: an entrepreneur’s mindset plus reach and resources. Our collaborative culture and worldwide presence generate a stream of new opportunities to define the future and propel your life’s work. Bring your unique perspective. Bring curiosity. Bring ingenuity, and drive. We’ll give you a platform to be daring on a global scale.", "mission": "Create more smiles with every sip and every bite."}, "Novartis": {"company_name": "Novartis", "company_code": 6667, "website": "www.novartis.com", "headquarters": "Basel, Switzerland", "size": "10000+ Employees", "founded": "1996", "type": "Company - Public (NVS)", "industry": "Biotech & Pharmaceuticals", "revenue": "$10+ billion (USD)", "employer_description": "At Novartis, we use science-based innovation to address some of society’s most challenging healthcare issues. We discover and develop breakthrough treatments and find new ways to deliver them to as many people as possible.\rChannel Guidance:\rIf you believe that you have experienced any medical side effects or reactions from a Novartis product you should consult your physician, pharmacist or other healthcare professional immediately. Alternatively you can also report these to us directly using the information shared on the following link:\rhttps://www.novartis.com/our-company/contact-us", "mission": "Mission:  Our mission is to discover new ways to improve and extend people`s lives. Our vision is to be a trusted leader in changing the practice of medicine. www.novartis.com"}, "Pfizer": {"company_name": "Pfizer", "company_code": 525, "website": "www.pfizer.com", "headquarters": "New York, United States", "size": "10000+ Employees", "founded": "1849", "type": "Company - Public (PFE)", "industry": "Biotech & Pharmaceuticals", "revenue": "$10+ billion (USD)", "employer_description": "Pfizer Inc.: Working together for a healthier world®\rAt Pfizer, we apply science and our global resources to bring therapies to people that extend and significantly improve their lives. We strive to set the standard for quality, safety and value in the discovery, development and manufacture of health care products. Our global portfolio includes medicines and vaccines as well as many of the world's best-known consumer health care products. Every day, Pfizer colleagues work across developed and emerging markets to advance wellness, prevention, treatments and cures that challenge the most feared diseases of our time. Consistent with our responsibility as one of the world's premier innovative biopharmaceutical companies, we collaborate with healthcare providers, governments and local communities to support and expand access to reliable, affordable healthcare around the world. For more than 150 years, Pfizer has worked to make a difference for all who rely on us.", "mission": "To be the premier, innovative biopharmaceutical company."}, "Johnson-and-Johnson": {"company_name": "Johnson-and-Johnson", "company_code": 364, "website": "www.jnj.com", "headquarters": "New Brunswick, United States", "size": "10000+ Employees", "founded": "1887", "type": "Company - Public (JNJ)", "industry": "Biotech & Pharmaceuticals", "revenue": "$10+ billion (USD)", "employer_description": "Johnson & Johnson is the largest and most broadly based healthcare company in the world. We’re producing life-changing breakthroughs every day, and have been for the last 130 years. \rThe combination of new technologies and your expertise enables amazing things to happen. Teams from J&J’s consumer business are creating digital tools to help people track the health of their skin. Those working in medical devices are 3-D printing artificial joints personalized for each patient, while researchers in pharmaceuticals use AI to discover lifesaving drugs. Imagine what the rest of our team of 134,000 people at 260 companies in more than 60 countries across the world is accomplishing. We redefine what it means to be a big company in today’s world.", "mission": "Not provided on Glassdoor"}, "Gilead-Sciences": {"company_name": "Gilead-Sciences", "company_code": 2016, "website": "www.gilead.com/", "headquarters": "Foster City, United States", "size": "10000+ Employees", "founded": "1987", "type": "Company - Public (GILD)", "industry": "Biotech & Pharmaceuticals", "revenue": "$10+ billion (USD)", "employer_description": "Gilead Sciences, Inc. is a biopharmaceutical company that has pursued and achieved breakthroughs in medicine for more than three decades, with the goal of creating a healthier world for all people. The company is committed to advancing innovative medicines to prevent and treat life-threatening diseases, including HIV, viral hepatitis and cancer. Gilead operates in more than 35 countries worldwide, with headquarters in Foster City, California.", "mission": "To discover, develop and deliver innovative therapeutics for people with life-threatening diseases."}, "Express-Scripts": {"company_name": "Express-Scripts", "company_code": 2212, "website": "www.express-scripts.com/corporate", "headquarters": "Saint Louis, United States", "size": "10000+ Employees", "founded": "1986", "type": "Company - Public (ESRX)", "industry": "Healthcare Services & Hospitals", "revenue": "Unknown / Non-Applicable", "employer_description": "Not provided on Glassdoor", "mission": "Express Scripts is a health care opportunity company, tackling the problems others don’t, won’t or can’t. Where some see obstacles, we see possibilities. We’re 27,000 strong, daring to imagine a better health care experience for everyone – and driven to make it happen. We are Champions For Better."}, "Merck": {"company_name": "Merck", "company_code": 438, "website": "www.merck.com", "headquarters": "Rahway, United States", "size": "10000+ Employees", "founded": "1891", "type": "Company - Public (MRK)", "industry": "Biotech & Pharmaceuticals", "revenue": "$10+ billion (USD)", "employer_description": "At Merck, known as MSD outside of the United States and Canada, we are unified around our purpose: We use the power of leading-edge science to save and improve lives around the world. For more than a century, we’ve been at the forefront of research, bringing forward medicines, vaccines and innovative health solutions for the world’s most challenging diseases.", "mission": "It all comes back to inventing for life\nWe are all inventors here, no matter the role or title. We rise to any challenge in pursuit of better health outcomes.\n\nEverything we do, in and out of the laboratory, is based on our deep appreciation for life. That’s the reason we come ... Read more"}, "Abbott": {"company_name": "Abbott", "company_code": 12, "website": "www.abbott.com", "headquarters": "Abbott Park, United States", "size": "10000+ Employees", "founded": "1888", "type": "Company - Public (ABT)", "industry": "Healthcare Services & Hospitals", "revenue": "$10+ billion (USD)", "employer_description": "Not provided on Glassdoor", "mission": "Not provided on Glassdoor"}, "The-Cigna-Group": {"company_name": "The-Cigna-Group", "company_code": 119, "website": "jobs.thecignagroup.com/us/en", "headquarters": "Bloomfield, United States", "size": "10000+ Employees", "founded": "1865", "type": "Company - Public (CI)", "industry": "Healthcare Services & Hospitals", "revenue": "$10+ billion (USD)", "employer_description": "Doing something meaningful starts with a simple decision, a commitment to changing lives. At The Cigna Group, we’re dedicated to improving the health and vitality of those we serve.Through our divisions Cigna Healthcare and Evernorth Health Services, we are committed to enhancing the lives of our clients, customers and patients. Join us in driving growth and improving lives.", "mission": "To improve the health, well-being and peace of mind of those we serve."}, "Vertex-Pharmaceuticals": {"company_name": "Vertex-Pharmaceuticals", "company_code": 2080, "website": "www.vrtx.com", "headquarters": "Boston, United States", "size": "1001 to 5000 Employees", "founded": "1989", "type": "Company - Public (VRTX)", "industry": "Biotech & Pharmaceuticals", "revenue": "$5 to $10 billion (USD)", "employer_description": "Vertex is a global biotechnology company that invests in scientific innovation to create transformative medicines for people with serious and life-threatening diseases.We discovered and developed the first medicines to treat the underlying cause of cystic fibrosis (CF), a rare, life-threatening genetic disease. In addition to clinical development programs in CF, Vertex has more than a dozen ongoing research programs focused on the underlying mechanisms of other serious diseases. Founded in 1989 in Cambridge, Massachusetts, our corporate headquarters is now located in Boston’s Innovation District, and our international headquarters is in London, United Kingdom. We currently employ approximately 3,500 people in the United States, Europe, Canada, Australia and Latin America with nearly two-thirds of our staff dedicated to research and development.", "mission": "Vertex creates new possibilities in medicine to cure diseases and improve people's lives. We work with leading researchers, doctors, public health experts and other collaborators who share our vision for transforming the lives of people with serious diseases, their families and ... Read more"}, "Illumina": {"company_name": "Illumina", "company_code": 11671, "website": "www.illumina.com", "headquarters": "San Diego, United States", "size": "5001 to 10000 Employees", "founded": "1998", "type": "Company - Public (ILMN)", "industry": "Biotech & Pharmaceuticals", "revenue": "$2 to $5 billion (USD)", "employer_description": "Illumina is a global leader in genomics – an industry at the intersection of biology and technology. We are improving the future of human health by unlocking the power of the genome. Our mission is everything to us. We are deeply passionate about what we do because we know we are solving problems that really matter. Our focus on innovation has established us as a global leader in DNA sequencing and array-based technologies, serving customers in the research, clinical, and applied markets. As Illumina's technology is responsible for generating more than 90% of the world’s sequencing data, it only makes sense that we have offices around the world. Today we have almost 7,300 employees in 11 countries globally.At Illumina, you’ll find a career where every day brings new adventures and challenges. Our work has purpose, and we know that what we do has the power to change lives. Every moment matters. We want to learn how you can help us create those defining moments.", "mission": "To improve human health by unlocking the power of the genome."}, "CVS-Health": {"company_name": "CVS-Health", "company_code": 437, "website": "jobs.cvshealth.com", "headquarters": "Woonsocket, United States", "size": "10000+ Employees", "founded": "1963", "type": "Company - Public (CVS)", "industry": "Healthcare Services & Hospitals", "revenue": "$10+ billion (USD)", "employer_description": "It's a new day in health care.At CVS Health, we bring our heart to every moment of your health. Inspired by our purpose and empowered by our bold strategy, we work to redefine the consumer experience and reimagine our community impact. Through our health services, insurance plans and community pharmacists, we’re pioneering a bold new approach to total health. As a CVS Health colleague, you’ll be at the center of it all.", "mission": "We help people with their health wherever and whenever they need us. And we do it with heart. Because our passion is our purpose: Bringing our heart to every moment of your health™."}, "Bristol-Myers-Squibb": {"company_name": "Bristol-Myers-Squibb", "company_code": 107, "website": "www.bms.com", "headquarters": "New York, United States", "size": "10000+ Employees", "founded": "1858", "type": "Company - Public (BMY)", "industry": "Biotech & Pharmaceuticals", "revenue": "$10+ billion (USD)", "employer_description": "Bristol Myers Squibb is a global biopharmaceutical company committed to creating innovative medicines for millions of patients around the world fighting serious diseases in therapeutic areas such as oncology, hematology, immunology, cardiovascular and neuroscience. At the same time, we also nurture our own team with inspiring work and challenging career options.Bristol Myers Squibb is led by our unique BioPharma strategy that combines the innovation and agility of a biotech with the reach and resources of a major pharma company. Through our R&D organization, we have built a sustainable pipeline of potential therapies, and actively partner to access external innovation to broaden and accelerate our work.As global citizens, through the Bristol Myers Squibb Foundation, we promote health equity and strive to improve health outcomes of populations disproportionately affected by serious diseases and conditions, giving new hope to some of the world’s most vulnerable people.", "mission": "Bristol Myers Squibb is a global biopharmaceutical company whose mission is to discover, develop and deliver innovative medicines that help patients prevail over serious diseases."}, "UnitedHealth-Group": {"company_name": "UnitedHealth-Group", "company_code": 1991, "website": "www.unitedhealthgroup.com", "headquarters": "Minnetonka, United States", "size": "10000+ Employees", "founded": "1977", "type": "Company - Public (UNH)", "industry": "Healthcare Services & Hospitals", "revenue": "$10+ billion (USD)", "employer_description": "We're a Fortune 7 company on a global mission to help people live healthier lives while improving the health system and expanding access to quality care.Empowering more than 142 million people worldwide with information, guidance and tools to make healthier choices makes our work demanding and requires us to adapt to constant change.United by our values of Integrity, Compassion, Relationships, Innovation, and Performance, we're committed to creating better outcomes for our customers, partners and employees. Diversity creates a healthier atmosphere: All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, national origin, protected veteran status, disability status, sexual orientation, gender identity or expression, marital status, genetic information, or any other characteristic protected by law. UnitedHealth Group is a drug-free workplace. Candidates are required to pass a drug test before beginning employment.", "mission": "Our mission is to help people live healthier lives and to help the health care system work better for everyone."}, "Roche": {"company_name": "Roche", "company_code": 3480, "website": "www.roche.com", "headquarters": "Basel, Switzerland", "size": "10000+ Employees", "founded": "1896", "type": "Company - Public (RHHBY)", "industry": "Biotech & Pharmaceuticals", "revenue": "$10+ billion (USD)", "employer_description": "Roche is a global pioneer in pharmaceuticals and diagnostics focused on advancing science to improve people’s lives. The combined strengths of pharmaceuticals and diagnostics under one roof have made Roche the leader in personalised healthcare – a strategy that aims to fit the right treatment to each patient in the best way possible.\rRoche is the world’s largest biotech company, with truly differentiated medicines in oncology, immunology, infectious diseases, ophthalmology and diseases of the central nervous system. Roche is also the world leader in in vitro diagnostics and tissue-based cancer diagnostics, and a frontrunner in diabetes management.\rFounded in 1896, Roche continues to search for better ways to prevent, diagnose and treat diseases and make a sustainable contribution to society. The company also aims to improve patient access to medical innovations by working with all relevant stakeholders.", "mission": "Doing now what patients need next\nWe believe it’s urgent to deliver medical solutions right now – even as we develop innovations for the future. We are passionate about transforming patients’ lives. We are courageous in both decision and action. And we believe that good business ... Read more"}, "Humana": {"company_name": "Humana", "company_code": 340, "website": "careers.humana.com/", "headquarters": "Louisville, United States", "size": "10000+ Employees", "founded": "1961", "type": "Company - Public (HUM)", "industry": "Healthcare Services & Hospitals", "revenue": "$10+ billion (USD)", "employer_description": "Health is at the core of Humana. Headquartered in Louisville, Kentucky, Humana is a leading healthcare company that offers a wide range of products, healthcare services and wellness solutions by incorporating an integrated approach to lifelong well-being. If you are looking for a career that provides opportunities for growth and development in a stable industry, consider a career with Humana. The company offers a variety of benefits including competitive, performance-based wages, retirement plans, medical, dental, vision and life insurance, on-site health screenings and personal health coaching, paid time off, tuition assistance, leadership development, mentorships and much more.", "mission": "Since 1961, Humana has been committed to helping people live healthy and happy. Our approach is simple—offer personalized care from people who care. We do this by listening to our members and creating solutions to help them reach the best version of themselves. We’re also deeply ... Read more"}, "Biogen": {"company_name": "Biogen", "company_code": 1336, "website": "www.biogen.com", "headquarters": "Cambridge, United States", "size": "5001 to 10000 Employees", "founded": "1978", "type": "Company - Public (BIIB)", "industry": "Biotech & Pharmaceuticals", "revenue": "$10+ billion (USD)", "employer_description": "Founded in 1978, Biogen is a leading global biotechnology company that has pioneered multiple breakthrough innovations including a broad portfolio of medicines to treat multiple sclerosis, the first approved treatment for spinal muscular atrophy, and two co-developed treatments to address a defining pathology of Alzheimer’s disease. Biogen is advancing a pipeline of potential novel therapies across neurology, neuropsychiatry, specialized immunology and rare diseases and remains acutely focused on its purpose of serving humanity through science while advancing a healthier, more sustainable and equitable world.", "mission": "Drive innovation to defeat the most complex and devastating diseases."}, "Medtronic": {"company_name": "Medtronic", "company_code": 436, "website": "www.medtronic.com", "headquarters": "Dublin, Ireland", "size": "10000+ Employees", "founded": "1949", "type": "Company - Public (MDT)", "industry": "Health Care Products Manufacturing", "revenue": "$10+ billion (USD)", "employer_description": "Together, we change healthcare worldwide. At Medtronic, we push the limits of what healthcare technology and solutions can do to help alleviate pain, restore health and extend life. \rWe challenge ourselves and each other to make tomorrow better than yesterday. It is what makes this an exciting and rewarding place to be. \rWe can accelerate and advance our ability to create meaningful innovations - but we will only succeed with the right people on our team. Let’s work together to address universal healthcare needs and improve patients’ lives. Help us shape the future.", "mission": "To contribute to human welfare by application of biomedical engineering in the research, design, manufacture, and sale of instruments or appliances that alleviate pain, restore health, and extend life."}, "Regeneron": {"company_name": "Regeneron", "company_code": 981, "website": "www.regeneron.com", "headquarters": "Tarrytown, United States", "size": "10000+ Employees", "founded": "1988", "type": "Company - Public (REGN)", "industry": "Biotech & Pharmaceuticals", "revenue": "$5 to $10 billion (USD)", "employer_description": "Regeneron (NASDAQ: REGN) is a leading biotechnology company that invents life-transforming medicines for people with serious diseases. Founded and led for over 30 years by physician-scientists, our unique ability to repeatedly and consistently translate science into medicine has led to nine FDA-approved treatments and numerous product candidates in development, nearly all of which were homegrown in our laboratories. Our medicines and pipeline are designed to help patients with eye diseases, allergic and inflammatory diseases, cancer, cardiovascular and metabolic diseases, pain, hematologic diseases, infectious diseases and rare diseases.Regeneron is accelerating and improving the traditional drug development process through our proprietary VelociSuite® technologies, such as VelocImmune®, which uses unique genetically humanized mice to produce optimized fully human antibodies and bispecific antibodies, and through ambitious research initiatives such as the Regeneron Genetics Center®, which is conducting one of the largest genetics sequencing efforts in the world.An important note about privacy: Regeneron is committed to your privacy and will not ask for sensitive personal information such as social security number, date of birth or bank account details via email or social media. We do not interview candidates on Google Hangouts. Any questions about job listings can be directed to candidatesupport@regeneron.com . We also do not hire for “at-home data entry” positions.", "mission": "For 30 years, our mission has been to use the power of science to bring new medicines to patients.... over and over again.  Every day, we apply our homegrown technologies and relentless spirit to help people with serious diseases."}, "Amgen": {"company_name": "Amgen", "company_code": 1130, "website": "www.amgen.com", "headquarters": "Thousand Oaks, United States", "size": "10000+ Employees", "founded": "1980", "type": "Company - Public (AMGN)", "industry": "Biotech & Pharmaceuticals", "revenue": "$10+ billion (USD)", "employer_description": "At Amgen, there is no choice but better.  Because going halfway will never get us to tomorrow. We’re transforming the promise of science and biotechnology into therapies that have the power to restore health. We leverage our global talent—22,000  scientists and professionals—to research, manufacture and deliver new medicines and reach millions of patients worldwide.  Amgen is an equal opportunity employer and will consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status. See our Community Guidelines: http://bit.ly/smcgl", "mission": "To serve patients. \n\nAmgen strives to serve patients by transforming the promise of science and biotechnology into therapies that have the power to restore health or save lives. In everything we do, we aim to fulfill our mission to serve patients. And every step of the way, we ... Read more"}, "Anthem-Blue-Cross-and-Blue-Shield": {"company_name": "Anthem-Blue-Cross-and-Blue-Shield", "company_code": 333127, "website": "www.anthem.com", "headquarters": "Indianapolis, United States", "size": "10000+ Employees", "founded": "2001", "type": "Subsidiary or Business Segment", "industry": "Insurance Carriers", "revenue": "$2 to $5 billion (USD)", "employer_description": "Not provided on Glassdoor", "mission": "Not provided on Glassdoor"}, "Alexion-Pharmaceuticals": {"company_name": "Alexion-Pharmaceuticals", "company_code": 6092, "website": "www.alexion.com", "headquarters": "Boston, United States", "size": "1001 to 5000 Employees", "founded": "1992", "type": "Company - Public (ALXN)", "industry": "Biotech & Pharmaceuticals", "revenue": "Unknown / Non-Applicable", "employer_description": "People living with rare and devastating diseases are our Guiding Star. We believe it is our responsibility to listen to, understand, and change the lives of patients and those who work tirelessly to help them.Our culture is rooted in integrity, inclusiveness, and our dedication to joining and supporting the communities in which we live and work. We invest in and value people who believe in the importance of our purpose and understand what it takes to deliver on it. Alexion has over 3,000 talented colleagues dedicated to serving people living with rare diseases in more than 50 countries around the world. Our global headquarters are based in Boston, Massachusetts and our EMEA headquarters are in Zürich, Switzerland. We also have a Research Center of Excellence in New Haven, Connecticut, global supply chain and operations headquarters in Ireland, as well as local and regional operations in countries around the world. At Alexion, our passion drives us to continuously innovate and create meaningful value in all we do. In doing so, we change lives for the better – ours, people living with rare diseases, and the communities we serve. Every day.", "mission": "Our mission is to transform the lives of people living with rare and devastating diseases through the development and delivery of innovative medicines, as well as through supportive technologies and healthcare services. \n\nBy continuing to deepen our understanding of rare disease ... Read more"}, "Thermo-Fisher-Scientific": {"company_name": "Thermo-Fisher-Scientific", "company_code": 658, "website": "jobs.thermofisher.com", "headquarters": "Waltham, United States", "size": "10000+ Employees", "founded": "1902", "type": "Company - Public (TMO)", "industry": "Biotech & Pharmaceuticals", "revenue": "$25 to $50 million (USD)", "employer_description": "As the world leader in serving science, we empower our people to advance innovative technologies, develop meaningful solutions, and build rewarding careers. With annual revenue of approximately $40 billion and the largest investment in R&D in the industry, we give our 100,000 extraordinary minds the resources and opportunities to make significant contributions to the world.Explore the professional possibilities at Thermo Fisher Scientific, and join us.", "mission": "Our Mission is to enable our customers to make the world healthier, cleaner and safer.\n \nIt’s more than just something that fills our days. At Thermo Fisher Scientific, our work has a purpose. Our work requires passion and creates meaningful outcomes. Our work matters. We’re ... Read more"}, "Aetna": {"company_name": "Aetna", "company_code": 16, "website": "jobs.cvshealth.com", "headquarters": "Hartford, United States", "size": "10000+ Employees", "founded": "1853", "type": "Company - Public (AET)", "industry": "Insurance Carriers", "revenue": "$10+ billion (USD)", "employer_description": "It's a new day in health care.At Aetna, a CVS Health Company, we bring our heart to every moment of your health. Inspired by our purpose and empowered by our bold strategy, we work to redefine the consumer experience and reimagine our community impact. Through our health services, insurance plans and community pharmacists, we’re pioneering a bold new approach to total health. As a CVS Health colleague, you’ll be at the center of it all.", "mission": "We help people with their health wherever and whenever they need us. And we do it with heart. Because our passion is our purpose: Bringing our heart to every moment of your health™."}}