[[{"review_title": "Great company on a mission", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "17 Feb 2023", "job_title": "Managing Director in Singapore", "duration": "N/A", "pros": "Passionate yet humble and down to earth founders.", "cons": "High growth business with ever evolving business strategies has led to the loss of some good employees."}, {"review_title": "Great company and culture", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "9 Feb 2023", "job_title": "Senior Product Manager in Singapore", "duration": "N/A", "pros": "Great co-workers, leads, and team members. Nice benefits for learning and lots available to do. Pantry was awesome. People's team is great, and super supportive all the way.", "cons": "The pandemic prevented a lot of in-person events, which made it harder to socialize outside of work but it is what it is."}, {"review_title": "Great team", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "22 Feb 2023", "job_title": "Client Success Manager in Singapore", "duration": "N/A", "pros": "Team was great to work with", "cons": "No comms for CSM at that time."}, {"review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "16 Feb 2023", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Really nice place with a new workplace now", "cons": "Need to be tougher on non-performers, and ask hard questions."}, {"review_title": "Its ok", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "19 Feb 2023", "job_title": "Product Manager in Singapore", "duration": "N/A", "pros": "Nice culture and dedicated folks", "cons": "Upper management is caught up in too much politics"}, {"review_title": "Disappointing", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "6 Dec 2022", "job_title": "Anoynmous in Singapore", "duration": "N/A", "pros": "Young, vibrant, friendly workforce. Little politics, great selection of pantry drinks and food before they moved over to Block 71. Now it’s just all going downhill", "cons": "CEO fired a bunch of people and appeared all sad and pensive in the public but happily gloats on how much cash flow he now has this and next year during the immediate townhall. Management love to criticize and challenge in the name of making ideas robust, everyone has grand ideas in all directions. Outcome is that working level is completely confused and doing a thousand things. The irony is management team is not affected by retrenchment. All the negative reviews before this is true, read it and make sure it’s fine with you before joining this company."}, {"review_title": "An almost incredible experience and dream job", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "14 Dec 2022", "job_title": "Senior Sales Associate", "duration": "N/A", "pros": "To clarify first, yes I was affected by the layoff, and I should had probably given my feedback whilst in the company but this is for jobseekers. Competitive payout for sales and they do constant review on this which is fantastic. Flexible dress code, Flexible hours( of course with you meeting KPI), Good benefits (AL, food voucher & transport allowance) and i truly believe the Founders are nice, trusting(maybe too much) and sincere even though I see some negative reviews on them here. Truthfully, the company was INCREDIBLE for any hungry sales associate when I first joined, they allowed us to acquire merchants from broad categories while recognising renewal sales from merchants we close, everyday I was excited to wake up looking forward to work ( how many can really say that in their job) to build carousell whilst helping merchants build their business growth with carousell and of course growing my paycheque! It was a dream job! With this system it was almost like i was running my own business and i look forward to close new merchants and renewing them showing them growth on their business. I wanted to stay here till retirement.", "cons": "Just too much went wrong so instead of typing them all out, i advise job seekers must be Extremely adaptable and okay with unfair KPI distribution and non thoroughly thought out major implementations… otherwise take a chance and cross your fingers for the higher end treatment due to negligence in target allocation and expectation. Still a 4 star cause i know founders are trying their best, just unfortunate they hired the wrong management. I truly feel sad."}, {"review_title": "Great culture", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "6 Feb 2023", "job_title": "Partnerships in Singapore", "duration": "N/A", "pros": "Great team culture, frequent feedback cycles", "cons": "Have to seek your own opportunities within the company for growth"}, {"review_title": "Great company to work in", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "28 Dec 2022", "job_title": "Sales Associate in Singapore", "duration": "N/A", "pros": "Founders are very humble and helpful. No airs around them. Flexible work arrangement.", "cons": "The minus 1 and minus 2 come from MNCs and tend to run the company like a MNC. Sometimes I wonder if I am working in a start up or MNC."}, {"review_title": "Good", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "31 Jan 2023", "job_title": "Senior Sales Associate", "duration": "N/A", "pros": "Good welfare given in the company", "cons": "Can't think of any cons"}], [{"review_title": "Carousell", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "26 Jan 2023", "job_title": "Senior Business Development Manager", "duration": "N/A", "pros": "The company provides Good Work Life Balance", "cons": "The company Lacks Profitability in its business models."}, {"review_title": "....", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "29 Jan 2023", "job_title": "FP&A Manager", "duration": "N/A", "pros": "nice work culture, great people", "cons": "highly disorganized management, lack of strategy"}, {"review_title": "senior sales", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "18 Dec 2022", "job_title": "Senior Sales Associate in Singapore", "duration": "N/A", "pros": "flexible working hours, good management", "cons": "fast-pace, still requires a lot of effort"}, {"review_title": "Carousell is great", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "15 Nov 2022", "job_title": "Fullstack Developer in Singapore", "duration": "N/A", "pros": "This company is very challenging, exciting,activating and company culture is energizing.", "cons": "If I have to say, the cons is that there need to be more relaxing place."}, {"review_title": "-", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "6 Dec 2022", "job_title": "Operations Manager in Singapore", "duration": "N/A", "pros": "People are generally quite nice", "cons": "I dont have much comment"}, {"review_title": "amazing company", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "16 Nov 2022", "job_title": "Sales", "duration": "N/A", "pros": "great company, amazing culture and people", "cons": "nothing much negative at the moment"}, {"review_title": "Being part of an Unicorn company", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "25 Oct 2022", "job_title": "Sales Senior Associate", "duration": "N/A", "pros": "Dynamic environment, everyone is so welcoming. Good staff benefits.", "cons": "Not really a bad point actually, company is still on the transition of changing office"}, {"review_title": "Really great company to work for", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "4 Feb 2022", "job_title": "Senior Software Engineer II in Singapore", "duration": "N/A", "pros": "This is the best company I have ever worked for. I joined the company around 2.5 year ago. \r\nI have a really great work-life balance while working here. I got married after a few months joining Carousell and I got a baby girl about a year ago. I was able to spent a lot of time with my family and my working hours has been very flexible. I would say I spent quite a lot of time during the day taking care and playing with my daughter and I work mostly when she is sleeping.\r\nReally good managers. I think I was quite lucky to have a chance to work with very good managers. They gave me advices and opportunities to advance within the company. We have 1 on 1 regularly and generally we discuss about what I want to archive in my career and how to get there.\r\nExcellent team and really smart people. Most people that I worked with at Carousell are very humble and open-mined, making it very easy for the team to discuss conflicting ideas and come up with good solutions.\r\nThe Carousell business is doing very well as well.", "cons": "- No dental benefit\r\n- The interviewing process can be quite long"}, {"review_title": "Think Thoroughly Before You Join", "rating": "2.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "22 Aug 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- Culture is good\r\n- People are nice\r\n- Increase salaries when they see they are paying less than industry standards", "cons": "I hope this review helps you decide whether to join the company or not \r\n\r\n- Leadership team is inconsistent (leaders quit quite often) and is of not top-notch quality except 1-2 folks. You can figure out the kind of questions they ask in meetings, which totally shows they have no experience in this domain\r\n- Ask your HM during the interview, what is the companies strategy, what's the long-term plan. One day they want to become e-commerce for second-hand goods and another day they want to focus on 10 other items \r\n- Old employees/leaders play politics\r\n- They increase salaries to retain employees (Attrition is always high here) but have no processes, structure in design, engineering, data, product \r\n- Company is 9 years old still extremely chaotic, with no processes, no structure, and also growth has been slow. Look at their peers which have grown significantly big \r\n- Leaders do mistakes and don't accept them which is horrible\r\n- No focus on employee growth/career growth framework\r\n\r\n\r\nJoin the company if you - \r\n\r\n- Want to work in a startup that is still finding its overall strategy and is chaotic (okay with high attrition)\r\n- Believe in their vision\r\n- Talk to 4-5 ex-employees of your department and if you're convinced with their feedback then only join\r\n\r\nLot of good reviews on glassdoor surprize vs conversation I have with employees internally"}, {"review_title": "Packed with Politics & Drama", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "5 Sept 2022", "job_title": "Associate Specialist in Singapore", "duration": "N/A", "pros": "Taught me how to survive a political warzone\r\nPlenty of career opportunities for those who are good at the game", "cons": "No work life balance\r\nInsufficient benefits"}], [{"review_title": "Review", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "18 Sept 2022", "job_title": "Corporate Web Manager/Business Analyst", "duration": "N/A", "pros": "Since I am quite new to the company but i do feel that the company culture is diverse and open. Colleagues here are friendly and willing to provide help.", "cons": "No comments yet for the disadvantages."}, {"review_title": "Working Experience at Carousell", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "23 May 2022", "job_title": "Frontend Engineer", "duration": "N/A", "pros": "- Beautiful office and conducive environment for work.\n- Free food. (lunch or breakfast on certain days)\n- Promote self learning to be independent.\n- Promotes sustainability to everyone so we can mitigate the negative environment impacts on earth.", "cons": "- For my role, once I began on the first day at office, I had to set up my computer and also work on tasks simultaneously which can prove quite a challenge. Wish there was 2 days just for me to set up all the software required."}, {"review_title": "Good Engineering Culture", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "16 Aug 2022", "job_title": "Software Engineer in Singapore", "duration": "N/A", "pros": "- Good welfare with well stocked pantry\r\n- Onboarding experience was great and much better than many other organisations I have been at.\r\n- Documentations are sufficient", "cons": "Lack of bonuses and AWS"}, {"review_title": "One of the company to work with in SG", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "21 Aug 2022", "job_title": "Senior Software Engineer II in Singapore", "duration": "N/A", "pros": "Smooth hiring process / onbaording process.\r\nWork Culture is good\r\nNo work pressure\r\nHighly Tech Team members", "cons": "Did not find any as of now"}, {"review_title": "Good culture", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "20 Aug 2022", "job_title": "Manager, Corporate Strategy in Singapore", "duration": "N/A", "pros": "Collaborative\r\nPet friendly office\r\nFast paced environment", "cons": "Slow moving at times\r\nInaccessible office"}, {"review_title": "For Tech People", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "12 Dec 2021", "job_title": "Tech", "duration": "N/A", "pros": "Colleagues are generally nice \nBetter WLB than shopee and grab", "cons": "Not really a con but here there’s no AWS or PB so how serious people take performance appraisals is sorely based on how much they still care to improve. \nTech wise, they use GCP instead of AWS (like i said there’s no AWS :p) so it might take sometime to get used to for the folks in the AWS camp. \n\nThere’s a lot of deprecated and poorly documented/hard to understand code because there’s no hard requirements on code standards. It makes people whom these code are handed over to miserable because they’re afraid to break things if they refactor. In general, very little best practices can been seen here, eg people commit large PRs expecting colleagues to review instead of doing a stacked PR, no formatting checks in auto test etc. It’s hard to push for a change in tech culture because the seniors are resistant. Then again, I guess all these are understandable because it’s not a tech company."}, {"review_title": "Strategy is a mess, directionless leadership", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "13 Oct 2021", "job_title": "Software Engineer", "duration": "N/A", "pros": "You can have a lot of ownership depending on the team and role. Culture depends on the team. Compensation and benefits are ok.", "cons": "Carousell has lost its way. They are trying to do too many things at the same time. Leadership is clueless on the right direction. There are competitors everywhere and it won't be long before they are under extreme pressure. Growth has slowed down and the product has suffered. Leadership keeps talking about using data but only when you have an idea, otherwise data doesn't matter when they want to do something.\n\nInnovation has suffered as a result and you can see that in the product. Very slow vs. other tech companies.\n\nJoin if you are in the early stages of your career to learn some good processes and make some good friends. For senior people, stay away. Lot of people have left and they don't have any idea how to retain the others."}, {"review_title": "Just joined", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "23 Jun 2022", "job_title": "Software Engineer II", "duration": "N/A", "pros": "Friendly people and nice onboarding package", "cons": "Nothing, really just joined so have no idea what gonna happens next"}, {"review_title": "Good company to work for", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "8 Jun 2022", "job_title": "Senior Account Manager in Singapore", "duration": "N/A", "pros": "1. Work life balance\r\n2. Potential to grow and there's always rooms for improvements", "cons": "At the moment I don't have any to share"}, {"review_title": "Generally enjoyed myself there but had better opportunities else where", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "25 May 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- Nice people \r\n- Good team and managers\r\n- Values and culture", "cons": "- Salary can be more competitive\r\n- Employee benefits can be better"}], [{"review_title": "Great company to work for", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "26 May 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Culture! Very collaborative environment, with kind supportive workers. Your ideas are heard and your opinions are always encouraged.", "cons": "Slow career growth especially at a mid-level role."}, {"review_title": "Bad management", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "11 Jul 2022", "job_title": "Account Manager in Jurong West New Town,", "duration": "N/A", "pros": "Not that there is much to say", "cons": "Bad management who dont walk the talk and understand the ground"}, {"review_title": "Hyped up company", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "10 Jun 2022", "job_title": "Sales", "duration": "N/A", "pros": "Flexible with lots of young people", "cons": "Office is super make shift and sub standard with ikea tables and lousy built meeting rooms"}, {"review_title": "Great environment but poor man management", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "9 Jan 2022", "job_title": "Senior Sales Associate in Singapore", "duration": "N/A", "pros": "Great office setting and environment people are friendly in there:", "cons": "Poor man management and don’t give people chance to improve skills and some managers lack of empathy and too focus on KPI instead helping growing employees skills and giving them chance to prove and grow that’s why a lot leave the company."}, {"review_title": "Good office environment", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "9 Jan 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great office setting friendly people and helpful", "cons": "Managers have poor management and leadership skills only care on KPI instead of growing employees skills and doesn’t give employees to grow with company."}, {"review_title": "Very good for growth", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "21 Feb 2022", "job_title": "Software Engineer", "duration": "N/A", "pros": "Awesome place to start as a fresh grad, as you will learn a lot of skills that are very relevant to the modern software industry.\r\n\r\nGreat teammates who are willing to mentor you as well, and a manager that doesn't micro manage at all and is always looking to improve our working experience.", "cons": "Pay is alright compared to some top tier companies."}, {"review_title": "Please consider these points before joining", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "10 Oct 2021", "job_title": "People Team", "duration": "N/A", "pros": "1. Most of the employees here came from worse working environments e.g. Media agencies, toxic local SMEs, Honestbee and hence believe that this grass is a lot greener. If you’ve been through terrible work environments, yes carousell will be (slightly) better. Is it the best place to work in Singapore? Definitely not. \r\n\r\n2. There is autonomy to make decisions that have immediate outcomes and visibility, and on some occasions the founders will be verbally grateful to you for them.\r\n\r\n3. Most people on the ground here are really trying their best to do what they love and work hard. And yes, if you are looking to join the marketplace experience team, or the tech team - you are most likely to enjoy your experience there. Carousell understands that tech is competitive and will do their best to treat tech hires right, not so much for the other departments. \r\n\r\n4. In some departments, there’s a good culture of fun and team bonding. Carousell is intentional about spending time together and bonding, and there will be budget for this too.", "cons": "1. The Carousell group acquired 4 companies over the years - OLX (Philippines), Mudah (Malaysia), Chotot (Vietnam) and OneKyat (Myanmar). There is a lot of mess and neglect in this process and the founders are struggling to understand how to manage them, most people here complain of being overworked, underpaid and under-supported way more than their Carousell counterparts.\r\n\r\n2. Management - the Glassdoor reviews that you read here are true. Even though most of management came from affluent and long standing histories of experience, most of them just want to oppress their reports. They know nothing and want to be treated like royalty - you will be asked to book meeting rooms for them, teach them how to record on zoom/order food on foodpanda, buy things for them and much more. (To be fair, most of the things experienced are in the People team - high turnover rate a clue?) You will be shocked at how they can say words with no accountability and tact, despite their “experience”. The founders are much younger than most and clearly struggle to manage them - all these incidents mentioned were bought up to the founders and no action taken, resulting in employees resigning because they gave up hope. \r\n\r\n3. As much as they seem to look corporate and SME-like, most people here will admit that it’s still very much like a start up. Little to no processes, constant change in systems and poor communication downstream. \r\n\r\n4. There is a deep systemic resentment towards salary. The context is as a startup, most employees who have been there for years received start up pay. Only up till a year ago, the management decided to pay competitively to new hires and that’s when the bitterness and comparison arose. Imagine only getting half or less of the salary of your counterpart and doing the exact same work - as much as this is common, Carousell is not an MNC and it doesn’t come with any MNC benefits. \r\n\r\n5. Burnout culture: is real here. As much as the people experience team tries to sell “work life balance” and “Wellness Wednesdays”, they don’t actually live it out themselves. You will see the team reply to slack or send emails at 12am-1am, people are angry and uncooperative and being told they lack resilience when they are being pushed to breaking point at work. There is deep mistrust for managers as most of them are deemed inexperienced or incompetent. The people team try to mitigate but everyone can tell that they are struggling with their own manager, too. When asked, most of them are on the lookout for better opportunities and said that they will leave in a heartbeat if the opportunity presents itself."}, {"review_title": "Manager have no clue on how to run a company.", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "15 Jan 2022", "job_title": "Sales Manager", "duration": "N/A", "pros": "No dress code and nice office", "cons": "Culture: Management like to talk about how important they put people first. FYI the ‘people’ is the founders, management and ppl they like. Founders  like to appear and talk during townhall, but when it comes to execution it is zero.\n\nHiring the wrong people to do the wrong thing. \n- Do note that a lot of ppl they hire are ahbeng and ahlian that cant even speak properly. Most management are uncle aunty that have load of experience but have no clue how the tech and marketplace works. \n\nCompany still not profitable.\n- Imagine in the market for 10y and still losing money, this tells you how bad the company is doing. A lot of the verticals are still losing money until today. Since management are bunch or uncle and aunty, their idea of making money is to increase price of their subscription and ads for those verticals that are doing well.\n\nToxic Culture\n- lots of politics in the company always regarding who the management likes and dislikes. For a company that is not profitable to have too many managers within a department. A lot of the associates they hire are ex-colleagues of the manages, and managers will prioritise these colleagues in terms of job assignment and promotion. \n\nIncompetent staff\n- a lot of their managers are too incompetent. Asked their project manager a question and took him 2 weeks to answer me. He will organise a Q&A session with us, but its all questions since he cant answer us and can only note down those questions we asked and nvr answer us.\n\nFounder is not taking this seriously.\nThey will come in office and chitchat with everyone like they are close friends. Talk like Steve Jobs during meeting and town halls but no have idea on execution and neither do they care."}, {"review_title": "Wonderful team to work with! Humble culture indeed, everyone is so rooted and kind to help each other.", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "21 Feb 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great culture, great perks. Work life balance. Flexi work hours.", "cons": "None I can think so far yet"}, {"review_title": "Culture is great but dont forget the tangibles", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "29 Nov 2021", "job_title": "Finance", "duration": "N/A", "pros": "Flexible hours\nGood culture that tolerate making mistakes (and learning from it)", "cons": "No performance bonus - this really limits the ability for manager to reward team members who is probably not eligible for promotion yet.\n\nToo much autonomy seems to be given to Tech to the point that they can hold the Company to ransom for Company wide projects"}], [{"review_title": "Carousell company", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "7 Mar 2022", "job_title": "Senior Sales Associate in Provo, UT", "duration": "N/A", "pros": "Awesome, accommodative, trustworthy and genuine great seller to transact with.", "cons": "Mostly second hand items are sold."}, {"review_title": "Tech driven", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "13 Feb 2022", "job_title": "Senior Director, Engineering in Provo, UT", "duration": "N/A", "pros": "Tech driven company, strong focus on business goals and projects", "cons": "None as of now, so far it's fine."}, {"review_title": "Education Qualification over Experience", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "9 Dec 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Managers operate on growth mindset. Learning is a two-way street.", "cons": "HR seem to think that qualification trumps experience every time. Should’ve been case by case but they don’t seem flexible enough. $500-800 difference pay from your colleague who has the exact same job scope as you is not very motivating."}, {"review_title": "Not a great place to work", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "2 Nov 2021", "job_title": "Human Resources in Singapore", "duration": "N/A", "pros": "They have flexible hours to work and inter-team mobility is available after a while. Talented teammates.", "cons": "- Culture: They talk pretty highly of their core values, but once it trickles down to following them, it's no where close. \r\n\r\n- Management: What they say is always right and they favor their own references and ex-colleagues when it comes down \"trust\". Personally, they don't treat HR folks as a business too so, HR opinion is the last opinion or better still \"no opinion required\" category. Highly bureaucratic/ political and very traditional in their approach and highly judgemental as leaders. \r\n\r\n- Attrition: a pretty high double figure attrition and a lot of people have left in HR /Tech/ product teams, clearly because they felt less heard or the leaders didn't work too hard to retain talent. Try avoiding \r\n\r\n- Interview process: is long, very long, very very long. They want to compete with FAANG company process but pay you peanuts in salary. They are always depending over budgets.\r\n\r\nPeople team and TA team have maximum attrition this year, they say \"i hear you\" and ask you to move on. very insensitive even though they pretend to sound concerned and neglect you after sharing concerns.\r\n\r\nOverall as an organisation, the co-founders pop up during townhalls to talk about company performance but very less invested in people and they go quiet on decisions for people. They may hear you out but they don't care to action out probably max assign your managers to deal with your issues. In that matter, none of the management really cares to hear about your concerns, it's too fake to be honest. So unless, you are a reference or you know some leaders well - you are bound to grow slowly in this space, highly biased in decisions and very likely to hear you out but not provide any solution or leave it to the managers to take biased decisions.\r\n\r\nP.s. Carousell is more responsive on glassdoor than actually solving problems internally."}, {"review_title": "Long working hours", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "30 Nov 2021", "job_title": "Data Analyst in Singapore", "duration": "N/A", "pros": "- some really good talents in the company.\n- great opportunity to learn skills from these talents.", "cons": "- alot of unnecessary meetings.\n- biased allocation of funds and resources into certain departments, and it stifles the growth of other teams.\n- prepare for long working hours as a norm.\n- turnover rate is rather high. Talents leave for other opportunities quickly."}, {"review_title": "Good learning experience but toxic working culture", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "13 Jan 2022", "job_title": "Marketing Executive in Singapore", "duration": "N/A", "pros": "- Open pantry\n- Start up culture\n- Fast paced, perfect for a fresh grad", "cons": "- A lot of office politics\n- Immature management\n- Poor benefits"}, {"review_title": "Average company", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "26 Jan 2022", "job_title": "Data Analyst in Singapore", "duration": "N/A", "pros": "Good culture and you can expect to make friends there", "cons": "Questionable leadership and questionable career progression path"}, {"review_title": "Great environment, Great People", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "10 Jan 2022", "job_title": "Manager in Singapore", "duration": "N/A", "pros": "- Young and Energetic company\r\n- Friendly environment\r\n- Flexibility", "cons": "- Too many systems and not integrated with each other"}, {"review_title": "Supportive Community", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "6 Dec 2021", "job_title": "Intern in Singapore", "duration": "N/A", "pros": "Teammates readily welcome you and assist you in the familiarisation and onboarding process. Interview and hiring process was swift and formal.", "cons": "None that I can identify."}, {"review_title": "Key Account Manager", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "26 Sept 2021", "job_title": "Key Account Manager", "duration": "N/A", "pros": "- 18 days AL (depending on Job Grade)\n- Work life balance\n- Chill bosses who always listen and never micromanage\n- Colleagues are helpful to answer your question and guide you\n- 50% mobile claim\n- The usual medical and dental benefits", "cons": "None i can think of now!"}], [{"review_title": "millennial young and fun company", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "13 Dec 2021", "job_title": "Senior Sales Executive in Singapore", "duration": "N/A", "pros": "organised structure\r\ncolleagues are all helpful and willing to teach", "cons": "none i can think of yet"}, {"review_title": "A good local company to work for! Supportive culture and lots of community events", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "20 Jun 2021", "job_title": "Senior Sales Associate in Singapore", "duration": "N/A", "pros": "Good company to work for, supportive managers who help to fight for realistic targets with the upper management. Fun events throughout the year to build community among employees. Good company benefits.", "cons": "Upper management may set high targets on certain months which may leads to unrealistic expectations on hitting the monthly sales targets, causing unnecessary stress from month-to-month."}, {"review_title": "Hiring Process", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "9 Nov 2021", "job_title": "Anonymous Employee in Singapore", "duration": "N/A", "pros": "Quick and efficient process. Interviewers were knowledgeable and willing to share experiences", "cons": "None noted for the cons"}, {"review_title": "Collaborative work culture, company with a heart for people", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "25 Jul 2021", "job_title": "Recruitment Consultant in Singapore", "duration": "N/A", "pros": "Highly engaging and pro people culture culture. Carousell is one of the few companies that I have worked for that really put employees' interests first.", "cons": "Certain processes could perhaps be better refined."}, {"review_title": "Job Review", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "12 Oct 2021", "job_title": "Senior Sales Associate in Singapore", "duration": "N/A", "pros": "Thumb up for the company", "cons": "none of it to comment"}, {"review_title": "Good company", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "8 Oct 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Good benefit and good environment", "cons": "Pay is not as competitive"}, {"review_title": "Great culture, amazing people, inspiring domain", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "19 Sept 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great culture, amazing people, inspiring domain", "cons": "None that I can think of"}, {"review_title": "Great company and product. CEO has vison and is  approachable", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "10 Aug 2021", "job_title": "Senior Account Manager in Singapore", "duration": "N/A", "pros": "Great company and product. CEO has vison and is approachable", "cons": "too much restructuring going on"}, {"review_title": "Great place to be at", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "27 Aug 2021", "job_title": "Finance Manager in Singapore", "duration": "N/A", "pros": "Great culture in the team and cofounders\r\nFast paced environment and constantly new projects", "cons": "None so far as I love it"}, {"review_title": "Good co bt bad team", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "27 Aug 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Flexible and chill environment, good office layout", "cons": "No team communication, manager not supportive"}], [{"review_title": "Great place to work at if you want to be close to the product", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "5 Jun 2021", "job_title": "Anonymous Employee in Singapore", "duration": "N/A", "pros": "- Autonomous, your voice is heard as long as you back it up with data\n- Anyone can be talked to, regardless of where you’re at geographically or organisationally", "cons": "- Compensation could be better\n- Senior level managers should encourage more side-project initiatives"}, {"review_title": "Good", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "29 Jul 2021", "job_title": "Sales", "duration": "N/A", "pros": "Company has flexible working hours and usually just take an hour out of your whole day.", "cons": "Company is commission based, with no fixed salary.\nAnnoying customers to work with.\nThat's all."}, {"review_title": "Good Culture", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "8 Jun 2021", "job_title": "Anonymous in Singapore", "duration": "N/A", "pros": "• Before covid will have a buffet for lunch every Friday/ Big events (Christmas, Townhall for important announcements, Halloween, etc)\r\n• Very friendly founders\r\n• Friendly, easy to approach, and helpful colleagues\r\n• Never experience office politics while I'm there\r\n• Weekly updates on company performance & initiatives", "cons": "cant think of a very bad one"}, {"review_title": "Account Manager", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "10 Jul 2021", "job_title": "Account Manager in Singapore", "duration": "N/A", "pros": "- Great team\r\n- Openness in culture, making mistakes and learning from them\r\n- Strong leadership", "cons": "- Targets can be quite high sometimes (unrealistic)"}, {"review_title": "Meh", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "22 Jun 2021", "job_title": "Associate Specialist in Singapore", "duration": "N/A", "pros": "- Flexible hours\r\n- Colleagues are friendly", "cons": "- Have only 14 days of leave\r\n- Competitive within department\r\n- Political culture"}, {"review_title": "good", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "25 Jun 2021", "job_title": "Tuition Teacher in Singapore", "duration": "N/A", "pros": "carousell is a superb platform", "cons": "do not have big problems"}, {"review_title": "Good place to work", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "31 May 2021", "job_title": "Marketing in Singapore", "duration": "N/A", "pros": "Nice colleagues, supportive and collaborative working environment", "cons": "Management doesn’t know what to do"}, {"review_title": "Good place in the first couple of years", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "21 Apr 2021", "job_title": "Strategy and Corporate Development Analyst in Singapore", "duration": "N/A", "pros": "Lots of responsibility and great people", "cons": "All the great people left and management hired a bunch of new people from large corporations, which brought bad culture."}, {"review_title": "First Job, Best Job", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "18 Apr 2021", "job_title": "Data Analyst in Singapore", "duration": "N/A", "pros": "Awesome place to hit the ground running and create impact.", "cons": "Moves like a rocketship, fast-paced, messy and tiring"}, {"review_title": "Interesting place to work in", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "12 Apr 2021", "job_title": "Creative Content Senior Associate in Singapore", "duration": "N/A", "pros": "Everyone seems very friendly\r\nThe onboarding process was very smooth", "cons": "No Cons at the moment"}], [{"review_title": "Fast but lacks strategy", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "15 Feb 2021", "job_title": "Marketing in Singapore", "duration": "N/A", "pros": "- fast development\r\n- quick iterations\r\n- strong growth", "cons": "- lack of strategy\r\n- lack of strong retention of management"}, {"review_title": "Toxic culture", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "6 May 2021", "job_title": "Business Development Manager in Singapore", "duration": "N/A", "pros": "$30 meal allowance every month", "cons": "Management micro managing staff and hiring the wrong people"}, {"review_title": "Good company", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "8 Feb 2021", "job_title": "Managing Director in Singapore", "duration": "N/A", "pros": "Passionate hard-working founders. Good culture.", "cons": "Still dealing with start up challenges"}, {"review_title": "No better Company", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "3 Oct 2020", "job_title": "Technician in Singapore", "duration": "N/A", "pros": "great founders, culture, people, location", "cons": "N O T H I N G"}, {"review_title": "Poor leadership, but nice peers", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "14 Sept 2020", "job_title": "Anonymous Employee in Singapore", "duration": "N/A", "pros": "Nice peers to hang out and talk to. Hardworking, down to earth and honest.", "cons": "One of the poorest leadership I have seen in a tech company."}, {"review_title": "Making Magic at Carousell", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "16 Sept 2020", "job_title": "Sales Enablement Specialist in Singapore", "duration": "N/A", "pros": "Positive vibes all day every day, where we care deeply, solve problems together, and stay incredibly humble.", "cons": "With Covid, it's impossible to all meet in person!"}, {"review_title": "Great place to work at", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "2 Oct 2020", "job_title": "Business Development Manager in Singapore", "duration": "N/A", "pros": "Family culture embedded in the team", "cons": "onboarding process may be abit slow"}, {"review_title": "Lacks transparency, no focus on employee retention or career growth", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "16 Jan 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Flexible work environment, young and energetic team, collaborative, stocked pantry, free lunch on friday, pet-friendly, company has a good name for now and is growing quickly so looks good on the outside.", "cons": "Founders have tunnel vision and are only focused on growth. Being a startup, it is understandable if the founders have no experience managing or leading a team, however it doesn't seem to be a focus for this company to learn how to do so properly even though founders seem to want to scale up the team extremely quickly.\r\n\r\nAfter a while, employees will begin to realise that personal career growth is stagnating as well as founders have no system of appraisal or plan to help level up employee skills. This is especially a problem as founders have an extreme bias towards hiring many interns and fresh grads with no experience. \r\n\r\nEmployee satisfaction is not a priority and there is a severe lack of transparency on how decisions are made, how compensation is awarded, what stock options are portioned out, future plans for company and so on. Employee opinions are also rarely taken into consideration in bigger decisions. Decision-making is top-down 80% of the time even if employees voice out concerns. The \"grown-up\" conversations and decisions are made by the founders only. Not as flat as it's made out to be."}, {"review_title": "One of the best work place in SG", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "18 Jul 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "-Missions & values are very clear\r\n-People are passionate & dedicated to their work\r\n-Nice office with warm vibes\r\n-Lots of new and cool projects to work on\r\n-Performance driven company\r\n-Pantry always full of snacks and drinks\r\n-Many events organised at our office. Alway something is happening here\r\n-Every Friday, we have updates about the company -> transparency", "cons": "OK i read some of the previous negative reviews and i think it's not fair and unjustified.\r\nCarousell has surely lots to do to improve, not the perfect company yet but everyone is working really hard to build and make it a successful one.\r\nJust like every startup at early stages, there are lots of uncertainties, challenges to overcome and difficult decisions to make, so yeah, Carousell is not a good place for the faint hearted"}, {"review_title": "good culture", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "17 Jun 2020", "job_title": "Production", "duration": "N/A", "pros": "fast paced, good culture and hiring many experienced seniors to shape and guide the future", "cons": "reorganisation happens frequently but expected of a growing company"}], [{"review_title": "Best place for people who want to see impact of their efforts at work", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "25 Jan 2017", "job_title": "Vice President International in Singapore", "duration": "N/A", "pros": "High impact work, from customer support to finance to engineering, others can see clearly how your work impacts the users & company. \n\nTeam is relatively small and lots of information is shared, giving employees full understanding of the business. Great if you eventually want to build your own startup. \n\nPeople are incredibly diverse and interesting - I thought I'd be joining a very Singaporean startup but was glad to see how there's so many nationalities and people from all types of backgrounds. \n\nProduct focused company that tries to solve things with good product , design and engineering. Strong appreciation for scalable engineering efforts and good design across the company.", "cons": "Plenty of new priorities crop up as it does with startups, so employees need to be comfortable with changes and also be willing to find creative solutions to make things happen with limited resources. \n\nHours can be long. So if spending some evenings and ocassional weekends working is not your thing, this isn't a good place for you."}, {"review_title": "Nice company", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "30 Jun 2020", "job_title": "Software Engineer in Singapore", "duration": "N/A", "pros": "Not stressful, \r\nFlexible management,\r\nCode review,\r\nCompany believes employees", "cons": "Legacy code, but improving\r\nSalary not very high"}, {"review_title": "Dubious and questionable management practices", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "3 Jun 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Some very talented individuals who are genuinely passionate about the business", "cons": "- Laid back executive team, the founders work very very hard, the rest of them seems to be just there for the stock options, easy time and opportunity to travel around asia. Lack of discipline and focus\r\n- Only people who gets promoted are the people in the executive team or their directs who are close with them! When communicating dismal results, in the same breath also announce promotion of executive member RESPONSIBLE for that result.\r\n- Very political environment. If you agree with executive team, you are safe even if you do not perform. However, if you disagree or do not 'suck up' like the rest, you are in danger zone.\r\n- Do not recognize talent and passion. Discriminatory.\r\n- Change strategy every quarter, executive team seem to think that there is a contradiction between monetisation and user experience so keep jumping from one to the other."}, {"review_title": "I still love this place to bits, even if some parts aren't shiny", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "10 Mar 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "-Everyone understands their purpose and how the company functions as a whole\r\n-No dress code\r\n-People a fun to work with!\r\n-You can learn a lot more than you'd expect, it just depends on what you want to take back at then end of the day", "cons": "-Growing pains are slowly being addressed and some of us do get impatient, however it's good to note that everyone has good intentions, we just bite more than we can chew sometimes.\r\n-Depending on your situation and your personality, you may or may not fit in well.\r\n-Required to have much initiative and energy if you want to thrive."}, {"review_title": "Fake", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "There is no dress code.", "cons": "Management is very unprofessional. I've read the positive reviews here and I advise anyone reading to exercise caution. Founders will do anything to get people into the company but once you are in, you may (or may not, if they like you. favouritism is STRONG here) be taken for granted. \r\nLittle is done to aid in personal growth for full-time employees. Additionally, you are expected to devote your life to improving the product. Nothing wrong with that, except that your feedback is irrelevant to them. And when you do give feedback, sometimes you will be met with the response along the lines of 'if others can do it why can't you?'. i.e. Do as you're told.\r\nAlso, management will never admit their shortcomings. You will never hear of a feature not living up to expectation or a management decision falling through the cracks. There is no transparency for the employees. \r\nFounders will also claim that Carousell has a great culture. Trust me, it isn't so great. The only culture I have experienced here is the bashing and ridiculing of competitor (and other) companies.\r\n\r\nRosy on the outside; rotten inside."}, {"review_title": "needs improvement", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "* relaxed dress attire\r\n\r\n\r\n* nice colleagues \r\n\r\n\r\n* young team \r\n\r\n\r\n* well-stocked pantry\r\n\r\n\r\n* free food on friday\r\n\r\n\r\n* our own office \r\n\r\n\r\n* good company business idea", "cons": "* founders are inexperienced and sometimes make decisions that upset employees, even after feedback \r\n\r\n\r\n* product focus lacks prioritisation on core experience of the app. Usually striving for quick fixes and deprioritizing the daily issues users face which requires significant engineering effort to fix\r\n\r\n\r\n* think the founders are also not allocating resources properly. like marketplace quality is very important but lacks engineering support, same goes for customer experience and community\r\n\r\n\r\n* transparency is also an issue. founders are always vague where compensation is concerned\r\n\r\n\r\n\r\n* lack of professional growth for some departments. for instance, community support don't have a career trajectory. team is small and too busy fighting the high workload every day to think about career growth"}, {"review_title": "Limited Growth Prospects", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "24 Apr 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "There comes a point in your career when you’ll have to decide for what and whom you’re willing to work. Carousell unfortunately, despite its potential, is still far from reaching true innovation. And it’s certainly not because of the people. You’ll meet product managers, designers, engineers and marketers who want to contribute and have the talent to do so. Unfortunately, incompetent director lacks the vision and drains all creativity and brilliance from the “squad”. \r\n\r\nSome perks that you can expect working at Carousell: \r\nSnacks\r\nFree Lunch provided on Fridays \r\nWFH optional once a week (dependent on team)\r\nNice people to work with", "cons": "Hiring incompetent director who lacks the understanding of what it means to strategise. Pushing features out quickly and hoping to gain adoption won’t work. Listen to your employees. If the majority of your team is asking you “what’s the strategy/roadmap?” and that strategy needs to be reworked, then try it. After all, if learning from failure is such a big part of company culture, what could be the harm?"}, {"review_title": "No growth prospect", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "6 Jun 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Friendly team. Free breakfast every morning from the managers", "cons": "Promotes the incompentent, ignores the competent and fires the performant!\r\nMost senior executive gets promoted and its like promoting a prime minister.\r\nCreates non-existing roles just to fit favorite \"personal\" close friends\r\nSenior team hands are not dirty, keep hiring more senior people and everything gets funneled down to the small number of worker bees\r\nManagement do not have ownership, when successful, there are alot of celebrations and back patting at the top. When we fail, its always because of certain fault of the junior people.\r\nSexist. Male management who only pay attention to each other and talks down to females\r\nCelebrates failure\r\nSet all the teams up for failure by not knowing how to set realistic goals and insist on impossible numbers\r\nFounders have no idea how to run the business\r\nAlot of senior people do not even use Carousell"}, {"review_title": "Great working environment and many opportunities to learn", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "1 Feb 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "You get to own your own projects and really take charge and execute them.\r\nLots of freedom in exploring, and hence lots of learning opportunities as well. How much you want to learn is really up to you to go grab it. \r\nThe team is pleasant and culture is accepting and fun - alot of my outside friends are envious of this! \r\nFast paced growth as well, so if growth and new challenges to tackle and solve daily are your thing, this is the place to be!", "cons": "Things move fast here like in most startups - so be prepared to adapt quickly. If you are the kind that hates changes or don't like adapting to new things all the time, this may become stressful for you."}, {"review_title": "Full time", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "13 May 2018", "job_title": "Anonymous Employee in Singapore", "duration": "N/A", "pros": "-Awesome co-workers who are passionate about the company and makes job bearable\r\n-Free catered lunch every friday", "cons": "-Very hacky and inefficient processes. I understand it is a start-up but some practices are questionable\r\n-Unclear promotional criteria or even pay raise. Very hush hush nature, even managers not clear on how to recommend staff for promotion\r\n-Useless employee feedback system. There is an anonymous system in place where you can voice out grievances but no actual follow up done \r\n-Unorganized upper management and leadership team"}], [{"review_title": "Only look good on the outside", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "29 Dec 2015", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Big investor names, Seqouia, 500 Startups.\r\n\r\nFree food every friday\r\n\r\nFriendly colleagues.\r\n\r\nPet friendly, but they can cause a disturbance at work", "cons": "Employee's work here is undervalued. Founders believe in passion, and do not believe that employees need anything more than that. i.e. wanting you to think like them without offering competitive benefits. Company's funding is significant but not reinvested in existing employees compensation and skills to reward them for their work. The early employees who work the hardest are seldom appreciated.\r\n\r\nIdeas and feedback from the employees are also not listened to. Founders appear to welcome feedback but the truth reveals itself over time.\r\n\r\nProduct has the ultimate priority. Staff's personal plans have to change because the company needs to grow. There's no respect for personal time."}, {"review_title": "A company united by its mission - unicorn in the making", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "5 Jul 2017", "job_title": "Marketing Executive in Singapore", "duration": "N/A", "pros": "Culture\r\n1/ free to experiment and try out new things\r\n2/ it's okay to make mistakes, just need an action plan to solve them\r\n3/ carousell has a homely, family vibe\r\n4/ transparent with data and direction\r\n\r\nOffice perks\r\n1/ it's pet-friendly, we love to hang out with your dogs, cats, and hamsters\r\n2/ quarter tech detox - company event outside of the office\r\n3/ entertainment available: pool table, foosball, ping pong table, pandora arcade box, xbox kinect and BYOG\r\n4/ casual dress code - like any other startups, as casual as you want\r\n5/ you get to become a Carousell admin - mainly bragging rights", "cons": "Talents\r\n1/ started with a lot of fresh graduates; need more senior folks and middle management (Contrary to popular belief, this does not inhibit your learnings as a junior/newbie. experience comes from doing rather than listening)"}, {"review_title": "A fun and great environment to work in", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "18 Dec 2015", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- humble bosses and team mates\r\n- lots of flexibility given \r\n- work hours flexibility\r\n- room for growth and personal improvement\r\n- trust, ownership and autonomy given with job scope\r\n- health benefits, free food from pantry & free lunch every friday \r\n- team retreats & outings \r\n- personal guidance and coaching from founders and leads \r\n- pet friendly \r\n- great company culture\r\n- great team mates to work with \r\n- flat hierarchy", "cons": "none that I can think of"}, {"review_title": "Build something meaningful!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "5 Jul 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "• There are plenty of opportunities here at Carousell. It really boils down to one's pro-activeness to reach out for these opportunities to grow.\r\n• You also gain knowledge from experienced colleagues and an open sharing culture is emphasised.\r\n• Founders and leadership team are also very approachable.\r\n• The team is driven by mission to fill our users’ lives with meaningful experiences, and this helps to drive the focus of day to day work.\r\n• Company is growing at an exciting pace with tremendous room for more and more growth.\r\n• Personal experience working here is very positive.", "cons": "As with any fast growing company, a growing team means more communication overhead. Depends on how one wants to look at this, it all boils down to being deliberate about communication as more and more people come on board."}, {"review_title": "Startup that let's you grow", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "11 Oct 2018", "job_title": "Product Designer in Singapore", "duration": "N/A", "pros": "+ As a product person, you are put up with problems to solve and you work with people who challenge you and make you arrive at the right solution \r\n+ Everyone in the company cares about users. Good data/research findings help you win over the stakeholders fast. \r\n+ People are genuinely nice. Being an expat, it's a nice feeling to be in a place where people talk to you and help you out if you need anything\r\n+ Executives are inspirational. Just manage to catch up with them every now and then.  There are days where I was feeling demotivated and having a simple chat with one of them helped me to feel positive about myself and what I'm doing for the company \r\n+ As a designer, you get to do extensive research visiting markets and talking to real users. The design team is humble and yet smart at what they do. They are ready to help you out if you are puzzled, but autonomy is encouraged for you to explore on your own. \r\n+ Bonus: VP of Product is super cool and he makes excellent cocktails 😄", "cons": "- Carousell is not for everyone. It's a startup that has growing pains like other startups, but that's what makes it a good place for people to grow. The working life is not linear and there are some days you need to improvise on your role to get things done. \r\n- Manage your time better or end up stressing yourself out. The culture is very chill that there are no strict office hours and you can work from home. But if you are not careful, you will find yourself working on the weekends/weeknights because work is interesting. \r\n- When I was there, the leaves were low. As an expat, this was challenging because I had to plan vacations + visit home\r\n- There will always be the things that could be better or could be improved. Don't think of them as cons/negative, but speak up and see it getting improved :)"}, {"review_title": "Great team with great potential", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "12 Nov 2018", "job_title": "Product Designer in Singapore", "duration": "N/A", "pros": "- People are committed and motivated.\n- Lunch every Friday.\n- Transparent culture\n- Friendly people", "cons": "- Too much time spent in meetings. Not everything needs to be dragged for a couple of hours. Meetings could be made more streamlined and efficient.\n\n- Not really a con as its understandable at this stage of the company but very few annual leaves."}, {"review_title": "This place will drain you eventually", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "2 May 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Flexible working arrangements. Work from home, flexible working hours schemes which are subject to team manager\r\nCasual dress code\r\nGood people operations and IT ops team who ensure things are running smoothly. Many efforts to organize events for employee welfare and improve workplace functionality.\r\nFamily oriented with progressive values.\r\nTalented peers.", "cons": "Top-heavy structure. Management spends more time navigating power dynamics and politics. Very ineffective as no one wants or can step forward to make the ultimate decision since there are so many stakeholders. Junior levels are carrying the brunt of poor management decisions and cleaning up the mess. Management's questionable solution to this is to hire someone even more senior or create new upper management tiers. The circle repeats itself all the way up to C-suite. \r\n\r\nIncompetent middle managers. Managers don't just manage the job, they are supposed to manage the people doing the job. This differentiates them from the specialist route. But team building and mentorship capabilities sorely lacking. High attrition rate due to lack of career development and growth. \r\n\r\nWeak management. Has lofty goals but incompetent at strategy and foresight to plan ahead. \r\n\r\nSome founders and upper management do not respect the work you do and make ignorant demands even though it is out of their area of expertise.\r\n\r\nManagement is very good at fluffing to paint a rosy picture. Hides their head in the sand when it comes to acknowledging and addressing critical problems. When issues are brought to their attention, reactions are usually very defensive like take it or leave it or unless you have a solution don't raise it. Transparency and differing views are openly encouraged but don't fall for this. Check previous reviews who can vouch for this. There will be blowback. Many managers cannot handle feedback that doesn't sound good and will start subtly going against you in passive aggressive ways."}, {"review_title": "Undergoing Transition, but There's Good Potential", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "11 Jan 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- Good fundamentals with a core user focus. Most employees genuinely want to do a good job and are not corporate-y. Unique culture, which makes one happy to go to work with like minded individuals.\r\n\r\n- Strong potential to take extreme ownership of issues, and to drive them. People, including bosses are supportive. Just need to be entrepreneurial about it.\r\n\r\n- Join if you want to learn fast, and by doing. There are a lot of opportunities to make a difference, and you can work across the teams, and there are no dogmatic rules to stop you.", "cons": "- Managers can tend to be quite jumpy and reactive at times. Most have not worked with complex organisations or managed a large team before, so the resilience of the organisation and potential to develop employees has not caught up. \r\n\r\n- Ownership of initiatives can be lacking when it is unclear, which are missed opportunities. Some employees seem to lack a broader, company-level perspective and may not have the best set of capabilities to effect change. \r\n\r\n- This scale-up company that is undergoing a transition is not for everybody. Join if you want to make a difference. If you prefer a very structured environment and cannot roll with the punches, you will get frustrated."}, {"review_title": "Swift & Decisive", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "22 Jun 2019", "job_title": "Digital Marketing Executive", "duration": "N/A", "pros": "Went through 4 layers of the interview process within 3days; \r\n1. Web F2F with HR \r\n2. Introduction to Team Manager (F2F) + Excel Test \r\n3. Interview with Team Manager & Team Members (F2F) \r\n4. Co-Founder Round (F2F)\r\n\r\nI was offered the position 5 hours after the Co-founder round. \r\n\r\nCulture vibes are awesome, people are very nice and steer more to the positive side. Things move very fast and the ability to stay nimble is very much appreciated. Be open-minded and you will appreciate the work environment. Its also a flat hierarchy and everyone's opinion is encouraged.", "cons": "Transparency of expectations between team manager & teammates."}, {"review_title": "Was one of the best Culture in Singapore. Somehow turned upside down.", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "30 Apr 2019", "job_title": "Software Engineer", "duration": "N/A", "pros": "Talented colleagues but many left.\r\nYoung employees, fun to play with.\r\nFlexible working time.\r\nSmall scrum team, moves fast and easily senses impact in your work.\r\nInspiring CEO", "cons": "No clear performance review. Some people staying with the same title same job same pay for a long period of time.\r\nEngineers are not recognized for their works. Promotion keeps going to managers and those who are close with managers. \r\nValue managing skills over technical.  \r\nTry to push engineers for a lot of new features. Engineers are frequently OT but are not treated fair."}], [{"review_title": "INCOMPETENT STAFF", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "8 Jan 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Free food & drinks on Friday", "cons": "Apparently head of sales typically have no ideas of running the show. When was told to brainstorm ideas to achieve targets, all they can say is not workable. They themselves have no knowledge at all to run the business. Distribution of sales accounts wasn't fair at all. Gossips are at all time high. Other departments have politics among themselves & play hierarchy. That is why turnover rate is super high. Hence overall 2019 performance was doing badly."}, {"review_title": "Not for the faint-hearted", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "5 Nov 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "You can drive a big impact for users. There's a big difference when you work in a company this size, versus working in companies with thousands or even hundreds of thousands of people.\r\n\r\nPeople are working to make things better across the company - from Tech to Monetisation and many other teams. We are improving our practices and documentation etc. There are also new leaders to help guide us in the right direction. But I don't think we should be expecting big changes overnight. Many changes will take time because there are long-standing issues to solve. But at least we are moving in the right direction.\r\n\r\nWe work in a casual environment that offers a lot of flexibility. Not as many restrictions as compared to other companies. Most managers give people the freedom to lead and drive projects. \r\n\r\nMost people you will meet here are young, energetic and passionate about their work. This energy is needed to keep up with such a fast paced environment. But this can be a double edged sword, as some of them do not have the maturity that comes with experience and also age.\r\n\r\nThere are other perks like free lunch on Fridays, well stocked pantry etc. Small stuff but makes the experience better.", "cons": "After reading some of the past reviews, you can guess how challenging our environment is. Some of the reviews written before are kind of unreasonable though. It feels like an overgeneralisation and exaggeration of many issues. Nonetheless I agree with some of the points that were brought up, including having better direction and more open communications. \r\n\r\nI feel that the no 1 issue is communications. Everyone will benefit if we can all be better communicators, from the top all the way to the bottom. And communications is a 2 way street. Management should be more transparent and share more with us, but we on the receiving end should also be receptive to new info and changes."}, {"review_title": "A great place to work in", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "3 Dec 2015", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- fun and relaxed environment with young and talented colleagues\r\n- nurturing and collaborative \r\n- opportunities to learn from one and another and across various functions\r\n- dog-friendly\r\n- focus on building a quality product", "cons": "- you lose track of time when you are working at Carousell"}, {"review_title": "enjoy working here!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "15 Jan 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "fun and young team, great company culture, experimental approach and mindset, a lot of autonomy! founders genuinely care for staff and take effort in knowing everyone of them. collaborative culture and flat hierarchy :) exciting possibilities ahead.", "cons": "not many i can think of"}, {"review_title": "Nice at one glance, culture isn't great", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "25 Feb 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "\"Good work environment\" depends on your team. Flexible hours, can work from home. Pet-friendly. Pantry with snacks.", "cons": "Favouritism and biases in the office! Previously didn't feel like there was politics going on, but now there is. \r\n\r\nCulture feels shallow -- some free food, eat together sometimes, people seem to be happy in the surface. But teams are not collaborative, and there's a lot of communication problems. \r\n\r\nTries to do everything at the same time; not much focus."}, {"review_title": "Overall, a great company to work for!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "12 Jan 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- People here are friendly, helpful and open to sharing\r\n- Able to learn and gain knowledge in a wide variety of things\r\n- Love how we are working towards a meaningful goal", "cons": "- Improvements are sometimes slow but guess we are slowly improving our processes/standard procedures/communication process"}, {"review_title": "love working here!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "24 Jan 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "colleagues are very friendly, helpful and caring! humblest, nicest co-founders ever. able to learn lots as everyone is willing to share their knowledge.", "cons": "company (system, job positions etc) was a bit messy at first but it's normal cus it's a startup. things are a lot better now"}, {"review_title": "2 months review - great place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "23 May 2019", "job_title": "Head of Data Science in Singapore", "duration": "N/A", "pros": "1. Mission driven - one of the company's core values is \"Mission first\" and I see how that drives lot of decisions, esp. when there are cross-group conflicts.\r\n2. People & Culture - very talented and humble + collaborative bunch of folks. Healthy respect for each other and a fun work environment.\r\n3. Opportunity for Impact - Large volumes of data, good user base, lots of great opportunities to do meaningful work.", "cons": "Trying to do many things at the same time. Can be more focused on a few big wins first."}, {"review_title": "Fast hiring process", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "3 Jun 2019", "job_title": "Product Manager in Singapore", "duration": "N/A", "pros": "It is a very young and dynamic company culture with a great mission. People truly believe in the mission here. The solve great challenges for 7 markets around Asia - bug growth potential. The hiring process took 2 weeks with an HR assessment, interview with the product directors, solving a product challenge (case), presentation of the case and a final interview with the CEOs. However, this whole process only takes around 2 weeks.", "cons": "The benefits are still limited they offer for expats, but they are planning to improve on it soon."}, {"review_title": "The company is good, but has some unnecessary \"politics\"", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "15 Nov 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "The benefit is good, the culture is also cool and of course it also depends on which team ur working in.", "cons": "There are some people in there trying to play \"politics\" but the upside is if you don't mess with them, ur totally ok. There are also some people so aggressive, always bother the people around to try to show their affects."}], [{"review_title": "Nice place but can be better", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "28 May 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Nice and smart co-workers\r\nGreat culture", "cons": "Unnecessary politics\r\nNo personal growth (joining as a junior means you will most probably be stuck at the bottom for good)\r\nNo clear company direction\r\nBad at hiring \r\nNo balls to take immediate action to fix the mistakes\r\nEveryone just wanna be a good cop and no one wants to point out the mistakes\r\n\r\np.s.\r\nPerfect for people who want to be a manager, soft (people) skills are more valued than hard skills and results in Carousell"}, {"review_title": "lack of direction, unrealistic expectations", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "26 Jul 2018", "job_title": "Software Engineer in Singapore", "duration": "N/A", "pros": "- free food on friday\r\n- many good engineers, can learn a lot\r\n- non formal environment\r\n- can work from home a lot\r\n- good money", "cons": "- lack of direction, management look clueless\r\n- like to setup unrealistic expectation, somehow 'discourage' reaching green OKR (if you meet expectation they will say you dont set goal high enough)\r\n- high turnover rate\r\n- execs have no idea of tech and engineering, leading to lots of dubious tech decisions that make engineers suffer\r\n- no meritocracy, lots of nepotism\r\n- lack of transparency, many decisions made at sudden without consulting tech/product owner\r\n- no growth opportunity, performance review mainly formality"}, {"review_title": "Super Efficient Recruiting & Onboarding process", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "16 Mar 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- Very fast & efficient recruiting process\r\n- Quick turnaround time on queries\r\n- Quick decision making on next rounds & overall offer\r\n- Very considerate in terms of adjusting for personal issues during transition from old employer/location to Carousell location / office\r\n- Day 1 of joining very efficient and well structured (all assess / tools / accesses / laptop setup etc ready and a quick brief onboarding half day structure)", "cons": "- None that I can think of so far"}, {"review_title": "Management needs to get serious about dealing with real issues / Limited growth for full-time staff", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "16 Jan 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "• Flexibility to work from home\n\n• Pet-friendly\n\n• No dress code so you can show up in t-shirt and shorts, and no one cares\n\n• Pantry is usually well-stocked with snacks and soft drinks", "cons": "• Management is disorganised - Always taking on more than they can handle and/or doing things at their whim and fancy, and then they end up not doing it well, causing the rest of the team to clean up and bear the consequences.\n\n• Decisions are top-down most of the time and the organisation is not as flat as what the management makes it out to be.\n\n• Interns get more opportunities to learn and grow, whereas full-time employees are constantly denied such opportunities, even if they propose useful ideas and volunteer to practice skills they've acquired from prior work experience. Interns' also seem to be given more power over full-time staff and are allowed to run amok, doing and saying whatever they want.\n\n• Lack of proper policies in place to govern professional conduct, and that's not ideal given how rapidly the company is growing.\n\n• Management is often not transparent about plans for the company, and when asked, they give vague answers and try to side step those questions. Full-time employees often want to help but are deliberately excluded and denied, despite their best interests for the company.\n\n• Management seems to be resistant and unadaptable to changes and challenges, which is contrary to the image that people see from the outside. It does really look better from the outside than from the inside.\n\n• Management always sit on the fence when decisions are required, big or small, and things take a lot longer to get done as a result. Most of the time, if they don't immediately agree, it is because something was not what they liked/wanted to hear, and providing good reasons to back something up is never enough. \n\n• Management always chooses to hear the good things and ignore the bad. This is a problem because serious issues have arisen as a result of their negligence and failure to commit to solving urgent issues that will directly affect the performance of all functions, as well as the overall reputation of the company.\n\n• Management talks about growth A LOT but don't seem to have a sound plan for execution and success. A lot of things seem haphazard and wilful.\n\n• There is a lack of accountability as the management seems to have gotten a bit complacent... Some times, a lot of talk to make things sound good but no follow up action to fulfil it.\n\n• The team is VERY young and most are inexperienced, so it takes some level of patience to deal with it appropriately. One has to learn how to manage one's own expectations on how long certain supposedly simple things take to get done, and to what levels of standard. Quality of work is not a strong suit around here."}, {"review_title": "Slowly but surely", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "11 Jul 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "In the last 6 months, a lot have been changing and you wouldn't think that we're still the same company we were 6 months ago. I see a lot of effort from the company leaders to make positive changes and trying to listen to what we want.", "cons": "Because of how fast the company is growing, it almost feels like the changes take a relatively longer time to really impact on people on the ground."}, {"review_title": "The most draining 2 years in my entire working life", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "5 Oct 2018", "job_title": "Anonymous Employee in Outram Park,", "duration": "N/A", "pros": "- No dress code\n- Semi flexible working hours\n- Free buffet spread menu every Friday \n- Inspiring leaders", "cons": "- Incompetent team leader\n\n- Serious lack of transparency \n\n- High turnover rate\n\n- No room for career progression \n\n- Lack of appreciation for staff who actually do the work and go beyond \n\n- Hierarchy system: to climb up the ladder, you’re going to have to agree with everything they say and support their decisions even if it does not make sense. Also, be quick to turn a blind eye whenever negative repercussions resulting from awful decisions made by the management team arise\n\n- Unless you’re \"up there\", be prepared to take every hit and fall that comes your way when your manager leads the team down a dead end street, while the higher-ups will get all the credit and glory IF and when things (surprisingly) go right\n\n- Differing views and opinions are openly and actively encouraged, but if you want to survive here you’d better keep your thoughts to yourself. 100% of the time, managers don’t really want to hear anything other than what they already think they know, so don’t be fooled. \n\n- Be prepared for important decisions to be made by managers without any prior discussion or consideration for the people who will be negatively affected. When this is highlighted, which it has many times before, the response from them will be something along the lines of \"take it or leave it”\n\n- HR team is all talk and no action, even when multiple employees within the same team highlight similar issues and pain points \n\n- Founders are probably not as clueless as they pretend to be about these issues, not when word and gossip spreads at lightning speed and issues within individual teams are hot topics between other teams"}, {"review_title": "Schizophrenic strategy, unjust HR policies", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "18 Oct 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- (not exactly a pro) culture was good a few years ago, not anymore as the company  is in a stage of uncertainty and \"transitioning\" to become more corporate\r\n- people here are generally nice and friendly\r\n- flexible working arrangements", "cons": "- management can't settle on ONE CLEAR direction and can change strategy at the very last minute and thinks it's acceptable in the name of a \"start up\" that needs to \"move fast\"\r\n\r\n- claims they are user-centric, but nothing done in the company is user centric in ANY way\r\n\r\n- when the company started to hire more experienced people, the culture started to change to become more corporate but yet strategy is still all over the place\r\n\r\n- very complicated organisational structure that makes no sense and is extremely hard to navigate\r\n\r\n- nothing is compulsory here. so many thousand problems we have to solve, but can't even find an appropriate project owner because of the complicated organisational structure. if there's no owner, it'll never get solved and that's how Carousell is still stagnant and can't solve it's core user problems while trying to make money out of users\r\n\r\n- HR policies for promotions are extremely unjust. Peers with same level of experiences that got promoted before the new \"review system\" are safe, happy and satisfied at work; and others that are working extremely hard, frequently having to OT, contributing much more to the company and with the same level of experience don't get promoted because of \"HR policies\" in the name of making things more \"structured\". \r\n\r\nThis company doesn't value loyalty, your contributions and the value you bring. Promotion criteria are ambiguous and not made known to employees - they tried to map a competency chart, of which if you reach the next level you might not even be promoted because of other unknown HR policies that are not communicated at any point and they expect you to accept the fact that you are subjected to them anyway.\r\n\r\nMakes you feel cornered with no choice but to either accept the unfair policies or to leave."}, {"review_title": "Great Experience in Multi Cultural Company", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "5 Oct 2017", "job_title": "Product Manager in Singapore", "duration": "N/A", "pros": "1. Multi Culturalism, you get to know people from many countries. Literally more than half are foreigners with interesting stories\n2. Fast paced - fast learning\n3. Inspiring leaders and company-mission", "cons": "1. Documentation is scrambled around\n2. Your ear needs to be good with many accents\n3. Pace can really be intimidating, not recommended if you are blur"}, {"review_title": "Finance dept", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Cant think of anything except abit later than usual start work timing, free lunch every friday", "cons": "Lol! Whole top management is too proud to even talk to employees, looking down on us. Their noses are too high up in the air.  Now its the worst company ever to be in. Place is overcrowded with foreigners. Salaries are being deducted by half during 2nd year to buy options, locking employees' money away and boosting their own revenue in a way!! What a total joke! You dont have a choice! Join at your own risk. You will definitely suffer!"}, {"review_title": "Energetic, open and bottom up environment", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "9 Nov 2019", "job_title": "Engineering Manager in Singapore", "duration": "N/A", "pros": "a set of fast learning talents, bottom up culture, strong product mindset across the company.", "cons": "too many things want to achieve at the same time, resulting in lost of focus. conflicting features across teams.\r\n\r\nC level always avoid taking final decision/resolving conflict when teams consensus can't be made, lead to frustration."}], [{"review_title": "Nice place & nice people!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "12 Nov 2018", "job_title": "Anonymous Employee in Singapore", "duration": "N/A", "pros": "- having 4 stage of interview process (They are serious in getting who they want to hire)\r\n - nice co workers \r\n - Free flow drinks and food at pantry", "cons": "- room for improvement in the onboarding process"}, {"review_title": "Backend engineering", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Good culture and collaboration, people are young and fast learning. Good life work balance. Clear social value seen from what the company is doing", "cons": "A bit lack of ambition. Previously none meaningful perf review was hold, and now it’s getting better. Uniqueness is lowering down."}, {"review_title": "Passive Aggressive Company", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "8 Nov 2018", "job_title": "Product Manager in Singapore", "duration": "N/A", "pros": "Its hyped up by the tech scene", "cons": "Management has no idea what they are doing\r\nRecruiters suck and hire their friends and family \r\nPeople here are extremely arrogant and if you say something back like a better idea or some improvement metrics, they will find ways to take you out"}, {"review_title": "Awesome people", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Engineering team is great and people are talented", "cons": "Nothing specific.  Just the office space is getting small to accommodate so many people, but they are trying to fox that too"}, {"review_title": "Awesome!", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "24 Apr 2015", "job_title": "Campus Ambassador in Singapore", "duration": "N/A", "pros": "Great team! Very energetic and passionate!", "cons": "Not enough time to work with them more"}, {"review_title": "Really good company", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "5 Sept 2019", "job_title": "Senior Software Engineer in Singapore", "duration": "N/A", "pros": "- Awesome colleagues\r\n- Good engineering practices\r\n- Focus on making the product better", "cons": "- We have company lunch on Friday, but the lunch is just ok, I think"}, {"review_title": "Smart colleagues, significant turnover", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "15 Mar 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- Smart colleagues\r\n- Free food on Fridays", "cons": "- Questionable management\r\n- Losing quite a few talented engineers"}, {"review_title": "It was alright", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "The people there are friendly and close to one another.", "cons": "It is a very fast paced company. So be prepared for it."}, {"review_title": "Its a good company", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "5 Dec 2019", "job_title": "Internship", "duration": "N/A", "pros": "The pantry is well  stocked and the enviroment is good to work", "cons": "It gets noisy at times"}, {"review_title": "Young, but not well organized", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "12 Feb 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Young engineers\r\nFull of joy in the office", "cons": "Not well organized\r\nDont see any innovation"}], [{"review_title": "A great place to work at.", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "4 Oct 2018", "job_title": "Category Marketing Manager in Singapore", "duration": "N/A", "pros": "Great colleagues. Love the environment", "cons": "Nothing really much in particular"}, {"review_title": "good bonding", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "16 Mar 2020", "job_title": "Business Associate", "duration": "N/A", "pros": "get to know all the latest tech info", "cons": "must be able to be multitask in a fast pace"}, {"review_title": "Friendly culture", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "9 Jun 2020", "job_title": "Associate in Singapore", "duration": "N/A", "pros": "Great work life balance. Smart people and friendly senior management.", "cons": "Below-industry pay, some red tape"}, {"review_title": "A humble company", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "6 Sept 2019", "job_title": "Account Manager in Singapore", "duration": "N/A", "pros": "Love the people in this company.", "cons": "Not at the moment now"}, {"review_title": "Nice Job", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "19 Jan 2020", "job_title": "IT Manager in Woodlands New Town,", "duration": "N/A", "pros": "Nices Company in the world", "cons": "Goods in the singapore Companies"}, {"review_title": "Gd", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "28 Oct 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Very gd place 2 b", "cons": "Benefits not great can b better"}, {"review_title": "Good company culture", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "25 Jan 2023", "job_title": "Business Development Manager", "duration": "N/A", "pros": "friendly colleagues and culture. work-life balance.", "cons": "too many products, which means hard to maintain and sell, esp vertical. Media and merchant sides are good, but need to think how to strengthen these categories and keep the momentum and resolve the gaps, i.e. payment, logistics, trust issue."}, {"review_title": "Good place to work", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "7 Feb 2023", "job_title": "Backend Engineer in Taipei", "duration": "N/A", "pros": "colleagues are talented, manager are really thoughtful and helpful.", "cons": "Loading in some teams are pretty high, I often have to work over time to make things done"}, {"review_title": "Culture is good", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "11 Jan 2023", "job_title": "Software Engineer II in Taipei", "duration": "N/A", "pros": "People are friendly. Working hour is flexible. Enable remote work.", "cons": "A little buzy. Business model is not clear. Office is not that comfortable."}, {"review_title": "Tech/Data teams dominated by a certain nationality", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "14 Dec 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Pros: - laidback culture - fully remote working style - decent base salary - generally nice teammates at rank and file level", "cons": "Cons: - Tech/Data leaders mostly foreigners, particularly of a certain nationality (some are even based in their home countries) - no cash bonus - no profitability in sight - likely to raise a down round at current growth trajectory"}], [{"review_title": "Barriers to Entry into the HK Market are Massive", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "4 Sept 2022", "job_title": "Marketing in Hong Kong", "duration": "N/A", "pros": "They have nice modern offices in a good location", "cons": "It's an impossible task trying to break into a market with a number of competitors that have been established for nearly two decades."}, {"review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "3 Nov 2022", "job_title": "Office Administrator in Bangalore", "duration": "N/A", "pros": "-Wonderful work culture -No pressure. -Support from Manager and site lead -Company understands work-life balance and respect that. - You get to work with top thought leaders - smart, collaborative, and willing to share. - Flexible working hours and adaptive work environment.", "cons": "Haven't come across any as of yet."}, {"review_title": "Excellent place to learn", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "10 Oct 2022", "job_title": "Software Engineer Test I", "duration": "N/A", "pros": "Flexible\r\ngood pay\r\ngood benefits\r\ngood learning opportunities", "cons": "Nothing so far i have felt"}, {"review_title": "Stress free work environment and good compensation!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "11 Sept 2022", "job_title": "Software Engineer II in Bangalore", "duration": "N/A", "pros": "Flexible and stress free work environment. Competitive compensation. Lots of opportunities for learning and improvement.", "cons": "SDLC could be improved as far release cycle goes"}, {"review_title": "Title inflation, stressful to meet unrealistic target", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "23 Aug 2022", "job_title": "Business Development Manager in Quarry Bay", "duration": "N/A", "pros": "Large, comfortable and convenient office", "cons": "- Poor branding and marketing strategy leading to poor demand driving to Property, Autos and Services sectors\r\n- Unrealistic target and termination will be carried out for employees not meeting targets, making low morale\r\n- Less resources and support from management level, implementing business plans for potential merchants by ourselves\r\n- Require cold calls and you will expect to be rejected a thousand times a day"}, {"review_title": "Flexible time, great culture, lots of opportunities to grow", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "23 May 2022", "job_title": "Talent Acquisition", "duration": "N/A", "pros": "listening to their people\nhumble and down to earth leadership (local and regional)\ngreat culture\nco-founders are very humble, hands-on and inspiring\nno late night /after hours meetings\nvery trusting of the employees/colleagues", "cons": "cascade of processes should be communicated properly to the team before implementation"}, {"review_title": "Good for beginners", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "21 Aug 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Can learn a lot since have to be independent", "cons": "Unable to showcase more leadership talents"}, {"review_title": "Onboarding Process", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "4 Jul 2022", "job_title": "Sr Backend Engineer in Taipei", "duration": "N/A", "pros": "The HR team and the software team are friendly and willing to help me go through the onboarding process.", "cons": "So many accounts and permissions need to apply at the first day."}, {"review_title": "Best place to grow", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "29 Mar 2022", "job_title": "Lead Engineer", "duration": "N/A", "pros": "Team - diverse, helpful, polite\r\nWork - independence , latest tech stack, solving real problems\r\nCompensation - competitive pay and good structure", "cons": "benefits - not a lot of benefits like fitness reimbursements or other shiny programmes\r\nonly a basic insurance programme provide which doesn't cover parents"}, {"review_title": "Good culture", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "7 Jun 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great people\r\nGood culture\r\nGood work-life balance", "cons": "Hard to prioritize with the workload, and might feel stagnant in current role"}], [{"review_title": "A really nice company", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "7 Jun 2022", "job_title": "CRM Marketing", "duration": "N/A", "pros": "Company's management is approachable and attentive", "cons": "not much I can say right now"}, {"review_title": "Great workplace", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "7 Jun 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Caring environment with young and passionate colleagues", "cons": "more suitable for tech-savvy workers"}, {"review_title": "good company", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "27 May 2022", "job_title": "Data Engineer", "duration": "N/A", "pros": "value employee's opinion\nflexible working hours", "cons": "cannot think of many so far"}, {"review_title": "Recruitment people & benefits are good", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "10 May 2022", "job_title": "Marketing Manager", "duration": "N/A", "pros": "Good people, Good vibes. Good Package", "cons": "Lack of fixed SOP, just like other startups"}, {"review_title": "Great place to work in!", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "28 Apr 2022", "job_title": "Customer Experience Associate in Pasig, Rizal", "duration": "N/A", "pros": "Work from home\r\nColleagues and bosses are nice and friendly", "cons": "The salary is okay, I hope they will give a more competitive salary"}, {"review_title": "Friendly culture", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "4 May 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Friendly culture \r\nFlat structure \r\nPlayful and helpful colleagues\r\nLearning and fitness allowance", "cons": "Less bonus\r\nNo clear career path"}, {"review_title": "Carousell is a high growth, fast paced environment and the company's culture is designed for problem solvers", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "5 Nov 2020", "job_title": "Country Head in Kuala Lumpur", "duration": "N/A", "pros": ":: Mission-first company --- aiming to inspire every person in the World to start selling & buying to make more possible for one another\r\n:: Company culture is designed for problem solvers; if you can solve major blockers / issues, you'll also gained tons of learnings & growth as a result.\r\n:: When it comes to solving meaningful problems, many of us also take extreme ownership and tend to over-communicate to ensure alignment. Some people may be surprised at first... but you'll eventually realize it's a norm at Carousell.\r\n:: Team members here will speak up when in doubt or call out things if it doesn't seem right. And we even do it during comms / townhall sessions with CXO level. I love the fact that many here feel safe for speaking up and asking relevant questions even to senior management. Kudos to the People's Team to organize such forums.", "cons": ":: Ambitious goals, need to stretch ourselves to make magic happen together with the squad / working team\r\n:: The tech environment and our marketplace is constantly evolving... so you'll have to keep up with the pace and be relentlessly resourceful to get things done"}, {"review_title": "Very good job, payment is good", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "12 Mar 2022", "job_title": "Team Member in Los Angeles, CA", "duration": "N/A", "pros": "good payment, nice co-workers and managers", "cons": "a little bit stresfull at the start"}, {"review_title": "Start-up environment, lack of people management skills", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "4 Jan 2022", "job_title": "Senior Associate", "duration": "N/A", "pros": "Cozy working space, friendly & diversity working environment, international co-workers", "cons": "lack of people management skills, messy workflow, not user based product"}, {"review_title": "Best place that I have been to so far ;)", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "1 Oct 2021", "job_title": "Training and Quality Analyst", "duration": "N/A", "pros": "The freedom to work and hierarchy-less format really do wonders for me. The friendly team makes it easier to work across different region and function.", "cons": "As always, the work hours can get a little bit excessive but usually your team members and people manager would understand if you need a little bit more time."}], [{"review_title": "Good Culture, bad management", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "29 Aug 2021", "job_title": "Business Manager in Toronto, ON", "duration": "N/A", "pros": "Very good company culture, credits to the founders. colleagues are good, fancy working environment, good startup experience if you are keen to work in startups", "cons": "Bad management, business not focus. A lot of new businesses wanted to launch with limited resources. Management does not care about how the business really work but only focus on number."}, {"review_title": "A lot of growth areas to discover", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "17 Nov 2021", "job_title": "Marketing Specialist in Los Angeles, CA", "duration": "N/A", "pros": "It's a good place if you'd like to grow a start-up. There's a lot of room that could be discovered and the growth potential is big.", "cons": "Might seem slow to a more fast faced start-ups"}, {"review_title": "Good", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "8 Jan 2022", "job_title": "Software Engineer in Jakarta", "duration": "N/A", "pros": "Good employees perfect nice to work", "cons": "May be better service provider"}, {"review_title": "Well Organized Interview", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "7 Dec 2021", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "Open, Authentic and Diversity. I like it's great culture", "cons": "So far I don't see the cons"}, {"review_title": "Working with carousell is an amazing experience", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "14 Nov 2021", "job_title": "UI & User Experience Designer in Taipei", "duration": "N/A", "pros": "Great team and Flexible work hours,", "cons": "Over tasking, unclear job descriptions."}, {"review_title": "Constantly changing the monetization model", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "18 Oct 2021", "job_title": "Business Development Manager in Hong Kong", "duration": "N/A", "pros": "Colleagues Care and contribute outside their job duty also got a very good working environment even have a work from a home culture half week", "cons": "Constantly changing the monetization model"}, {"review_title": "The vision is very vague and there is hardly any motivation to work towards new things. Bad work life balance.", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "26 Sept 2021", "job_title": "Senior Software Engineer", "duration": "N/A", "pros": "Talented colleagues, known brand, good perks and benefits", "cons": "Work life balance, company culture, management, I had no motivation to work on any of the teams"}, {"review_title": "Good developer environment", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "14 Oct 2021", "job_title": "Software Engineer II in Taipei", "duration": "N/A", "pros": "1. Able to work from home.\n2. Getting engineer teamwork by using RFC", "cons": "1. Long working time period \n2. App features change really fast sometimes break the previous strategy defined."}, {"review_title": "Competitive C&B", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "14 Sept 2021", "job_title": "Manager in Manila, Manila", "duration": "N/A", "pros": "CRS has competitive benefits e.g. HMO for employees and dependents, flexible benefits, paid sick leaves, VL, EAP, caregiver leave etc. The Company cares deeply to their employees.", "cons": "Management are sometimes slow in decision making, consensus-based."}, {"review_title": "Caring culture", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "11 Oct 2021", "job_title": "Category Manager in Hong Kong", "duration": "N/A", "pros": "Everyone is young and cheerful, good startup environment.", "cons": "Can't think of any yet since I am new."}], [{"review_title": "Challenging work and bright future", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "29 Jul 2021", "job_title": "SSE Manager", "duration": "N/A", "pros": "Challening work with a lot of opportunity and only way is up to grow to become the best in the business.", "cons": "With challenges comes some minor issues but nothing major as the leadership is very accomadative. With challenges comes some minor issues but nothing major as the leadership is very accomadative."}, {"review_title": "Good start-up env", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "17 Aug 2021", "job_title": "Senior Software Engineer in Ho Chi Minh City", "duration": "N/A", "pros": "Cool place to work, modern tech stack to work with , friendly co-worker and good income.", "cons": "Some time the dead line is too tight due to the changes from product side. Which's can be reduced by care full review the solution before implement."}, {"review_title": "N/A", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "21 Sept 2021", "job_title": "Associate", "duration": "N/A", "pros": "Loving family, together Thursday (Free lunch) for everybody", "cons": "Not sure, I'm new there"}, {"review_title": "Product Manager", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "21 Sept 2021", "job_title": "Product Manager", "duration": "N/A", "pros": "company culture is open, autonomous, and mission first", "cons": "Company strategy is vague and changes fast"}, {"review_title": "Awesome Health Benefits", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "8 Sept 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- HMO on day 1 for full time employees\n- Flexible work schedule", "cons": "Management should listen to employees feedback"}, {"review_title": "Handling 9 DCS", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "8 Sept 2021", "job_title": "Cluster Head", "duration": "N/A", "pros": "Good premises to work and learn", "cons": "Team handling and getting productivity from FES"}, {"review_title": "Good culture", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "1 Sept 2021", "job_title": "Business Development Manager", "duration": "N/A", "pros": "Great culture, people are willing to help", "cons": "Management style is not good"}, {"review_title": "So glad to be a part of the Carousell team!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "27 Jan 2021", "job_title": "Anonymous Employee in Bangalore", "duration": "N/A", "pros": "Carousell is one of the best organisations I have worked with. You get to work with a bunch of incredibly talented people everyday, who genuinely care for your learning & growth. Everyone, right from the first level team members to the leadership team, are extremely approachable and will go out of their way to help you. The work culture is great and it has truly been an amazing journey so far!", "cons": "None as of now. NA."}, {"review_title": "Good Culture", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "12 Jul 2021", "job_title": "Senior IOS Engineer in Taipei", "duration": "N/A", "pros": "Open and trust, you can fully comfortably share your thoughts about products", "cons": "Resource limited, not enough team plus not enough time result in not enough completeness outcome"}, {"review_title": "Carousell", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "5 Aug 2021", "job_title": "Account Manager", "duration": "N/A", "pros": "Good Benefits, Friendly Culture, Fair Salary", "cons": "None at the moment. No cons"}], [{"review_title": "The company that helped me grow a lot", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "4 Jun 2021", "job_title": "Recruiter in Manila, Manila", "duration": "N/A", "pros": "Flexible work hours, HMO and insurance on day 1, wfh, great boss", "cons": "Company direction is conservative and not aggressive compared to direct and indirect competitors"}, {"review_title": "Great company to work with", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "25 Jun 2021", "job_title": "Anonymous Employee in Pasig City", "duration": "N/A", "pros": "Work life balance \nBenefits are great\nGreat culture", "cons": "None for me to think about"}, {"review_title": "you guys have no idea how to deal with the conflict of users", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "25 Apr 2021", "job_title": "Marketing Associate in Wan Chai", "duration": "N/A", "pros": "No comments of any pros of this company", "cons": "the employees are all lazy to deal with the users' complaint. If they think the users are annoying, they will just decided to block the users so that they cannot make any complaint which it is not reasonable and user friendly"}, {"review_title": "Good place to learn", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "4 May 2021", "job_title": "Senior Manager, Finance", "duration": "N/A", "pros": "Good place to learn and great culture", "cons": "Not the best pay master"}, {"review_title": "Marketing Manager", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "19 Apr 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Flexibility at working hour and location, Open, Human", "cons": "Unclear career growth path, unclear business strategy, not strong direction"}, {"review_title": "Good learning curve", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "3 Feb 2021", "job_title": "Executive", "duration": "N/A", "pros": "At Carousell, you get to work on various tasks and everyone is willing to teach and help you along the way.", "cons": "Lack of work life balance."}, {"review_title": "Company has outgrown co-founders ability", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "20 Jan 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "It’s an app and in a dominating position in SEA", "cons": "Weak management and indecisive CEO"}, {"review_title": "Good learnings", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "1 Dec 2020", "job_title": "Sales Manager in New Delhi", "duration": "N/A", "pros": "very nice place to work", "cons": "nothing as such perfect place one can ever get"}, {"review_title": "Environment, culture and vision are great", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "12 Aug 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "the mission is focused to help others. Founders are keen to take care of their people. Great place to work and grow.", "cons": "there are politics every now and then but if you do you work, you'll be fine. :)"}, {"review_title": "nice working environment, great culture", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "16 Oct 2020", "job_title": "Customer Success Executive in Quarry Bay", "duration": "N/A", "pros": "nice working environment\r\ngreat culture\r\nflexible \r\ncan have work life balance", "cons": "not very clear company structure"}], [{"review_title": "Talented colleagues, but lacks the room for growth", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "23 Mar 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- Talented colleagues that can inspire you and gain your professional skills.\r\n- You won't feel bored because there are lots of challenge that are awaiting for people to work on and gain experience from them.", "cons": "- Questionable hiring process that during the great expansion of 2017 some incompetent persons with bad ethics of profession and improper behaviour were hired even they lack the required skills and personalities for the positions.\r\n- Questionable management that some people received endorsements from managers because they made decisions and contributed their work that can give them perfect look experience in their own CV but bringing negative impact to the revenue and reputation of the company, hence extra cares are needed from other colleagues.\r\n- Lack of promotions and recognitions to colleagues who actually do the work above and beyond by making their own hands dirty. They stuck to the same level, pay, position, and team for years.\r\n- Over emphasising the importance of managerial skills that people got promoted even they lack the required professional skills for the previous position. And no room for career growth to colleagues who mainly focus on professional skills.\r\n- Keep losing talented colleagues.\r\n- The pay and benefit are not good enough considering the unusual work load that brought by incompetent colleagues. Also not competitive when compares to the role with a similar requirements and responsibilities in other companies.\r\n- The time off in lieu is out of proportion (less) to the time of working overtime."}, {"review_title": "no room for growth", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "17 Jun 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "1. flexible working hours\r\n2. able to work from home\r\n3. free food during employee gathering on Friday\r\n4. casual startup atmosphere\r\n5. they got new improved health benefits", "cons": "1. instability, KPI changed every now and then\r\n2. some incompetent and micromanaging managers who can't handle criticism\r\n3.  lack of transparency regarding decision making in executive level\r\n4. literally no room for growth, there is no clear criteria for a promotion and most employees  will be stuck in the same entry level position\r\n5. no leadership development\r\n6. someone mentioned that Carousell has a useless employee feedback system: I can confirm this. employers rarely followed up  the issues voiced out by employees"}, {"review_title": "Very fast phase, amazing work culture!", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "30 Jan 2017", "job_title": "Community Manager in Kuala Lumpur", "duration": "N/A", "pros": "Super fast phase\r\nYou are allowed to do everything from A to Z\r\nYour ideas are valued\r\nRespectable founders\r\nDown to earth folks and colleagues\r\nLike minded humans\r\nHustlers for the win\r\nAlot of help from team mates\r\nGood team work\r\nStrong founders and investor support\r\nScrappy style of events with a twist\r\nEvery milestone is celebrated\r\nYour Birthday is valued!\r\nFamily Friday luncheon and an in house speaker with a fun topic!", "cons": "Long hours and weekend but it's how you plan your time\r\nDifficult decisions but it's how you plan the strategies"}, {"review_title": "Good place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "16 Dec 2019", "job_title": "Software Engineer in Bangalore", "duration": "N/A", "pros": "Opportunity to work on new technologies\r\nCustomer centric co-workers\r\nCheerful and energetic people who like what they do which can be contagious\r\nFlexibility to work from anywhere\r\nDecent learning curve for fresher engineers \r\nFree lunch on Fridays", "cons": "Might feel alienated if not in a team of 2 or more people-IC roles beware\r\nCommunication gaps often occur between people and teams"}, {"review_title": "I like the way what they are working for", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "20 Jul 2017", "job_title": "Software Engineer in Taipei", "duration": "N/A", "pros": "Good team and environment. People are really concentrate in building product. We can have some inspire and make some advice if it make seance.", "cons": "New technology. In here we need to focus on the new tech and it haven't been experienced before. I liked to lean and take this up."}, {"review_title": "No Growth Prospect", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "22 Mar 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- Friendly and smart team\r\n- Inspiring co-founder\r\n- Good money and benefit", "cons": "- No room for growing unless you can play politics\r\n-  Questionable management\r\n-  Senior couldn’t take any advices"}, {"review_title": "Good place, good people!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "13 May 2020", "job_title": "Trainer and Quality Analyst", "duration": "N/A", "pros": "i love the flexibility given (this may based on your manager) and friendliness of friends :D", "cons": "it may be a bit hard to deal with others from a different team since everyone is so focus on what they need to do"}, {"review_title": "Grateful to be part of Carousell", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "16 Apr 2020", "job_title": "Customer Experience Associate", "duration": "N/A", "pros": "Fun and easy to be with co-workers", "cons": "That you are under Agency"}, {"review_title": "Interview experience", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "25 Jul 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "creative, passion people. doing amazing thing.", "cons": "you have to have goo english skill"}]]