[[{"review_title": "Best company ever and 100% remote working", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "5 Oct 2022", "job_title": "Account Executive", "duration": "N/A", "pros": "100% fully remote people here really lives up to the company's values", "cons": "seldom meetup with my colleagues"}, {"review_title": "Sales culture needs to change", "rating": "2.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "28 Jul 2020", "job_title": "Account Executive", "duration": "N/A", "pros": "Transparent and inherently collaborative culture. All-remote.", "cons": "Commercial sales culture and process needs to change. Classifying companies by number of employees is okay, but there needs to be a clear process in ensuring that AEs are closing deals what they are supposed to close, and not wasting time justifying working on deals that don't belong to them. \r\n\r\nFor new AEs, there is no clear transition process and this leads to frustration and ineffectiveness."}, {"review_title": "unstable start up.", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "1 Oct 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "flexi work hours\r\nnothing I can think now", "cons": "announce retrenchment and cut you within 24 hours"}, {"review_title": "Great place to work, people live out the company values", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "25 Oct 2019", "job_title": "Backend Engineer", "duration": "N/A", "pros": "Great place to work with a lot of autonomy to do what matters. Fellow team members truly live out the company values CREDIT.\n\nThere have been crises at times, but as with any company of a decent size (close to a thousand employees), mistakes are bound to be made and the effect are compounded by the amount of public exposure that comes with being of that size. What is important is that everyone from literally all faces of the earth comes together to work together to face the crises and learn from the mistakes, while at the same time not putting any blame.", "cons": "Not really a con but rather a challenge: contractor arrangement for people from most countries can be challenging and even disadvantageous."}, {"review_title": "C.R.E.D.I.T - The values of GitLab and it's simply awesome!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "19 Sept 2019", "job_title": "Senior Sales Recruiter in Singapore", "duration": "N/A", "pros": "Although we are an all remote company globally, the passion and the warmth of all the employees can be felt so easily.  Everyone is so eager to help and make each other successful! A great and modernised company who truly lives the values of Collaboration, Results, Efficiency, Diversity & Inclusion, Iteration and Transparency.", "cons": "No cons that I know of for now..."}, {"review_title": "Gender bias problem", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "7 Mar 2023", "job_title": "Product Management", "duration": "N/A", "pros": "Work/life balance and good benefits.", "cons": "I am very disturbed by the steep decline in culture and values in the past year. The company continually pushes minority leaders out the door, nearly all women product leaders have been pushed out in the past 18 months alone. In the meanwhile, while it takes a woman on the product team 6+ months to be able to justify a case for promotion to director, the white men on the product team get multiple promotions within a couple months. They keep finding excuses to “layoff“ women product leaders, or women leaders suddenly “resign”. One of the white male senior directors brags about how he’s so good at getting people to accept departure packages so he doesn’t have to actually fire them, and interestingly enough, all the people he convinces are women and often women of color. I’m truly disturbed by bro culture of the product team."}, {"review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "6 Mar 2023", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "Lots of ability to adjust your schedule as needed to allow for travel and personal obligations. Very hands on, if you find a problem you're passionate about fixing, you have the tools needed and support from leadership to fix it. Lots of very capable people to collaborate with.", "cons": "The Iteration value at GitLab can mean that there are a lot of things in flux at any given time, you need to be comfortable with change. More in person time with co-workers would be great. Creating ways for more travel and in-person time would help build connections."}, {"review_title": "Great working culture, poor management", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "9 Mar 2023", "job_title": "Senior Program Manager", "duration": "N/A", "pros": "- Great async working - Great working culture - Amazing colleagues - No drama or toxicity", "cons": "- Poor middle management - Lack of professional development plans - management always pushing us to deliver, while ignoring our professional development and growth"}, {"review_title": "Good WLB, career", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "10 Mar 2023", "job_title": "Site Reliability Engineer in Amsterdam", "duration": "N/A", "pros": "Great balance Fully remote Remote first culture", "cons": "Sometimes I miss the office"}, {"review_title": "This company is a shell of what it used to be", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "8 Mar 2023", "job_title": "Senior Software Engineer", "duration": "N/A", "pros": "Personal Time Off is ok", "cons": "Extreme bureaucracy, fragile executive egos, and incompetent product managers are rampant in this company. They also pay way below market rate since they are still under the impression that \"remote work\" is unique to them."}], [{"review_title": "Good culture, but weak direction and poor follow-through.", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "3 Mar 2023", "job_title": " in Knoxville, TN", "duration": "N/A", "pros": "Strong culture of good work/life balance,completely remote, no time tracking.", "cons": "Product direction changes wildly, many incomplete parts, many promises to customers broken."}, {"review_title": "A place to get retired from", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "22 Feb 2023", "job_title": "Solutions Architect in Vienna", "duration": "N/A", "pros": "The title of this review says it all. I really cannot wish for a better job: great culture, great colleagues, great product, great compensation. The company really runs like it's described in it's public handbook, no surprises.", "cons": "I wish GitLab would have an office which I could visit a couple of days per week to connect with my colleagues. Full-remote works perfectly here, but I miss the personal contacts from time to time."}, {"review_title": "Great place for work/life balance, not so much for career development or making money due to churn", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "2 Feb 2023", "job_title": "Sales Executive", "duration": "N/A", "pros": "1. Gitlab is an awesome place for work/life balance: fully remote but with FTF meetings at will, both with customers, partners and employees, really family oriented. 2. Great product that customers love. 3. Awesome sales growth.", "cons": "1. The company prefers to hire new people instead of promoting from within, which leads to significant headcount churn. 2. Uncapped revenue churn at some levels in the sales organisation, which may not even be legal, amounting to significant penalties on the sellers who may have no control over the matter."}, {"review_title": "Going downhill fast", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "2 Mar 2023", "job_title": "Strategic Account Executive in Reston, VA", "duration": "N/A", "pros": "Decent product but little to hedge off competition", "cons": "No support, little repose to feedback/ help requests, corporate greed, over-worked under appreciated, management is out of touch and rude."}, {"review_title": "Refreshing Change", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "5 Dec 2022", "job_title": "Recruiter", "duration": "N/A", "pros": "This company is like a breath of fresh air compared to any other company I've worked for before. The flexibility and transparency that the company strives for meets and exceeds all expectations I had as an employee. I was able to take more time off in my first two months here than I had in the last two years and that was without using any PTO - just company mandated days off. I always know my goals and have a clear view of what I'm working on which allows me to grow within my role in very big ways. I highly recommend this company to anyone and my excitement shows when I get the chance to speak with candidates.", "cons": "If you're not used to the async communication style on a global scale - it can really throw you off. A lot of the things you do are self guided and driven only by you, which is wonderful if you're ok with minimal oversight, but if you're the type of person who needs the face to face daily interaction than this company may not be for you."}, {"review_title": "Great Company", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "27 Feb 2023", "job_title": "Sales in New York, NY", "duration": "N/A", "pros": "Very detailed handbook. Everything is transparent. Very fair and honest place to work. Close knit all remote culture.", "cons": "Pay could be more aggressive"}, {"review_title": "One of the best companies", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "27 Feb 2023", "job_title": "Data Analyst in Manila, Manila", "duration": "N/A", "pros": "Remote set up, competitive team members", "cons": "Less attention to people in the APAC region"}, {"review_title": "Good", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "28 Feb 2023", "job_title": "Senior Pricing Analyst in Bangalore", "duration": "N/A", "pros": "Really good work culture here", "cons": "Recently they did layoff and roles got affected"}, {"review_title": "My favorite place to work, despite a sad resignation", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "27 Jan 2022", "job_title": "Senior Support Engineer in San Francisco, CA", "duration": "N/A", "pros": "Amazing teammates who genuinely enjoy being part of the company’s success.\r\n\r\nNice people disguises as executives who lead by example. One of my favorite memories was the CEO sharing a selfie of himself playing a video game in the middle of the work day because things had gotten too heavy with the pandemic, and he wanted us to feel comfortable taking a break", "cons": "Things can get lost in translation, so don’t be afraid to ask “stupid” questions if you’re not sure about something."}, {"review_title": "Great culture, inadequate pay", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "23 Feb 2023", "job_title": "Backend Engineer", "duration": "N/A", "pros": "- Great culture - Fully remote - Unlimited time off", "cons": "- Below market compensation - Below market hikes"}], [{"review_title": "Great Company to Work For", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "14 Feb 2023", "job_title": "Sales Operations Analyst in Atlanta, GA", "duration": "N/A", "pros": "Excellent Management Great Pay and Benefits", "cons": "Growth can be limited by recent head count increase, but they reward great work done."}, {"review_title": "Amazing", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "16 Feb 2023", "job_title": "Recruiter", "duration": "N/A", "pros": "- Culture/ People - Benefits - Work/life balance", "cons": "- Had a layoff (no-ones fault) -"}, {"review_title": "Great opportunity for growth", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "10 Jan 2023", "job_title": "Business Development Representative in Austin, TX", "duration": "N/A", "pros": "There is freedom to create your own process and as long as you are performing you can be as creative as you want in terms of how you get there. Management really cares about you as an individual and there's constant feedback, collaboration, and motivation.", "cons": "GitLab is still growing as a sales dev org and there are still some growing pains and processes that are being ironed out. Overall though everyone is transparent about this and works together to get through any hurdles"}, {"review_title": "Excellent Company w/ great benefits!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "8 Feb 2023", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Strong work/life balance, work from anywhere, great benefits package, diversity & inclusion", "cons": "Hard to get face time in-person, which makes it difficult to establish relationships quickly"}, {"review_title": "Life Work Balaance", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "26 Jan 2023", "job_title": "Product Manager", "duration": "N/A", "pros": "- Competitive compensation - Great product and all remote environment. Paving a path for all remote development. - Life work balance is amazing. Truly flexible and folks are still very productive.", "cons": "- All remote can be challenging for some folks so something to consider as there are no offices."}, {"review_title": "Friends and family first", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "9 Feb 2023", "job_title": "Recruiter", "duration": "N/A", "pros": "Great work life balance, the company really does our friends and family first.", "cons": "Can feel silo’d with async culture at times."}, {"review_title": "Really awesome company. A unicorn.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "2 Feb 2023", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Amazing way of working asynchronously. Unlike any company I’ve worked for prior.", "cons": "Adjustment period getting used to the different way of working (all Slack - no email, asynchronous, meeting agendas)."}, {"review_title": "Good compensation and Transparent", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "17 Jan 2023", "job_title": "Security Engineer", "duration": "N/A", "pros": "- Good compensation compared to competitors\n- Async mode of work\n- Transparent\n- Family and Friends day", "cons": "- Very slow at personal growth. One might stick to their role for years\n- Work done through it the year vs appraisal does not match. High expectations.\n- Work-life balance may not work equally for everyone at Gitlab."}, {"review_title": "No reliable basis for sales", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "26 Sept 2022", "job_title": "Sales Executive in Paris", "duration": "N/A", "pros": "The best corporate culture I have ever seen. Unfortunately, this does not apply to the sales area - here, and you do not have the impression that the team member is important and also feels comfortable being able to develop his potential.", "cons": "Chaos in the development and allocation of customers/territories. You can only count on that; you will not keep the customers you build. It will arbitrarily cut off customer relationships and restructure the territories. Of course, significantly smaller (about 50%) and therefore a little more quota (about 40%). In addition, contract extensions that do not take place are booked as negative sales. It is possible to reach your goal, but only those who have been there for at least three or more years and have been able to secure big customers can overachieve."}, {"review_title": "Run, don’t walk to join GitLab!", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "17 May 2022", "job_title": "SMB Account Executive in Irvine, CA", "duration": "N/A", "pros": "Working at GitLab has been a breath of fresh air compared to your typical tech companies. I have worked at lots of companies that have all the “bells & whistles” - great benefits, free food, unlimited PTO, slides in the office, you name it. Those companies also claimed transparency and that they cared about their employees, but their actions never compared to their claims. Gitlab on the other hand, I can say with complete confidence - they practice what they preach. They genuinely care about their employees and actively practice transparency in everything they do. No smoke and mirrors. I can’t even express how good it feels to be working somewhere that I am proud to be at & doesn’t hide anything behind closed doors. They not only care about you personally, but professionally, actively encouraging both vertical & horizontal growth to your career at GitLab while giving you the means to do so. On top of this, the people who work here are all so genuinely kind and willing to help. I feel so grateful to have gotten a job here! The recruiting / interview process was seamless and transparent, just like the company & product - I always knew what to expect and felt supported every step of the way. They are respectful of you and your time, ensuring that the process doesn’t last for weeks and weeks like typical interview processes. Overall, GitLab sets a prime example of how ALL companies should treat their employees. Keep it up!", "cons": "No cons I can think of unless you think being fully remote is a bad thing!"}], [{"review_title": "Very much in transition", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "17 Apr 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "* Absolutely the closest to getting all-remote to work, given that company leadership is still overwhelmingly in US time zones.\n* Product fills a need.\n* DIB is a priority.\n* Community is great.", "cons": "* For such a forward-looking company, GitLab feels like it drags its heels a bit when its previously innovative practices are challenged. We can't be the same company at 2000 people that we were at 200. We need to look at ways to revisit the organizational structure, the WAY in which \"everyone can contribute,\" and the amount of tactical control any one person should exercise over downstream decisions. Otherwise, we're just not going to scale and we run the risk of losing the agile, iterative edge that allowed us to succeed against larger, slower competitors.\n* We sometimes over-pivot on the warm-and-fuzzy. That's far better than the alternative (I've worked at THOSE places, and they suck), but it can get a little silly. \n* While this is true of any business, your work environment will REALLY depend on your manager. Night and day. A lot of this company is still based around relationships, so having good relationships with managers who have good relationships and the respect to manage their division will be very important.\n* Mobility is straight up. Very little opportunity to switch orgs, and it's crowded at the top of the IC ladder in most departments.\n* Comp is lower than other tech companies. Unless you have pre-IPO options vesting, you'll earn noticeably more at competitors, but you'll also get a different set of problems (and can't do your work with a cat in your lap)."}, {"review_title": "Best Company to work for in 2024", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "9 Dec 2022", "job_title": "Technical Support Engineer in Cape Town", "duration": "N/A", "pros": "All remote company that respects and looks after thier staff. Allows for flexible work times and with a family first ethic. One of the best companies I have ever worked for. This list can go but I will just say that the company values are practiced everywhere.", "cons": "The tech stack that GitLab supports is massive and there is a huge learning curve before you feel comfortable handling customer tickets solo. But is growth really a con or part of life?"}, {"review_title": "Good People, Strong Values", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "24 Jan 2023", "job_title": "Senior Solutions Architect", "duration": "N/A", "pros": "* Company Values: CREDIT * Peers and Management", "cons": "* Somewhat US-first in decision making, however open for discussion, and typically adjusted on next iterations"}, {"review_title": "Amazing place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "20 Jan 2023", "job_title": "Executive Administrative Assistant", "duration": "N/A", "pros": "Flexible hours, remote work, and amazing collaboration with the cross functional teams.", "cons": "You'll have to be okay with a high volume of iteration of projects and operational processes."}, {"review_title": "Very good work life balance", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "22 Jan 2023", "job_title": "SRE Engineer in The Hague", "duration": "N/A", "pros": "You are able to work from anywhere", "cons": "If not keen you might miss out on events"}, {"review_title": "Depends on the team you are joining", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "8 Sept 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Interesting product with many challenges. There is opportunity to initiate projects if time and workload allows it. Would advise joining the dev stages as they are more mature and roadmaps are better defined.", "cons": "The way teams are organised creates silos, which affects the end product (it sometimes feels like separate pieces bundled together) and collaboration. If you are interested in making a change that affects other parts of the product it is a very slow process, as async communication can take long. Too many distractions that take your focus from your priorities and sometimes these are not beneficial to the product, waisting valuable time (many of the OKRs fall into this category in my opinion).\r\n\r\nDepending on the team and maturity of the product there are differences on how much processes and values are followed. The politics that are frustrating and some of the managers are incompetent, don't know the product or just have too many people to manage."}, {"review_title": "Cool product, poor management", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "19 Dec 2022", "job_title": "Customer Success Manager", "duration": "N/A", "pros": "Remote and a useful tool for scm and CICD for small or pwrsonal projects.", "cons": "Managers and VPs have no idea whats going on at the customer level. Decisions are made without thought. Last minute scrambling and disorganization rampant. Not an enterprise product. Lots of bugs and lacking profressional grade features of the competition."}, {"review_title": "Pretty Underwhelming", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "20 Oct 2022", "job_title": "Sales Development Representative (SDR)", "duration": "N/A", "pros": "I took a 50,000 dollar pay cut in my salary/OTE to work at GitLab because I heard so many great things. Easy career growth, a team that wants you to succeed, flexible working hours, etc. Do NOT be fooled. Remote Work is a plus, and for the most part all of my co-workers were pretty awesome. GitLab itself tries really hard to make the company have a great and inclusive culture, and I think it exceeds in that EXCEPT for in their Sales org. Oh, also the benefits are pretty excellent, great health insurance.", "cons": "Difficult monthly quota to hit without the ability to prospect and get your own leads. This leads to some months being lather lackluster The pay for this sort of position is pretty low. You set up a deal for 500k+ and get 30-40 bucks for it. Although they offer unlimited PTO, good luck hitting your quota if you ever take time off. Like I said, this is an inbound gig. To hit your quota, you essentially have to book a meeting and have a qualified meeting EVERY SINGLE DAY. If you take time off, that rhythm is disrupted and you also lose out on all of the leads that should have been routed to you. Although GitLab prides itself in its transparency, there is NO decorum in the slightest when it comes to its sales processes. You hear something different every day depending on who you talk to about what you should and shouldn't be doing. On top of that, you have teammates constantly stealing YOUR leads and capitalizing off of the work you've done prior. For example, you work a lead, they say they'll talk to you in two months. They reach back out and someone on your team will swoop in on that within seconds, delete your salesforce comments and work it themselves. Having to constantly go to managers to audit this and get credit on things stolen from you when you're stressed about hitting quota is extremely toxic."}, {"review_title": "Good company questionable leadership", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "20 Jul 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- very good peers \n- flexible time off\n- 1 Friday off per month \n- great documentation system\n-decent benefits", "cons": "- upper leadership micromanagement\n- no responsibility on other teams to communicate\n- poor sales and sales dev training. They say it's good but it's not and for over a year nothing was done to fix it\n- leaders with 0 emotional intelligence to the point of it being shocking\n-below market pay for a all remote tech company\n-no consistency in hr . Some ppl are amazing others don't even know how they got the job\n- your hb is way too long and not as easy to navigate as the company claims\n- leaders will be gone without anybody explaining. Happened twice during my time there and it was odd and not at all in line with the supposed transparent culture."}, {"review_title": "Overall review", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "14 Jan 2023", "job_title": "Senior Business Development Representative", "duration": "N/A", "pros": "Flexible worktime and super career opportunities", "cons": "Cannot define cons so far 1yr in company"}], [{"review_title": "A company a recommend to friends and family", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "27 Jun 2022", "job_title": "UX Researcher in Alexandria, VA", "duration": "N/A", "pros": "-They have unlimited PTO which is seamlessly integrated with the company's messenger and requires no approval if less than 2 weeks for each submission.\n- While not quite as transparent as the pre-IPO days, the level of transparency in the public facing handbook still beats every other company and rivals some academic institutions in terms of quantity of valuable information. (such the the entire UX dept handbook, which can be viewed by anyone and helpful for any UX dept in the software space).\n- The real commitment to Diversity, Inclusion & Belongingness both in terms of leadership action and fiscal backing is pretty nice. There can always be more done, but the company does take their values very seriously.\n- Every person operates independently by working from home (even the CEO), and the large majority of meetings can be either rescheduled or missed and reviewed later a-sync. The entire company is built on a-sync, WFH workflows so I flexibility is unparalleled and very suited for the post-pandemic world.", "cons": "-Because each person handles their own schedule, some people can either become a little lazy at times, or extremely tired and overworked at other times. But there are mental health resources to help prevent burnout."}, {"review_title": "Great culture! Some growing pains", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "14 Nov 2022", "job_title": "Business Development Representative", "duration": "N/A", "pros": "GitLab had a great culture and because of that the people that work here are great as well! Everyone is very collaborative, supportive, and the remote work definitely lets you have flexibility when needed", "cons": "Since IPO GitLab seems like it wasn’t prepared for the growth it experienced and because of that there’s still some growing pains when it comes to processes and market awareness"}, {"review_title": "As good as it gets for remote work culture", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "27 Oct 2022", "job_title": "Senior Product Manager", "duration": "N/A", "pros": "- Remote work and asynchronous autonomy at their best. - Transparency, Many meetings are recorded and published online for the world to see. - Developers across the industry know GitLab and have a positive opinion about the product.", "cons": "- There have been a lot of difficulties with managing the Stock Incentives. - There have been security issues. - Personal privacy is compromised because too much information about employees is publicly available on Youtube and in GitLab.com"}, {"review_title": "Salary vs Benefits", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "13 Nov 2022", "job_title": "Sales Representative", "duration": "N/A", "pros": "Compensation is average country based for the role", "cons": "Global Benefits below average. Being an all Remote Company, it’s difficult to get hold of the right people when you are in need. In some countries they do not have an entity, which creates even bigger challenges in the communication as well as understanding who is responsible for the benefits."}, {"review_title": "Not the paradise they promised", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "23 Sept 2022", "job_title": "Technical Account Manager (TAM)", "duration": "N/A", "pros": "Disclaimer: The below is based on my own experience in the CS organization, and may differ from other people's experience in other organizations at GitLab:\n\n- Full remote culture\n- Good benefits (health insurance, internet bills, remote office equipment)\n- Inclusive teams\n- Unlimited PTO (no need to ask for permission, just inform)", "cons": "Disclaimer: The below is based on my own experience in the CS organization, and may differ from other people's experience in other organizations at GitLab:\n \n- Low salary. It is not a global salary, it is based on your location, so unless there's specific laws where you live, the salary will be significantly lower than other companies. \n- Async doesn't apply to all roles, specially customer facing roles\n- Micro-management in every sense\n- Work-life balance (inexistent, not like advertised) \n- Poor training and ramp up. Too long and don't add up value to the daily basis\n- Lack of processes\n- Not enough time to learn\n- People are often times not so collaborative. They take from a fact that you will be able to know every aspect of DevOps, even if you're not coming from the DevOps sector or background.\n- Company cares about results and don't care too much about your work-life balance\n- They send you to the field expecting you to become an expert, but don't provide tools to help you understand customer's perspective of the product.\n- Customer Success metrics are too much (impossible to hit them all). They are based on assumptions and they used a poorly made CS software.\n- Transparency is a myth (not like advertised) . People can provide feedback to your management without putting their name on.\n- Employees with more seniority in the company control every aspect of the organization. New hires don't feel part of the team and are judged based on their social skills. Even though if you're based in EMEA you will have to deal with that type of judgment from AMER people.\n- They say you can work from anywhere, but they force you to put your camera on at all times\n- Career opportunities are almost null. It is hard to move to other teams once you're in there"}, {"review_title": "A marriage between Open Source ethos & business", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "17 Jun 2022", "job_title": "Director", "duration": "N/A", "pros": "I love how clear the vision of GitLab is to be a best-in-breed Open Source player in the market. GitLab continuously makes it clear that the community is able to co-create GitLab and that we should, not only care, but treasure those that want to contribute. I've worked in many open source companies before, but this is the first where I see the open source ethos values being carried out in all departments. I also love that there are so many good-hearted people, including management, that genuinely want to do the right thing.", "cons": "In the first couple months it felt a bit like chaos theory. There is just so much that it is overwhelming and even feels unmanageable. Given that it is remote, doesn't make this much easier, but this is only a very minimal con - and not much that I see that can be done about that. This is the cost of being extremely transparent, but I would never advice to be less transparent - so keep it up"}, {"review_title": "Best Company I Ever Worked For", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "12 Nov 2022", "job_title": "Senior Backend Engineer in New Brunswick, NJ", "duration": "N/A", "pros": "Work life balance and they actually mean it", "cons": "All remote means it can be a little hard to navigate the path to promotion. Compensation is a little lower than competitors."}, {"review_title": "Lack of leadership, vision and strategy. Driven by sales and product politics.", "rating": "3.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "23 Sept 2022", "job_title": "Staff Engineer in Berlin", "duration": "N/A", "pros": "- You can easily float if that is what you want\r\n- Define your own focus areas\r\n- Work and learn things that are of your personal interest (within some boundaries)", "cons": "- No growth opportunities, there is simply no concept for career progression\r\n- Lack of vision across leadership\r\n- Lack of a technical long-term strategy and consensus driven development\r\n- Driven by sales and product (and therefore politics)"}, {"review_title": "Too Good to Be True? Nope!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "21 Jun 2022", "job_title": "Technical Account Manager", "duration": "N/A", "pros": "They really practice what they preach here at GitLab! I have only been here a couple months, but the autonomy I have as an employee has significantly affected my work-life balance in favor of life. The unlimited PTO is real and people actually use it. The non-linear work schedule is also great. I can log off (assuming no customer calls) and go grocery shopping, grab lunch with a friend, whatever. It's about results and our company believes happy employees drive great results.", "cons": "We seem to be growing faster than we are hiring, so I am ever so slightly worried about burnout. (But only slightly since the unlimited PTO thing is actually real.) Also, I am in the public sector and the greater company leadership doesn't understand all the random nuances that come with it, so that can be frustrating but there is a lot of top cover from my direct management."}, {"review_title": "I almost quite corporations before joining GitLab", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "23 Mar 2022", "job_title": "Analyst", "duration": "N/A", "pros": "Where do I start?\r\n\r\n- Fully remote\r\n- Awesome leadership\r\n- Incredible work life balance including flexible schedules and unlimited (actually unlimited) PTO where you don't feel guilty for taking it\r\n- Phenomenal benefits including free healthcare, office equipment reimbursement, and cool swag\r\n- Competitive and transparent salary (I was offered over my expected salary range)\r\n- Amazingly detailed onboarding that is time consuming and at times overwhelming, but absolutely necessary and truly sets you up for success within the company\r\n- The nicest, hardest working, and most genuine co-workers I have ever had and supportive managers", "cons": "I do think GitLab does a better job in comparison to other companies in bringing in diversity for leadership positions, but they still have work to do though I know they're on it.\r\n\r\nI would like to see more reinforcement of GitLab values. My fear is that as we continue to grow and scale, there will be team members that don't care to uphold our values and follow our handbook which are important pieces of GitLab and what I feel really sets us apart in terms of a place of employment."}], [{"review_title": "Smart people, terrible leadership", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "28 Apr 2022", "job_title": "Marketing", "duration": "N/A", "pros": "- Being around some incredibly smart and great people\n- Pushing the remote culture for the greater world\n- People willing to help out to accomplish greater goals", "cons": "- Values are only followed by leadership when convenient. Particularly around transparency around goals and expectations. Decisions and data are only shared among select individuals in marketing where goals are a constant moving target.\n- There is no SSOT datasource and there are ongoing inaccurate data issues that make doing your job, difficult\n- Disagreeing with leadership can get you shown the door. Many groups have a \"do as I say\" mentality.\n- There is no stability in marketing leadership. It is a revolving door with leadership \"mutually agreeing\" to the leave organization.\n- Handbook and documentation can often be used as a weapon against you.\n- Pay is well under industry benchmarks. Annual review cycles will rarely get you more than 5-10% salary increases."}, {"review_title": "Very limited career progression opportunities", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "16 Aug 2022", "job_title": "Senior Product Designer", "duration": "N/A", "pros": "* most people are great colleagues\n* quite good remote-first company with the asynchronous communication being preferred", "cons": "* feels very American as most team members (and most of the leadership) are US-based\n* it changed since the IPO, now reaching profit ASAP is the most important thing\n* poor allocation of resources\n* poor people management\n* a lot of incompetence among the leadership\n* very limited opportunities for career progression in the design team"}, {"review_title": "Amazing Culture, Competitive Compensation, Outstanding Product!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "4 Jun 2022", "job_title": "Technical Account Manager", "duration": "N/A", "pros": "The culture is supportive, everyone on the team helps each other succeed. Leadership has very intelligent strategy and transparently communicates this internally and publicly. The Gitlab single DevOps platform created this space and is leading the marketplace. Most of our customers are raving fans of the product, it's that good. The all-remote culture is intentionally crafted to cultivate collaboration and teamwork to produce winning results.", "cons": "Haven't noticed anything lacking or needing improvement that Gitlab leadership hasn't already identified in transparency and communicated a plan to address. This company moves quickly execute on its plans so I have a lot of confidence in its ability to execute. My employment at Gitlab exceeds my expectations."}, {"review_title": "Great Company…In Transition", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "17 Apr 2022", "job_title": "Manager", "duration": "N/A", "pros": "- Thoroughly enjoyed my time at GitLab\r\n- Amazing product that just keeps getting better\r\n- Fantastic culture of all-remote\r\n- Flexible work schedule\r\n- Leaders that live the values\r\n- Transparent CEO who is accessible, visionary, and inspirational \r\n- Excellent professional development reimbursement\r\n- Forward thinking, cutting edge organization design\r\n- Smart and collaborative coworkers\r\n- Accessible leadership\r\n- Straight shooters, not-very political", "cons": "- Information and cognitive overload due to amount of information being exchanged. Pace never seemed to let up even after IPO \r\n- Everyone can contribute applies to your individual work and can slow you down as anyone can assign you something to do. Have to learn to say “No” here more than most jobs\r\n- A bit robotic at times"}, {"review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "10 Nov 2022", "job_title": "Candidate Experience Specialist in Cork", "duration": "N/A", "pros": "Remote working Unlimited PTO Asynchronous working Home office set up", "cons": "None at the moment after 7 months"}, {"review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "4 Nov 2022", "job_title": "Account Executive in Amsterdam", "duration": "N/A", "pros": "Great place to learn and make great connections. Benefits are some of the best I've ever seen.", "cons": "Can't think of any relevant negatives."}, {"review_title": "Great culture", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "13 Nov 2022", "job_title": "Backend Engineer in Vancouver, BC", "duration": "N/A", "pros": "Great culture and good pay", "cons": "A bit slow sometimes but it’s all good"}, {"review_title": "Best company culture I've encountered", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "5 May 2022", "job_title": "Product Analyst", "duration": "N/A", "pros": "I've been raving about working for GitLab to everyone who will listen. I'm so glad I decided to take this job. \n\nGitLab does things in a completely unique way even for remote tech. Asynchronous work means less meetings, more trust, more flexibility, and more creativity. \n\nI love feeling completely comfortable working when I feel most productive and taking time to exercise or enjoy my life outside of work.\n\nI'm cranking out more work than I was ever able to at companies with 3-5 hours of meetings per day, and still fitting in all of the things I need to take care of myself like walking my dog at lunch.", "cons": "There is a ton of documentation to read through to learn the product and team info which could be super difficult for some, but even if you are neurodiverse, there are plenty of resources to thrive. I downloaded a few text to speech tools which are super helpful."}, {"review_title": "Wolves in sheep's clothing", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "17 Dec 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Amazing product\r\n\r\nMany truly good people\r\n\r\nThe CEO is one of the most humble and kind you will see\r\n\r\nThe remote environment is decent\r\n\r\nSalaries are within the market average", "cons": "All people in GitLab are equal, but some are more equal than others.\r\n\r\nThe handbook is suggestions and subject to major changes overnight, with most of it is over inflated and ambiguous. This is my opinion as it's publicly available.\r\n\r\nToxic positivity. \r\n\r\nManagement are Gods that have amazing powers to shape reality as they please. Visit the\"leadership\" page at the time of writing to know more.\r\n\r\nNDAs and Contracts. They are differently something. I have never seen a senior lawyer so shocked by a few pieces of paper before.\r\n\r\nDiscrimination, retaliation and favoritism basically doesn't exist. Because they said so.\r\n\r\nThere's a public page in the handbook at the time of writing titled \"Process for Tracking and Escalating Glassdoor Reviews\" with a point of, and I quote \"Negative reviews about GitLab or our culture in general, at the company level: A People Business Partner or member of the People Group (in rare cases, CPO)\". \r\n\r\nI got prompted various times during my first month to leave a Glassdoor review and now I know why.\r\n\r\nLastly, people are expendable. A large number of \"employees\" are legally just contractors, making them vulnerable and protect GitLab from reporting the real world actual turnover rate.\r\n\r\nI wouldn't recommend GitLab to my enemies. Worst mistake in my career."}, {"review_title": "Good working environment", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "2 Nov 2022", "job_title": "Software Engineer in Madrid", "duration": "N/A", "pros": "Flat hierarchy and motivated coworkers", "cons": "No complains other than not enough PTO"}], [{"review_title": "Best place I've worked in", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "7 Oct 2022", "job_title": "Senior Site Reliability Engineer", "duration": "N/A", "pros": "- Work life balance - Remote work culture - Preference for asynchronous communication, letting you organize your time as you wish and limiting video meetings to a minimum", "cons": "- Competitive salary but still behind Amazon/Google/Meta"}, {"review_title": "Great company but needs to innovate internally", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "18 Mar 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "GitLab is an absolutely amazing company to work for! I love the flexibility the all-remote organization has. Everyone is super passionate about what they do. Leadership is very approachable and it's an exciting place to be. There are a lot of cool initiatives taking place to push the organization further. I'm so fortunate to work for a company like GitLab and the sky is the limit.", "cons": "Only two cons that are top of mind since I've been here: \r\n1. Tone it down on the wokeness a bit. I'm all for Diversity, Inclusion, Belonging but at times I feel like I can only go so far here since I'm a \"white male.\" I've heard this term more at GitLab than any other job and it's exhausting. It makes me fearful for advancing because of my \"identity\" and not on \"merit.\" \r\n2. There needs to be some changing internally to how we operate. There's major communication overload and at times it feels to internally focused. What worked when the company was 500 people, doesn't work anymore now that we are 1300. I'd encourage leadership to be open to new ways of working and experiment more. There is a lot of fear of losing the all-remote culture, but GitLab can continue to be an innovator in this space if they try out new things."}, {"review_title": "Such an amazing company", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "12 Oct 2022", "job_title": "Business Development Representative (BDR) in Toronto, ON", "duration": "N/A", "pros": "Benefits\r\nFlexible work hours\r\nGreat management team\r\nFamily and friends first policies \r\nAmazing employee handbook \r\nFair environment", "cons": "I have been working at GitLab for 3 months and have no cons so far"}, {"review_title": "Great products! Great Culture! All-remote!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "16 Aug 2022", "job_title": "Manager in San Francisco, CA", "duration": "N/A", "pros": "GitLab's value proposition is a single automated DevOps platform with security baked in. This allows our customers to develop and deploy their business applications much more quickly (and securely) than they can with traditional DevOps approaches.", "cons": "As the company has grown and now gone public, there is more internal bureaucracy which slows down decision making."}, {"review_title": "Good place", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "26 Oct 2022", "job_title": "Backend Developer", "duration": "N/A", "pros": "Good place to work oberall", "cons": "Nothing as its a good place to work"}, {"review_title": "I loved it when I joined 3 years ago and I still do", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "30 Aug 2022", "job_title": "Sales", "duration": "N/A", "pros": "* Incredibly kind and hardworking people\n* The product is amazing \n* The company really strives to live its values every single day\n* Remote culture is second to none", "cons": "* Some processes could do with updating"}, {"review_title": "Amazing company values, leadership and vision", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "3 May 2022", "job_title": "CS Operations Analyst in San Francisco, CA", "duration": "N/A", "pros": "Had certain expectations when I joined and I am happy to say that the company has far surpassed them. \r\n\r\nThe attention to making people feel that they belong, care for diversity and inclusion, remote work training, accommodations for creating your workspace, support for learning have all been amazing!\r\n\r\nMy team and team leaders have all been super supportive, giving me the right balance between providing guidance and allowing for autonomy, which I really enjoy.", "cons": "I have not identified many at all at this point in my journey with GitLab. This is going to sounds odd, but maybe there is a bit too much documentation? Having too much of anything can make things be a little overwhelming. That is the only thing I can think of."}, {"review_title": "Great place to work.", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "17 Oct 2022", "job_title": "Solutions Architect", "duration": "N/A", "pros": "Very glad to be here", "cons": "Frustrating internal systems. (HR, Benefits, etc)"}, {"review_title": "Everything changes all the time", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "20 Sept 2022", "job_title": "Anonymous Employee in Washington, DC", "duration": "N/A", "pros": "Incredible people \nFlexible hours\nCreativity", "cons": "Too much change \nNot enough support"}, {"review_title": "Not everything that sparkles is gold", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "8 Jun 2022", "job_title": "Technical Account Manager", "duration": "N/A", "pros": "Family and friends day monthly. Learning and development $10,000 spend per year. Employee stock program. Discretionary bonus. Provided company laptop with 3 year refresh.", "cons": "Cool handbook but no one actually lives by the values. Very cult-like and  people try too hard to flex knowledge without being helpful. Async culture is used when convenient but tons of meetings throughout the workday which makes it hard to get any real work done. Lower pay than companies of equivalent size."}], [{"review_title": "The Leading DevOps Platform", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "28 Sept 2022", "job_title": "Account Executive in Sydney", "duration": "N/A", "pros": "- Flexible work environment \r\n- Fantastic product \r\n- Great, innovative people", "cons": "- Lack of private health care in ANZ"}, {"review_title": "Amazing company to work for", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "25 Jul 2022", "job_title": "Director, Strategy and Operations", "duration": "N/A", "pros": "- All-Remote\n- Flexible working hours\n- Asynchronous work\n- CREDIT Values\n- Results, not hours\n- Family and Friends first", "cons": "- Can easily find oneself working too much given no set working hours\n- Some lack of cross-functional collaboration, but excited to fix that"}, {"review_title": "Not quite its reputation", "rating": "3.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "1 Jul 2021", "job_title": "Talent Acquisition in Los Angeles, CA", "duration": "N/A", "pros": "Some of the people are really great and the product itself is really believable and it makes you proud\r\nIf you enjoy being left to your own capabilities to find out the answer to your questions then its great very empowering", "cons": "Unfortunately so many things \r\nThey pay sign on bonuses for recruiters which is underheard of (mostly) except if you are fit the age old mold of cis white male\r\nThey dont value the team that have been there the longest and refuse to give them pay increases even when the work load has increased x5 \r\nThey ask illegal questions such as why are you taking vacation on such days \r\nThere is 0 diversity coming from the 2 VP's any role they have someone in mind that they used to work with will automatically be hired,internal and external candidate's sometimes dont even get a response or acknowledgement of applying\r\nThe leadership VPs rarely get to know their team and leave the more challenging things to everyone else \r\nThere is no road map on how to progress \r\nThey will block you from applying for internal positions\r\nDont expect your efforts to be recognised in this team but the engineers are well looked after and thats actually great"}, {"review_title": "Great company", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "20 Sept 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Very good benefits at this company", "cons": "Management is a little pressed"}, {"review_title": "Gitlab is great", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "12 Sept 2022", "job_title": "Strategic Account Leader", "duration": "N/A", "pros": "Very fast growing and excellent product, strategy", "cons": "Growth pain, too much stick to segmentation"}, {"review_title": "Great Product, Excellent Culture, Customer Focused Team", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "7 Aug 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "GitLab lives and breathes its CREDIT culture -- collaboration, results, efficiency, diversity & inclusion, iteration, and transparency. One of the most open, transparent, AND trusting companies you'll find.\n\nLeading-edge about how to work remotely.", "cons": "Adapting to 100% remote can be a challenge for some."}, {"review_title": "Excellent so far", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "22 Aug 2022", "job_title": "Backend Engineer", "duration": "N/A", "pros": "Async work is amazing. The people are amazing.", "cons": "None really so far. It definitely takes some time to get used to how the company works together and that can be a little nerve racking."}, {"review_title": "A nightmare", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "24 Dec 2021", "job_title": "Sales", "duration": "N/A", "pros": "The product is good\r\n\r\nMost team members are good people and fun to work with.\r\n\r\nThe salary is up to market standards", "cons": "The worst management and executive management I have seen in my life. They make it very clear that \"gitlab is not a democracy\" and it is in fact fully reliant on how much your direct superiors like you. The sales organization is suffering the most of this. \r\n\r\nThe handbook is useless. No one follows it, and those who do are blamed for doing so. There are no processes for hiring, firing, promoting or even set metrics. Direct managers have full control to do whatever they feel like doing with employees. \r\n\r\nPerformance, quality, effort, and metrics are extremely ambiguous and untraceable, differs from person to person based on the whims of managers and no one can say you reached them aside from the manager's word of mouth.\r\n\r\nCriticism and objections are unofficially prohibited as long as they are coming from non-managerial employees.\r\n\r\nThe culture is toxically positive. Passive aggression and favouritism is common place.\r\n\r\nNo appreciation whatsoever for employees, and people just disappear daily with no previous notice.\r\n\r\nI would share more details, but the nda and contract threats and promises of legal retaliation prevents me from doing so."}, {"review_title": "All Remote", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "2 Sept 2022", "job_title": "Sr brand designer", "duration": "N/A", "pros": "• All Remote\n• Async work style\n• Work-life balance\n• Great morale", "cons": "• Slow on getting a response\n• Short deadline"}, {"review_title": "Mature remote culture + unmatched flexibility, but some challenges with scale", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "24 Aug 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Working at GitLab is like getting a degree in remote work. They are relentlessly committed to writing things down and reinforcing asynchronous work.  Once you've experienced having the entire company using the same tool to communicate and collaborate on work, you won't want to go back. \r\nBy focusing on results delivered instead of time spent on work, you're free to make your own hours and get things done without being micro-managed. Pandemic aside, there are some fun opportunities to travel and meet up with teammates around the world.", "cons": "Scale makes everything harder, including maintaining culture and practices. People coming from more traditional workplaces default to busywork and lots of meetings (no shade, it's what a lot of people are used to!) instead of being thoughtful about what deserves time and effort. \r\nThere are many layers of the org to navigate to get anything off the ground, and the tendency now seems to be toward inertia rather than trying creative new things.\r\nSalaries are not competitive now that so many other tech companies are remote and offering SF base pay.\r\nAt this scale, individual successes and achievements are more highly valued than collective ones. This isn't wrong, but doesn't feel great for those who joined the less mature company which had less of a focus on personal bonuses and being \"key talent\""}], [{"review_title": "Great Company", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "2 Sept 2022", "job_title": "Named Account Executive in New York, NY", "duration": "N/A", "pros": "-product\n-leadership\n-vision\n-work/life balance", "cons": "-changes occur very often without much warning"}, {"review_title": "Nice company with great principles", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "25 Aug 2022", "job_title": "Service Engineer in Boston, TN", "duration": "N/A", "pros": "Good pay rates\nNice remote working community", "cons": "No downsides. Really cares for employee motivation"}, {"review_title": "Great company", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "28 Aug 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Remote work, work life balance, strong values", "cons": "Nothing to share at the moment"}, {"review_title": "Limited growth and a lot of \"for show\" practices", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "25 Apr 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "flexible schedule and unlimited vacation", "cons": "The teams were definitely strategically separated. Executives were unapproachable and highly ego driven. The glass ceiling definitely exists if you are not one to generate a lot of fluff - genuine hard work is severely overlooked. D&I is a joke - people do not have a safe space to address any concerns. Despite being a global company, inclusivity is lacking."}, {"review_title": "Great Company", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "19 Aug 2022", "job_title": "Senior Account Manager", "duration": "N/A", "pros": "Great company that truly embodies their values in every single way.", "cons": "Some growing pains with rapid growth."}, {"review_title": "Big fan", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "11 Aug 2022", "job_title": "Sales Representative", "duration": "N/A", "pros": "transparency, all remote, people, benefits, flexible hours, people first", "cons": "all remote can be challenging for some, but they give you support and resources"}, {"review_title": "All-remote bullying", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "22 Nov 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "None, I found it to be some sort of utopia.", "cons": "The company is growing at a fast pace and hires a lot of new talent who not necessarily follow or even behave anywhere close to the values listed in the company handbook.\n\nI've never seen worse disorganisation and unprepared managers than at GitLab but I believe there are some better structured and reasonable teams within the organisation than the one I had the misfortune to be a part of.\n\nThe all-remote concept seemed to be backfiring in my department and instead of collaboration I had experienced hostility, ignorance and even virtual bullying so that someone else could get on with their agenda or get away with their lack of preparedness. It's all easily applied as there are people there who clearly think they can afford these behaviours as they won't have to ever see you face to face.\n\nI've decided to quit because this was the worst experience in my career and just not worth my time.\n\nOn a side note, the people experience team forgot to have an exit interview with me hence here's my feedback especially since my manager was not interested to hear it either."}, {"review_title": "Worklife Balance", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "15 Aug 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great worklife balance and great colleagues", "cons": "None I can think of"}, {"review_title": "A Company Built by Engineers for Families", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "4 Jan 2022", "job_title": "Technical Account Manager in Longmont, CO", "duration": "N/A", "pros": "-The ability to work anywhere asynchronously with your co-workers. The new found freedom gained with your loved ones and or family is life changing.\n-Working with highly motivated and highly intelligent individuals. With the company's core values, everyone is expected to be engaged for our and our clients betterment.\n-GitLab is an amazing product for DevOps and DevSecOps. There aren't any places you will work where you get credibility from industry peers by name alone.", "cons": "-The company requires highly motivated self-starters. Due to the nature of a remotely distributed company with asynchronous work, you will need be scrappy at collecting data and good at your own project management.\n-While GitLab does a fantastic job of creating social events to kindle relationships between peers, it obviously will never have the same kind of social environment as an in-person employer."}, {"review_title": "Async work is incredible", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "26 Aug 2021", "job_title": "Senior Backend Engineer", "duration": "N/A", "pros": "If you're coming from a more \"traditional\" workplace, working for GitLab is literally life-changing. You can work whenever you want, wherever you want. A lot of the annoyances involved with typical workplace culture are also not present:\n- No emails - Everything happens in GitLab and Slack\n- All meetings are optional - You can totally get away with skipping all of them if you wanted. Every meeting has an agenda document that everyone edits, and you can still participate even if you don't go. \n- No offices - Might be a con for some people, but I'm easily distracted and don't care for water cooler talk, so this is a big plus for me. There's a lot of encouragement to have \"coffee chats\" (social calls) with coworkers so that you still have that social aspect.\n- Stuff actually gets written down - Big peeve for me at previous workplaces where people would decide everything in meetings and never write anything thus leading to a culture of tribal knowledge. At GitLab you take a week off and not have to wonder what happened while you were gone.", "cons": "Async does mean that communication has a longer turn around time. Patience and good writing skills required."}], [{"review_title": "Recent Hire", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "30 Jun 2022", "job_title": "Senior Recruiter in Sydney", "duration": "N/A", "pros": "Asynchronous working\r\nCulture is great\r\nSpeaking to different people in different regions and cultures", "cons": "None so far. I think there are a lot of positives and no company is perfect but a lot of pros."}, {"review_title": "Company Lives up to its culture", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "13 Jun 2022", "job_title": "Strategic Account Lead in Atlanta, GA", "duration": "N/A", "pros": "Collaborative environment with a genuine culture of transparency. Very strong management with clarity on vision.", "cons": "I have not detected any cons so far outside of normal growing pains for a company growing so fast"}, {"review_title": "Fantastic place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "25 May 2022", "job_title": "Support Engineer", "duration": "N/A", "pros": "Flexibility\nAutonomy\nExcellent salary\nFull of lovely people", "cons": "Not many opportunities to meet with team members if you are very remote.\nWork from home lifestyle is not for everyone (it certainly is for me though)."}, {"review_title": "Not applicable for this job", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "13 Jul 2022", "job_title": "Business Development Representative (BDR)", "duration": "N/A", "pros": "Not applicable for this job", "cons": "Best company I've worked so far"}, {"review_title": "Account Executive", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "9 Jun 2022", "job_title": "Account Executive", "duration": "N/A", "pros": "Great technology that is truly disruptive", "cons": "The sales territories are very saturated at this point and it seems the motion is to growth and headcount over seller’s commissions."}, {"review_title": "Amazing Product, People, Culture, and Customers", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "14 Apr 2022", "job_title": "AREA SALES MANAGER in Wichita, KS", "duration": "N/A", "pros": "best place I've ever worked\r\n\r\nLeadership and team members live the CREDIT Values (Collaboration, Results, Efficiency, Diversity, Iteration, and Transparency). \r\n\r\nmore transparent than anywhere I've worked\r\n\r\nyou will learn a ton and come out a better person, focused on delivering value to your customers and team members.", "cons": "post IPO culture not the same (not as fun) as the road to IPO"}, {"review_title": "The best company to work for!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "8 Oct 2021", "job_title": "Engineering Manager", "duration": "N/A", "pros": "So transparent about everything we do. GitLab really lives by its values every single day and we apply them in everything we do. Benefits are very very good too! Though GitLab is an all-remote company, there are so many recurring events/activities and encouraged coffee chats with team members that make us feel very connected to each other. The idea that everyone can contribute is very accurate from the very first day and they trust you to make decisions regardless of how long you've been here. It really feels like family (they also even say family comes first) and I'm grateful to be a part of this embracing and talented team!", "cons": "Honestly, there is nothing I can think of."}, {"review_title": "Asynchronous > Remote FOR LIFE", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "28 Apr 2022", "job_title": "Senior Recruiter", "duration": "N/A", "pros": "A-synch communication makes working from home realistic \nNotes, documentation, source of truth allows everyone access and input, regardless of location\nWide scope\nResults are based on metrics, not social performance", "cons": "401k \nBenefits could be beefier (having come from other tech companies)"}, {"review_title": "A unique, fully-remote company with a strong culture", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "2 Nov 2021", "job_title": "Director of Strategy and Operations in Brooklyn, NY", "duration": "N/A", "pros": "* One of the strongest company cultures that I've witnessed so far, read the handbook which will give you a strong taste since it's public and a living document that we continue to update daily to ensure it reflects how the company works and operates. \r\n* Lots of interesting work to do\r\n* Smart team\r\n* Good compensation\r\n* Extremely efficient company", "cons": "* Fully remote has the expected drawbacks around socializing. There are mechanisms to get around this, but at times I miss the unstructured, unscheduled socializing at the office.\r\n* Diversity, like in most tech companies, is not good. Only 6% of the **global** workforce is Hispanic or Latino and just 3% is black or African American per data reported as of 2021-07-31."}, {"review_title": "Great company to work for but salaries could be better", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "19 Apr 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Unlimited PTO (they recommend taking off at least 4 weeks off and remind you often to ensure you are taking breaks)\nRSUs\nLearning and career improvement opportunities", "cons": "Salary is low compared to other companies\nRemote isn't really a benefit anymore when so many other companies are doing it already\nStock is given based on your location"}], [{"review_title": "Culture", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "6 Jun 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Unlimited ORO and Family & Friends day monthly❤", "cons": "Iteration which is a value for GitLab is not observed by other managers."}, {"review_title": "Highly recommend working here", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "13 May 2022", "job_title": "Customer Support Engineer", "duration": "N/A", "pros": "Great compensation\r\nPerfect balance between work and personal time\r\nCompany does care about my wellbeing in all aspects", "cons": "Sometimes lack of order.\r\nManagers could be overloaded and have no time to make sure their reports are doing good job."}, {"review_title": "Amazing, high growth company.", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "15 May 2022", "job_title": "Account Executive", "duration": "N/A", "pros": "Amazing company to work for. Excellent career growth and the company cares about you. Leadership is always looking to find ways to advance your personal growth.", "cons": "No cons at this time."}, {"review_title": "Great company to work for with excellent work/life balance.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "14 May 2022", "job_title": " in San Antonio, TX", "duration": "N/A", "pros": "Work from home.\nAble to meaningfully contribute.\nExcellent family/work life balance (family first)", "cons": "Lack of social interaction on a daily basis."}, {"review_title": "Good Place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "26 May 2022", "job_title": "Senior Software Engineer in Chicago, IL", "duration": "N/A", "pros": "The job is remote which is nice", "cons": "The job is remote which is sometimes not nice"}, {"review_title": "Great gig even with chalenges!", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "1 May 2022", "job_title": "People Team", "duration": "N/A", "pros": "CEO - Genuine, open to change, approachable\r\n100% Remote - No office to even think about having to go there\r\nIPO success - Great payout on my vested options", "cons": "Sometime s slow to hold people accountable"}, {"review_title": "Best Place I've Worked", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "28 Apr 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Best place I've worked.\r\n\r\n- Work / Life balance is excellent.\r\n- You're really trusted to get on with the job.\r\n- Great management \r\n- Benefits have been reviewed and improved several times.", "cons": "Nothing I can think of!"}, {"review_title": "A company that makes flexibility a reality", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "21 Jan 2022", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "Being an all-remote company there is plenty of autonomy and flexibility to work in the way that's best for you.\n\nLeaders and most people at GitLab very much embrace the values which leads to a collaborative, transparent, results-oriented environment. \n\nPeople are encouraged to make contributions they think are important, even if it's outside of someone's scope of work.", "cons": "Being an all-remote company there can often be a lot of written updates that need to be processed. It can be a little tough to keep up on everything that's happening."}, {"review_title": "Solid overall but culture isn’t for everyone", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "7 Apr 2022", "job_title": "Sr Manager, Sales Strategy", "duration": "N/A", "pros": "Strong growth trajectory and efficiently run company", "cons": "Remote first culture can be antisocial, not a fit for folks that like to see coworkers in person frequently"}, {"review_title": "GitLabs great", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "28 May 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Awesome culture, great product, very supported", "cons": "No red flags, future looks bright"}], [{"review_title": "SMB Account Executive", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "8 May 2022", "job_title": "SMB Account Executive in Raleigh, NC", "duration": "N/A", "pros": "Great Leadership, fully-remote, great values, competitive salary, benefits.", "cons": "Growing public company - a lot of iteration happens. Be ready for change and adapt to it."}, {"review_title": "Not as cool as been told", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "11 Jun 2022", "job_title": "Sales Representative in Dublin, Dublin", "duration": "N/A", "pros": "Remote work\r\nReimbursement for work equipment", "cons": "Became too corporate\r\nMicro management\r\nBad management\r\nThey say they're flexible but they're not\r\nToo many cons....."}, {"review_title": "Part of inbound sourcing team", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "6 May 2022", "job_title": "Associate Sourcer in Bangalore", "duration": "N/A", "pros": "-Flexile work hours\r\n-Amazing work environment\r\n- satisfying salary structure\r\n-Great team mates\r\n-diverse work culture", "cons": "Unable to meet peers in person"}, {"review_title": "Employee Friendly Company", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "22 Apr 2022", "job_title": "GL Accountant in Chennai", "duration": "N/A", "pros": "They offer work from home setup, Yearly visit to US for their conference, Employee Reimbursement", "cons": "Nothing so far but better if you work in US Timing."}, {"review_title": "A company with a rare culture", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "30 Aug 2021", "job_title": "Solutions Architect in Stuttgart", "duration": "N/A", "pros": "The culture is unique in many ways and not just because it is an all remote company. You feel welcomed and get a lot of attention to chime in into your team so you can be effective as early as possible. The technology is awesome and sells very well and offers so many categories to specialize in. Onboarding seems well thought through and the company handbook is not just text but actually lived, I was very very much surprised by this. I am here for roughly two months and do not regret the change.", "cons": "There is a lot to learn and pick up. But if you are like me then this is all interesting technical stuff. I cannot really talk about cons because I have not found any."}, {"review_title": "Positive, team-member focused culture", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "29 Mar 2022", "job_title": "Senior Marketing Manager", "duration": "N/A", "pros": "The handbook details anything you could want to know about the company.\r\nExtreme collaboration, transparency and async work.\r\nValues are practiced openly", "cons": "Even start-ups can get stuck doing things they way they've \"always been done\" and resistant to change."}, {"review_title": "Interesting Company", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "30 Aug 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "On the cultivation of values and an intelligent atmosphere, sort of a rising tide lifts all boats situation. I've learned a lot in a short while from peers and the massive handbook that records many scenarios for future teaching. Benefits are terrific, work/life balance is more than lip service, and people are happy to help. Interesting, cutting edge.", "cons": "One could get lost in the bog of slack channels, issues, DMs and other communication tools. There at once seems to be a right way to present ideas and send messages, and yet there still seems to be a divide in what's sanctioned and what's practiced. People will happily teach you things, but the culture of self-learning sometimes makes it a last resort. Transparency and everyone can contribute should have boundaries."}, {"review_title": "Very good company", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "22 Apr 2022", "job_title": "Strategic Account Leader in Madrid", "duration": "N/A", "pros": "All remote. Good atmosphere. Best DevOps platform.", "cons": "Sometimes is hard to find the right info due to internal processes."}, {"review_title": "Remote Work Requires Remote Culture", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "10 Sept 2021", "job_title": "Backend Software Engineer", "duration": "N/A", "pros": "Just because a company allows for remote work doesn't mean it does it well. GitLab does since from its inception as a company it's been building a remote-first culture. Communicating asynchronously is embedded into the soul of the culture, so that it enables a truly asynchronous working experience.\n\nThis allows employees to have truly flexible schedules that accommodate for the other important things in life--family, friends, important work outside of work-work that we really care about.\n\nThe engineering culture is also A+. High standards are enforced through code reviews. It's a highly collaborative environment where GitLab issues are an easy way for anyone to submit an idea for discussion. I feel both supported and challenged to grow in my role.", "cons": "Not having a physical office is tough in that it's hard to build personal relationships and rapport with coworkers. Compensation is below market for companies of similar caliber."}, {"review_title": "The best company ever", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "14 Apr 2022", "job_title": "Senior Field Marketing Manager", "duration": "N/A", "pros": "Gitlab have own value for the work. It is very flexible and I am comfortable to work.", "cons": "I don't have any cons."}], [{"review_title": "Great company", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "21 Mar 2022", "job_title": "Manager in London, England", "duration": "N/A", "pros": "Great place to work, good work life balance and fairly treated", "cons": "after some time you can become aware of internal politics. But that is the same for most workplaces."}, {"review_title": "Too much talking, not enough engineering", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "3 Jul 2021", "job_title": "Software Engineer", "duration": "N/A", "pros": "- Fair geo-based compensation albeit on the lower end of the spectrum\r\n\r\n- Great work-life balance", "cons": "- Glassdoor score is heavily skewed due to the company pushing hard for reviews from new hires during the honeymoon phase, notice all 5 stars are from employees with less than 6 months at the company\r\n\r\n- Company focused more on office politics and discussions instead of getting stuff done\r\n\r\n- Innovation happens only outside the company via employee side projects or community projects that eventually end up integrated into the GitLab product\r\n\r\n- The GitLab product is a mix of half-baked unmaintained features where stability is an afterthought\r\n\r\n- Engineering lacks autonomy due to dogfooding[1] and the CEO Sid Sijbrandij micromanaging what technologies and practices are allowed to be adopted\r\n\r\n- Neglected security in fundamental parts of their cloud tech stack\r\n\r\n- Weak leadership doesn't provide cohesion across teams or measurable long term plans at the tactical level"}, {"review_title": "GitLab review", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "25 Apr 2022", "job_title": "Senior Solutions Architect", "duration": "N/A", "pros": "Great future, many nice very helpful people around", "cons": "still operates in the startup mode"}, {"review_title": "Best place to work!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "7 Nov 2021", "job_title": "Associate Sales Development Representative in Mainz, Rhineland-Palatinate", "duration": "N/A", "pros": "From the day I started interviewing with GitLab until today I have been super happy.\r\nThe culture is amazing and the home office is not boring as other companies can be. They encourage everybody to be who they are and you don't feel pressured because you are at home, you can do your work in peace and they count the results, not the hours spent.\r\nThe colleagues are amazing and always ready to help. \r\nIf you are a person who travels or moves from city or country often, this is your place. That was one of my principal worries and now I can be totally relaxed.", "cons": "The contrast would be that I should have joined before."}, {"review_title": "Good place to be, lots of room to explore", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "28 Mar 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Good amount of autonomy to work on areas you find interesting", "cons": "Lots of team members, which can make communicating information time consuming"}, {"review_title": "Amazing company who sticks true to their values", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "10 Sept 2021", "job_title": "Product Designer in Providence, RI", "duration": "N/A", "pros": "Aside from being able to work fully remotely, GitLab holds true to their values and continues to apply them to every decision made. Everything is open and documented in the Handbook which makes workflows much more efficient. No matter your position, your opinions are valued just as much as the next person's. GitLab has a very clear vision and they make sure that steps are taken and documented to get there. They also CARE about their employees!! Compensation is reviewed on a yearly basis to ensure you're getting a fair salary compared to the market, vacation is unlimited, with a no ask no tell policy, and everyone is extremely supportive.", "cons": "Haven't run into any thus far."}, {"review_title": "Great values, awesome benefits!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "26 Dec 2021", "job_title": "Support Engineer in Manila, Manila", "duration": "N/A", "pros": "- A company that actually practices the good values it promotes.\n- Puts great emphasis on the welfare of its employees.\n- Great work life balance.\n- Awesome benefits, above the median.", "cons": "- Not sure if this is really a con, but you have to make an effort in making connections with the global team members. That means you have to set some small amount of time to just chat with your other team mates from other regions."}, {"review_title": "Not the company it once was", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "31 Aug 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Flexible work hours, emphasis on async and delivering results rather than time online/behind a desk, incredibly talented team of individuals from all walks of life, company genuinely cares about all forms of diversity and emphasizes the importance of mental health", "cons": "Typical growing pain for a late-stage company, but the company values (collaboration, results, efficiency, DIB, iteration, transparency), particularly iteration and transparency, are quickly becoming obsolete. Leadership can be particularly prickly to work with, many positions lack actual and obtainable growth opportunities"}, {"review_title": "Great company!", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "11 Apr 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great product, values, work-life balance, benefits", "cons": "Lack of transparency in some situations"}, {"review_title": "Good Company", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "7 Apr 2022", "job_title": "Strategic Account Leader in Saint Petersburg, FL", "duration": "N/A", "pros": "Great values, great technology, great people", "cons": "Lots of changes, but for a better future"}], [{"review_title": "Love the culture", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "4 Apr 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Amazing culture and all-remote environment", "cons": "none i can think of"}, {"review_title": "Amazing Company", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "29 Mar 2022", "job_title": "Senior Software Engineer in London, England", "duration": "N/A", "pros": "Fully remote. Asynchronous. Good benefits", "cons": "* No cons so far"}, {"review_title": "This company understands the importance of family", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "5 Apr 2019", "job_title": "Support Engineer in San Francisco, CA", "duration": "N/A", "pros": "This company's leadership is the stuff. My boss made me feel empowered from day 1. He basically gave me a platform where I could learn at my own pace,  practice the skills required for my role, and contribute to my team's growth. My boss showed he was confident in my skills, and I felt confident diving into the \"harder\" tasks within a few weeks. \r\n\r\nLunch breaks at my old jobs meant eating at my desk because my bosses rewarded that. My lunch breaks now mean walking my dog, calling my parents, folding laundry or just, ye know, eating away from the desk.\r\n\r\nHonestly, I couldn't be more grateful to work for a company that:\r\n\r\n1) Enables me to see my family more than once a year\r\n2) Empowers me to grow as an engineer\r\n3) Takes diversity seriously(being a chick and person of color in the Bay Area; I can instantly recognize companies that take diversity seriously, and those that are just following a trend)\r\n4)Promotes self care(from needing a short walk to therapy and drs appointments) \r\n\r\nI've heard of people getting kicked out of meetings because it's a holiday where they live and \"what are you doing working on a holiday and not spending time with your family\"? \r\n\r\nAs soon as I was introduced as the new employee, people started scheduling short informal calls that we call coffee chats. Tell me that's not welcoming as heck?? \r\n\r\nAnyway, my team is chill, we all help each other out, and we all learn from each other. Egos stay at the door, and come back when the workday is done and you're showing off your backflip at the park(that's right, you get to practice your back flips at the park because when you get off work, it's still bright outside)\r\n\r\nMic drop.", "cons": "I wouldn't consider this a con, but just a heads up for those who are considering working remotely for the first time. \r\n\r\nYou are no longer getting exposed to the sun from (long) commutes to work, so make sure you're taking care of yourself by taking breaks, walks, being mindful of whether you've been sitting for to long etc.\r\n\r\nI guess I wish we had some sort of fitness incentive"}, {"review_title": "Great place to work!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "2 Mar 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Remote only\r\nGreat opportunities within a growing company\r\nGreat company culture and fabulous leadership", "cons": "Haven't yet been able to meet my co-workers due to Covid restrictions"}, {"review_title": "Tremendous work-life balance - Opportunities to grow with no ending in sight", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "7 Nov 2021", "job_title": "Sales Development Representative (SDR) in Riga", "duration": "N/A", "pros": "- Be your own manager\r\n- Flexibility due to remote and asynchronous work/life balance\r\n- Great amount of freedom regarding vacation (days) and time-off!\r\n- Benefits all across the board\r\n- Very friendly management, C-level are basically friends!\r\n- Everyone helps everyone, no one is left out.\r\n- Many opportunities to grow, vertically or horizontally.\r\n- Somewhat flat hierarchy", "cons": "- If remote is something new, its quite a thing to get adjusted to. \r\n- (sometimes AMER, APAC meetings are too early/late to attend in person) -> asynchronous video recap would be a positive here in this case."}, {"review_title": "Amazing Company - Incredibly Thankful to be a part of it!!!!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "23 Jul 2021", "job_title": "Senior Manager Revenue Accounting in Raleigh, NC", "duration": "N/A", "pros": "Here at GitLab, I have experienced the best of everything. A company that truly values ALL employees, management that truly cares and encourages you to be the best you can be and all with the mindset of ensuring YOU are good from all aspects. Family comes first and we all live and breathe the values and culture and are true to the product. I can write a book on how amazing this company is, from my manager to my team to the entire leadership. Super thankful to be a part of this organization. It truly makes you want to be the best you can and that makes you produce the best work you have ever done", "cons": "Honestly, there is truly nothing negative I can say."}, {"review_title": "A Growing, All-Remote Organisation", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "6 Feb 2022", "job_title": "Support Engineer in Sydney", "duration": "N/A", "pros": "Extensive belief from all levels to supporting the \"all-remote\" work style, including a strong focus on work-life balance.", "cons": "All-remote can lead to a longer onboarding than you would normally expect (but GitLab does support you through this process)."}, {"review_title": "Huge opportunity for long term growth in a massive market", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "5 Aug 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- The company was fully remote before the pandemic, with years of experience managing itself in a distributed way\n- The handbook is a powerful home grown productivity tool\n- The product is the best in its class\n- Stock options are generously awarded and have high potential for life-changing wealth for those who have joined pre IPO", "cons": "- As the company grows, being a-sync has become less possible for those who are not ICs and there are more synchronous meetings that are required to attend\n- Current People Ops (HR) leadership could be stronger and more visibly engaged\n- In order to make specialized hires, not every new employee upholds or is interested in learning the CREDIT values and this is creating tension and confusion\n- Having a great product allows the company to be lazy in Sales/Marketing practices at times, yet still hit most numbers\n- Ongoing conflict between the iterative startup approach and need for more mature operational excellence can make it difficult to set/follow/understand mid-range strategy and plans\n- Communication silos are becoming a bigger challenge as the company goes 2+ years without gathering together in person (due to the pandemic)"}, {"review_title": "Great place to work at with very flexible and efficient set up", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "28 Feb 2022", "job_title": "Anonymous Employee in San Francisco, CA", "duration": "N/A", "pros": "Flexibility, great culture, good leadership.", "cons": "promotion opportunities, relationship building due to remote set up."}, {"review_title": "Fun company thus far", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "1 Mar 2022", "job_title": "Senior Executive Assistant in Denver, CO", "duration": "N/A", "pros": "Fast paced, dynamic, challenging, fun, creative", "cons": "None cons at this time"}], [{"review_title": "Not worth it", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "3 Dec 2021", "job_title": "Executive Assistant", "duration": "N/A", "pros": "Unlimited PTO and ability to work from anywhere", "cons": "Gate keeping - other EAs would restrict access to files and necessary things preventing others from being able to do their jobs\nExpected to work and be available 24/7, even if on planned PTO."}, {"review_title": "Mixed, but good learning opportunity", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "22 Feb 2021", "job_title": "Support Engineer", "duration": "N/A", "pros": "- Lots of push to learn and grow your skills\r\n- Plenty of fun people to work with\r\n- Interesting challenges to solve, you're never bored\r\n- Good work life balance (on the support team at least)\r\n- The unlimited PTO is real, at least on the support team\r\n- Lots of people that you can lean on for help when you need it, I've never felt silly and was never talked down to for asking an honest question.", "cons": "- Your experience working here is highly dependent on your individual manager and team\r\n- Upper management seems kind of out of touch with individual contributors\r\n- Pay is well below market, raises are meh, benefits are meh\r\n- Very little career growth potential\r\n- High turnover, hiring too slow to backfill so a lot of teams seem to have more work than available team members can handle\r\n- Diversity and Inclusion efforts need to improve at the upper management level"}, {"review_title": "Great company and culture!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "16 Sept 2021", "job_title": "Business Systems Architect in Seattle, WA", "duration": "N/A", "pros": "Unlimited PTO, asynchronous work culture, and a mandate to prioritize your happiness and balance your work with your day to day life. A culture which promotes thanking others and recognizing and rewarding people based on their work. What more can I say about GitLab? This company is amazing to work for and has been a dream job for me!", "cons": "We have employees all over the world, so you need to be able to work across time zones or be good at working asynchronously with colleagues who may be across the world from you."}, {"review_title": "Great Culture!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "6 Oct 2021", "job_title": "Candidate Experience Specialist", "duration": "N/A", "pros": "Gitlab is such an amazing company to work for. The culture is so welcoming and accepting of EVERYONE. They make it crystal clear that you are an important member of the team and anything you are able to contribute will be appreciated. Being able to work fully remote from almost anywhere is also a big perk! They also really enforce that family comes first and work comes second - you are urged to take care of yourself and your family.", "cons": "Have yet to experience a con"}, {"review_title": "Excellent company to learn how to do remote well", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "17 Nov 2021", "job_title": "Leadership", "duration": "N/A", "pros": "Values are lived and expected - the CEO is constantly driving the adoption of them. Lots of opportunity to get exposure and experience if you are able to work at the pace the company moves at", "cons": "Can be a pro and a con depending on how you work - it's a very fast paced organization which may not suit everyone."}, {"review_title": "So far so great!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "29 Nov 2021", "job_title": "Senior Applications Security Engineer", "duration": "N/A", "pros": "I've been at GitLab for 2 months and their onboarding process is really great. Their handbook is amazing (and updating outdated bits during onboarding was simple too). Even though it's 100% remote I feel connected with my team mates and with people from other departments.", "cons": "It's hard to have face-to-face catch up with team members due to timezones"}, {"review_title": "Awesome product! The people part has some challenges.", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "16 Mar 2021", "job_title": "Solutions Architect", "duration": "N/A", "pros": "* GitLab's DevOps platform is well liked by its customers.\r\n* The culture is real for the most part.\r\n* Smart & diligent coworkers.", "cons": "* DevSecOps is, for the most part, just other developers open source projects integrated into GitLab. \r\n* GitLab's obsession to take over the DevOps landscape may ostracize potential partners\r\n* High number of five star reviews for folks that are in the honeymoon phase. Of course it's five stars; that's why you joined!\r\n* Some slightly toxic mid level managers. Do your homework before joining!\r\n* Planned IPO in November 2020 was pushed off because of Covid. That being said, you'll want to verify that options are worth much as it's likely close to an exit.\r\n* Compensation is ok. GitLab's USP was that it was an all remote company & that's why you could take less. With Covid, that USP is a bit less compelling. That said, GitLab knows how to make remote work work."}, {"review_title": "Can't imagine a better place to be at!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "11 Nov 2021", "job_title": "Technical Recruiter", "duration": "N/A", "pros": "- wonderful community of kind and helpful individuals\n- team diversity (everyone can feel respected and celebrated for who they are)\n- work flexibility (non-linear working day, being the manager of one)\n- competitive salary\n- transparency (everything is public by default)\n- unlimited paid time off\n- asynchronous environment\n- really great product", "cons": "- honestly, nothing really I can think of, I simply love it here <3"}, {"review_title": "Great Company", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "15 Nov 2021", "job_title": "ASM", "duration": "N/A", "pros": "Great Software, great leaders, amazing opportunity ahead.\nEverybody is kind, positive, wants to help, contribute, collaborate.\nRemote culture/asynchronous work and inclusion/diversity are core values, proven every day. And it helps balance pro/personal lives.\nTransparency (check gitlab.com!).", "cons": "Difficult to create opportunities to meet in the flesh but that is more due to Covid than anything else"}, {"review_title": "Great work-life balance", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "28 Jan 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Async and non-linear remote working style\r\nWorking to results not hours", "cons": "Leadership stronger in some places than others"}], [{"review_title": "Product = Great, Remote = Great, Job = NOT great", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "22 Jun 2020", "job_title": "Strategic Account Leader in San Francisco, CA", "duration": "N/A", "pros": "Its the world's largest all-remote company. The freedom I had to structure my day will be tough to match anywhere else. Overall the company is loved by it's users and it's a really hot space to be in right now. GitLab moves REALLY fast and the rate of improvement from a product perspective is incredible. From a competitive standpoint there are only 3 major vendors in this market and the other two are publicly traded", "cons": "The nature of the solution is so critical that customers and prospects don't change course very frequently. That's great for accounts that already use GitLab and are growing but guess what? All those accounts are already owned by other reps which leaves new arrivals with table scraps. The only people I saw being successful were those with F500 customers which had already committed to gitlab and are now just growing their usage. In short if you don't have a book of business that has a couple large and growing accounts you have a near zero chance at being successful here. I felt like they viewed new AEs as a pipeline generation tool and nothing more"}, {"review_title": "Best Remote Culture Around!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "4 Oct 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "They are true to their values and encourage everyone to work within those values. They understand how to do Remote Work but they are continuously trying to do things in hopes of making remote work better!", "cons": "You have to be able to set clear boundaries for yourself around remote work, leaders are completely supportive of these boundaries but cannot create them for you. Find what works for you."}, {"review_title": "Great culture and team, very structured process", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "26 Apr 2021", "job_title": "Senior Product Designer in Amsterdam", "duration": "N/A", "pros": "• Super talented team, capable of tackling high complex engineering challenges\r\n\r\n• Very structured product development process\r\n\r\n• Product designers have a lot of freedom to influence the product and are respected in their specialties", "cons": "• Very demanding onboarding, with a massive firehose of information that can be overwhelming at times\r\n\r\n• Small UX Research team can make product designers spread thin across the process\r\n\r\n• Company is rapidly expanding and coordination between stages is challenging due to product complexity and context gaps."}, {"review_title": "Not what it used to be", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "2 Dec 2021", "job_title": "Account Executive", "duration": "N/A", "pros": "All remote before anyone else\nStock options pre ipo", "cons": "There has been turnover since the IPO\nMgmt has become less flexible"}, {"review_title": "Outstanding place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "1 Oct 2021", "job_title": "Senior Data Engineer in Novi Sad", "duration": "N/A", "pros": "High level of autonomy,\nfast-paced environment with change to have an impact. \nThe company fully respect their values on a daily basis. Unique culture.\n\nGreat set of benefits.\n\nThe toolset is very modern with possibilities to try new things and experiment a lot.", "cons": "If you are not a self-starter and do not have a very high level of curiosity, discipline and motivation can be difficult for you to adopt."}, {"review_title": "Poor. I was headhunter by the EMEA VP, 3 months later he left, and I was released on a first in first out basis", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "25 May 2021", "job_title": "Great Company, But Hire and Fire Culture in Reading, England", "duration": "N/A", "pros": "Great product (source code management), great vision to expand into other areas of DevOps and CD/CI but yet to be realised. Remote working is cool.", "cons": "Senior UK Management have no soul"}, {"review_title": "Loving being here", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "1 Jan 2021", "job_title": "Support Engineer", "duration": "N/A", "pros": "I had my doubts before joining GitLab, about the culture and the values for they seemed all too good to be true. I've been here for 2 months now, and I can confirm that it's all true. More reasons to work for GitLab are:\r\n- The amazing culture makes you feel welcomed and fitting in. \r\n- The values are not just there for bragging, everyone does live by them.\r\n- You get to work with some of the smartest, nicest and most helpful people you can ever meet. \r\n- The flexibility to plan your day to how it suits you best.\r\n- They don't measure hours, they measure results. \r\n- The \"no ask, must tell\" paid time off policy. \r\n- Everyone can contribute! It's great to feel that you are listened and have the power to make changes from day.\r\n- The level of \"Transparency\" is just amazing. I may say this is my favorite value of all.", "cons": "Coming from a typical office job, it takes some time to get used to the all-remote and async communication model. \r\nAll-remote is not for everyone! and async communication - in addition to causing some delays - can sometimes result in feeling disconnected."}, {"review_title": "GitLab", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "17 Dec 2021", "job_title": "Sales Development Representative in Oakland, CA", "duration": "N/A", "pros": "100%, Transparency, Collaboration, Open Source, Community, Agency", "cons": "Great community, no cons, only growth"}, {"review_title": "Not all as it seems", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "7 Jan 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Remote working, transparency, pay, budget for office set-up", "cons": "I wish I could be writing more positives but unfortunately, I had a bad experience working here. They don't really know what they want or need when hiring, and seem to hire and fire new people quite often (with a non-disclosure agreement). They were not very supportive of juggling parenting/working during Covid and school closure. I wonder if the CEO actually knows what is going on in his company or if it's inept Managers/HR muddling along. I felt victimised, unsupported and never experienced working in a culture like this before. Shame. You are asked to review on Glassdoor within your first 30 days, misleading....explains a lot of rose tinted perspectives."}, {"review_title": "Great remote company", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "25 Nov 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Lots of autonomy. Opportunity to grow my career", "cons": "Employees must be good at managing their own time and focus"}], [{"review_title": "Great company, surprisingly low pay", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "21 Sept 2017", "job_title": "Developer in San Francisco, CA", "duration": "N/A", "pros": "Fantastic company to work at, for so many reasons. Company values are well-articulated and are reflected in the actual culture. The product is popular and growing. You can contribute to any aspect of the company/product at any time, as long as you're delivering your main assignments on time.  The remote-only part is fantastically well orchestrated, if you're into that sort of thing. There's a good level of respect for work-life balance. You can take off time whenever you need, and you're not generally expected to work overtime at all. I also loved the freedom to buy whatever I needed to do my job -- office equipment, software, books, conferences -- and get reimbursed online without having to ask anyone.", "cons": "GitLab pays its engineers less than market rate. This policy was documented in the GitLab Handbook until fairly recently: \"We pay on the lower end of market rates for engineering positions because we offer the benefit of working on open source (great workflow, peers, build reputation); most engineers take a pay cut to join.\" When I was hired, this meant I was making about 30% less than I could have at a comparable position in my city. When I left for another company a year later (also remote-friendly), it meant a 70% raise."}, {"review_title": "The best company I've ever worked for", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "27 Oct 2021", "job_title": "Sales Development Representative in Budapest", "duration": "N/A", "pros": "-inclusive environment\r\n-amazing product\r\n-great work/life balance\r\n-stunning workplace-culture\r\n-everybody is super friendly! \r\n-legendary CEO\r\n-i could go on...", "cons": "-Arranging your work routine yourself can be challenging"}, {"review_title": "Great fully remote company to work for!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "2 Aug 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "-async work: plan your own schedule and working hours\n-Great IT equipment\n-fully remote and allowed to work from other countries\n-good salaries\n-smart, motivated and fun teams\n-everyone can contribute: your opinion is wanted and appreciated\n-handbook includes all processes, which makes it easy to virtually onboard", "cons": "-very busy due to growth and success\n-growth mindset is important due to continuous changes\n-technical skills needed to be successful, as we are using GitLab products in our daily jobs"}, {"review_title": "The most wonderful place I've ever worked at", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "13 Jul 2021", "job_title": "Support Engineer", "duration": "N/A", "pros": "Work from home gives so much time for family and things you want to do but never had time due to long commute times\nVery supportive, collaborative team\nYou know you are trusted as an employee to have proper work ethics - unlike companies that think you will slack off if they don't constantly watch over your shoulder\nEverybody accepts everybody, you can be you without worrying\nGood benefits", "cons": "Miss non-virtual interactions with colleagues"}, {"review_title": "So far so good", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "9 Aug 2021", "job_title": "Strategic Account Executive in Salt Lake City, UT", "duration": "N/A", "pros": "I am newer, but it's a great company to work for. Lots of autonomy, great benefits, great people to work for. Path to hit quota in year 1, quota reasonable.", "cons": "Not a lot of leads from BDRs, but great product that does have some buzz in the marketplace."}, {"review_title": "Great company to work for", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "12 Oct 2021", "job_title": "Support Engineer in The Hague", "duration": "N/A", "pros": "Great work/life balance. Lots of collaboration and zero tolerance for sexist or racist behaviour.", "cons": "With all younger companies, sometimes changes happen quickly and parties involved aren’t always aware."}, {"review_title": "Amazing company.  Trailblazer in the all-remote culture.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "9 Aug 2021", "job_title": "Engineering Manager", "duration": "N/A", "pros": "Transparent and clear direction. Team members are incredibly smart and committed. Meetings are efficient. Work/life work balance is unmatched from previous positions held.", "cons": "The company can change direction. Not necessarily more than others I've been at. Team members are encouraged to adapt and embrace change."}, {"review_title": "Great product! Great culture!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "27 Oct 2021", "job_title": "Manager, Technical Account Manager in Ramsbottom, England", "duration": "N/A", "pros": "* The handbook\r\n* Non linear work day", "cons": "* None as of yet"}, {"review_title": "Dream job", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "22 Sept 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- 100% Remote\r\n- Flexible work/life balance\r\n- Able to work with amazingly talented people\r\n- I have been able to progress in my career", "cons": "Remote life might not be a good fit for you"}, {"review_title": "career un-advancement", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "17 Sept 2021", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "Semi-transparent company with Animal Farm-esque ways of interpreting the Employee Handbook.", "cons": "100% Remote culture leads to \r\n* zero meaningful career advancement opportunities. \r\n* productive work being overlooked in favor of assembly line metrics."}], [{"review_title": "Working at GitLab", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "27 Jul 2021", "job_title": "Account Executive in Atlanta, GA", "duration": "N/A", "pros": "Flexibile hours as it is remote\nManagement can vary at times but is not down your throat at every occassion\nRemote work prior to pandemic meant the organization was prepared", "cons": "Constant changes as the company looks to IPO can be frustrating and forces you to adapt pretty frequently. \nAsynchronous communication can be aggravating at times as well"}, {"review_title": "Great", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "22 Oct 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Remote is great for me", "cons": "None, so far, will add if see any"}, {"review_title": "Great company", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "12 Sept 2021", "job_title": "Channel Account Manager", "duration": "N/A", "pros": "Benefits and growth in the company", "cons": "Loosing touch with it's core values"}, {"review_title": "Great Company Culture", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "22 Apr 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great culture, and collaboration across the multiple teams. Remote only company, but they provide lots of outlets to team members to emulate water cooler banter, and friends and family days to avoid employee burnout! Excellent communication to employees with an \"Ask Me Anything\" opportunity.", "cons": "Remote learning is more on your own than a hands on experience, and unlike other companies. All information is out there for employee, but up to you to take the time and learn content"}, {"review_title": "overview", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "22 Aug 2021", "job_title": "Sales Development Representative (SDR) in Seattle, WA", "duration": "N/A", "pros": "opportunity to WFH, be a self-starter, you are compensated based on results.", "cons": "big company, will need to be perform the best for notice not necessarily a bad thing just be great at what you do"}, {"review_title": "Great Company!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "17 Sept 2021", "job_title": "AREA SALES MANAGER", "duration": "N/A", "pros": "The values are not words: they are real! CREDIT (look it up on about.gitlab.com)\nAll-Remote\nLove from dev community", "cons": "still looking for something ..."}, {"review_title": "Great perks and people", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "15 Sept 2021", "job_title": "Sales Development Representative (SDR)", "duration": "N/A", "pros": "Well organized remote environment and policy\nEveryone is willing to help each other.", "cons": "Not that I know of"}, {"review_title": "GitLab Focused on Employee Experience", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "20 Sept 2021", "job_title": "Marketing Content Manager in Portland, ME", "duration": "N/A", "pros": "treats employees with consideration and kindness. non-linear work days", "cons": "I haven't found any yet... seriously"}, {"review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "24 Aug 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Fun environment, results focused and very cutting edge", "cons": "Upward mobility was lacking. Upper management of business development doesn’t listen to SDRs/their teams"}, {"review_title": "Great culture and mature leadership", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "8 Aug 2021", "job_title": "Engineering Manager", "duration": "N/A", "pros": "Everyone is willing to help and pull together. There is a clear sense of caring towards a common goal", "cons": "So far so good with not thing much on the cons. Definitely, a lot more to achieve."}], [{"review_title": "Amazing workspace with amazing people", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "7 Sept 2021", "job_title": "Sales Development Representative (SDR) in Belgrade, Central Serbia", "duration": "N/A", "pros": "Unlimited time off, flexible working hours and amazing people. Supportive of your personal/proffesional growth.", "cons": "Nothing that I would highlight"}, {"review_title": "The best job I've ever had", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "1 Feb 2021", "job_title": "Full Stack Web Developer in Denver, CO", "duration": "N/A", "pros": "For most companies, values are just buzz words with very little meaning or relevance. This is not true at GitLab. The pros of working at GitLab almost all tie directly back to the values that GitLab takes very seriously: \r\n\r\nCollaboration: people here are kind, there are all sorts of resources and helpful tips to welcome newcomers and collaborate with the greatest community in the kindest way. Folks share their opinions, say thanks, and give feedback. For challenging collaborative problems, GitLab provides a variety of resources to educate folks on how to navigate the tough bits.\r\n\r\nResults: one of the sub values of \"results\" is \"Measure results not hours\" - and it shows. People are not tracking how often you're \"active\" on slack, how many meetings you make, how many things you say in meetings. Being handbook and async first in an all remote company means that the value of your contributions speaks volumes more than how you \"appear\".\r\n\r\nEfficiency: people for the most part write things down. This is the core of being handbook first. And let me tell you: I can't imagine working any other way. It's a lot of information to parse out. But imagine working somewhere where your coworkers don't interrupt you every 15 minutes to ask the same question someone else asked. Or where you don't feel bad having to interrupt your coworkers with the same thing. You can literally Google internal company processes and get an answer. Not sure how to write a good code review? Google \"GitLab code review process\" and you'll find the handbook page. Want to know how to submit an expense report? Type \"expense reporting GitLab\" in your navigation bar and you've got the answer. It's amazing, and I think it's extremely understated as a benefit here. It gets overshadowed by being all remote. But if you're an information-savvy knowledge worker, this is the way you must demand to get work done.\r\n\r\nDiversity, Inclusion & Belonging: this is where asynchronous communication comes in. And there's explicit instructions about having uncomfortable conversations. The company explicitly talks about what this value means, instead of being an overarching idea that's too broad to be useful. I've never believed a company ever cared about this value until I interviewed at GitLab. The interviewing process is as equitable as it can be (there is still a power differential, of course. And human systems are imperfect, and I have many privileges so I can't necessarily evaluate this objectively). But again, you can google all the hiring details and know what to expect. You can see the statistics in terms of hiring length, hiring metrics, etc. There are some confidential pieces of information here, of course, but the transparency builds to this diversity value. \r\n\r\nIteration: this value can be challenging, but it can also be freeing. I feel empowered to make small, reversible changes all the time. To pitch ideas, deliver on promises, and come back later to clean things up. I'm never blocked because I'm waiting for approval three levels up.\r\n\r\nTransparency: this is another value that lends to the handbook first pro. \r\n\r\nOther pros: \r\n\r\nRemote work is awesome. \r\nIt's clear how you add value to the company. \r\nThe company is clearly growing, and the opportunity is there. \r\nThe brand name is super cool - I am so proud and excited to have it on my resume. \r\nPeople are welcoming, excited, and always thinking of cool new ideas \r\nLots of opportunity to work on new projects, but also a healthy focus on making sure existing solutions are appropriately leveraged and maintained. \r\nAll levels of management are very accessible. \r\nThe compensation is transparent, and more than fair.", "cons": "There is a lot of information out there. It can be very challenging to parse through and find signal versus noise, especially as a newcomer. \r\n\r\nBeing remote is great, but sometimes you miss the in-person relationships and collaboration style. \r\n\r\nThe company is moving at a fast pace. They talk a lot about work/life balance, and they clearly take steps to enforce it. But I personally find myself being highly engaged and thoughtful about work outside of working hours because of all the activity going on. It's exciting, but it can be hard to turn off when your \"office\" is just inside your laptop, and the company is abuzz with activity at all hours of the day. This is a personal problem, not necessarily a systemic one. But I think many people share this. \r\n\r\nThe onboarding process itself is very structured and easy to follow, with plenty of information. But I have spoken with many colleagues who feel like they were thrown into the deep end early on. I think a start up at this phase has a lot of that - the company needs to move quickly, and employees need to be ready for that. Be ready to feel a little lost for the first few months with information overload and a fast pace of work. I think most folks adjust, and GitLab has plenty of resources and systems to help. But it can be a lot, for sure. \r\n\r\nBecause everything is handbook first, everyone is empowered to make decisions, etc., there are plenty of conflicting information sources out there. I think this is true of any company. The challenge at GitLab is that having all the documentation public means that any person in the company might stumble upon two conflicting pieces of information - rather than a different company where those conflicting points of view are siloed to teams. In that specific case, being siloed can actually be useful for individuals."}, {"review_title": "Embracing a remote future", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "28 Jun 2021", "job_title": "Channel Marketing Manager in Boston, MA", "duration": "N/A", "pros": "GitLab is truly embracing a remote workforce - I can work anywhere, anytime and keep up with my colleagues around the globe.", "cons": "To ensure transparency and the ability to communicate at any time with peers around the globe, there is more documentation than may be ordinarily required at a face-to-face company."}, {"review_title": "a divergence from culture", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "26 May 2021", "job_title": "Integration Engineer in Assiniboia, SK", "duration": "N/A", "pros": "remote culture and asynch work", "cons": "introduction of many many layers of middle management 'professionals' to fluff head count in preparation for IPO, resulted in dilution and loss of the culture that made the company what it once was."}, {"review_title": "Great company, great product-  god AWFUL sales org.", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "24 Aug 2020", "job_title": "Sales", "duration": "N/A", "pros": "Such a cool product and company with incredible, life changing benefits. So many smart colleagues and really progressive, cool ideologies about work/life balance and sense of belonging.", "cons": "The sales culture is what you would expect from a fast expanding company but with a mountain of sales leadership incompetence to propel the company into a bleak future.  This is not my first startup so I have some experience dealing with the growing pains.  The typical growing pains are RAMPANT and getting worse day by day thanks to gross mismanagement.  The sales leaders have over hired, under trained, and  misled so many of us.  Don’t even get me started at the insanely horrible Salesforce instance our “sales ops/marketing ops” team has managed to run into the ground.  We cannot expect to be successful with the terrible Salesforce and data uncleanliness that this company has created coupled with the gross incompetence of sales leaders. I’ve never experienced such a disorganized, chaotic sales organization.  On top of this, I’ve seen sales reps get fired or let go at rates I’ve never seen anywhere else.  Truly scary."}, {"review_title": "Great culture and benefits", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "5 Aug 2021", "job_title": "Software Engineer in Berlin", "duration": "N/A", "pros": "Just google for GitLab benefits. It's public and it's great.\r\nIt's probably one of the most remote-ready company in the world, if not really the best.", "cons": "I don't have much to say here."}, {"review_title": "Great firm!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "1 Sept 2021", "job_title": "Talent Acquisition Specialist", "duration": "N/A", "pros": "Great work culture, employee-centric, and incredible remote work flexibility!", "cons": "Slow growth and career development!"}, {"review_title": "Decent", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "24 Aug 2021", "job_title": "Staff Data Analyst in Austin, TX", "duration": "N/A", "pros": "Good prospects for company growth", "cons": "Executive Management does not listen to advice"}, {"review_title": "Amazing! All around great environment & company.", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "29 Mar 2021", "job_title": "Senior Business Analyst", "duration": "N/A", "pros": "Everyone is super nice, willing to help, and wants your opinion. 100% remote, flexible to travel and live anywhere. Fantastic work-life balance. Annual company-wide retreat somewhere cool. No one sends emails - just Slack. Pick your own work hours. Great trajectory. Company is doing very well and people are excited about it’s future.", "cons": "Figuring out the best way to communicate with people can be tough sometimes"}, {"review_title": "Top product, great culture and endless growth opportunities... of course not everything is perfect!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "26 Jul 2020", "job_title": "Sales Development Representative in Amsterdam", "duration": "N/A", "pros": "- The company is very result-oriented, but it doesn't mean that result is the only thing that matters.\r\n \r\n- You're the manager of yourself: nobody will be counting the hours you \"work\" or the butt/seat hours you put in. \r\n\r\n- One of the company's core values is collaboration, and most people in the company will always be happy to help.\r\n\r\n- Work with some of the smartest and coolest people ever.\r\n\r\n- Work from home, or anywhere else (If that's for you, for me is priceless).\r\n\r\n- The company supports you with all the necessary equipment for your work-station.", "cons": "- The company is growing a lot, even during COVID times they keep hiring people, which is great. But that rapid growth brings growth pains like some new individuals not being aligned with the company values and goals. \r\n\r\n- Some internal processes can be really slow, HR for instance. Likely due to staff limitation or the quick growth previously mentioned."}], [{"review_title": "Good Company", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "19 Aug 2021", "job_title": "Technical Architect", "duration": "N/A", "pros": "Good Company, and i recommend others", "cons": "No cons at all, good one."}, {"review_title": "Love GitLab!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "28 Jul 2021", "job_title": "Sales Operations", "duration": "N/A", "pros": "Wonderful company that takes great care of its employees.", "cons": "Full time remote, no opportunity to meet colleagues in person due to COVID."}, {"review_title": "Awesome people, awesome company", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "12 Dec 2020", "job_title": "Support Engineer", "duration": "N/A", "pros": "The team at GitLab is genuinely the most talented group I've ever worked with. More importantly though, they're kind, thoughtful, and invested in making the company better. I genuinely enjoyed working with the people at GitLab, and met a lot of people I still consider friends after leaving.\r\n\r\nAs far as the job itself, I learned a ton and was never bored. There are a lot of great internal resources and in-house tools that are really helpful in being able to solve problems. And just to be clear, customers bring some really interesting problems. It was really cool to see all the different ways people used (and broke) their installations. Working at GitLab was basically a neverending crash course in how to manage and maintain software, and I mean that in the best way possible.\r\n\r\nThe benefits were probably the best of any company I've worked at. Health insurance was incredibly good, and they covered the majority of my family's costs. They allow people to expense training materials and are pretty liberal with what they will pay for - I've worked at places that have a similar policy but will then fight you on every little thing, and that was never the case at GitLab. Same with their unlimited PTO policy. They trust people to behave like adults, and I can't understand how nice that is.\r\n\r\nGitLab's dedication to process and operations is also a big selling point. I've worked in so many places where no one bothered to document anything, and the fact that GitLab spends so much time and energy on this is great. Their handbook is one of the most thoroughly impressive documents I've ever seen, and for the most part, its actual contents are extremely fair and thoughtful.", "cons": "One major con that I noticed toward the end of my time at GitLab is that it's starting to feel like a big company, which wasn't the case when I started there. It was awesome to see such rapid growth, but in my opinion, they scaled the product and operations without quite getting things like communication right. There were a few instances of really big decisions being made behind closed doors, then being met with a lot of pushback when they were announced. It felt to me like these decisions were made non-transparently because leadership knew they would be unpopular, but it's also likely I don't have the full context. Running a company is hard, and so is communication, and to be clear, GitLab's leadership did things the right way more often than not. There are just a few specific instances that left a really bad taste in my mouth, so that's why I mention it.\r\n\r\nThe biggest problem that I have is pay discrepancy via the \"location factor.\" I live in an area with a decent factor, and I felt I was paid fairly for my work - but my coworkers in Latin America, for example, work just as hard as I did for about half as much money in some cases. My main gripe here is that pay difference is explicitly not based on cost of living, but \"market rate.\" This might have made sense when remote-first work wasn't the norm, but it turns out there is a whole \"market\" of companies for me to choose from that don't penalize people for living in the wrong place. So even ignoring my moral judgment on this, it doesn't make sense anymore from a hiring perspective. I won't get into the effects this has on diversity and inclusion, but there's an obvious impact here as well."}, {"review_title": "If you want true asynchronous remote work, this is the place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "27 Mar 2021", "job_title": "Full Stack Engineer in Ottawa, ON", "duration": "N/A", "pros": "- Best remote asynchronous work environment I've seen\r\n- Well organized onboarding\r\n- Work is interesting and my colleagues are a pleasure to work with\r\n- The company actually puts meaningful effort into upholding its values (publicly accessible in the handbook)", "cons": "- Compensation is good but I've gotten better offers elsewhere\r\n- My health benefits were better with my previous employer (a small company)"}, {"review_title": "Awesome adventure", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "10 Aug 2021", "job_title": "Senior Backend Engineer in Lisbon, Lisbon District", "duration": "N/A", "pros": "Great culture, salary and very talented coworkers.", "cons": "None that I can think of"}, {"review_title": "Evolving, fast growth company", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "29 Jul 2021", "job_title": "Senior Program Manager in San Francisco, CA", "duration": "N/A", "pros": "* Moves fast\n* Good values\n* Great PTO policy", "cons": "* Growing pains\n* Sometimes seems to move too fast"}, {"review_title": "Great place to work", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "19 Jul 2021", "job_title": "Chief Marketing Officer (CMO) in San Jose, CA", "duration": "N/A", "pros": "Excellent place to work due to remote culture, company growth and transparency.", "cons": "Career path is limited in some cases."}, {"review_title": "Security Assurance Engineer", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "21 Dec 2020", "job_title": "Security Assurance Engineer", "duration": "N/A", "pros": "Transparency - It's a value that is lived out in a very unique fashion at GitLab with things such as their compensation calculator (you can look up the range for your and others' positions within the company) and the openness of discussions that take place on a daily basis in Slack and GitLab Issues. While it is rare for people to always agree on an approach or change occurring, the openness in which people can share their feelings is a breath of fresh air compared to the backroom and private chats that people normally resort to to discuss their grievances.\nFlexibility - Being all remote is something that more and more company's are moving to or at least a hybrid model but the difference with GitLab is that they are taking it a step further with remote locations AND remote time arrangements. With a company spread out around the world it's inevitable that it's daytime for someone and nighttime for another so there is no expectation of people working the typical hours of their own time zone. It's not uncommon to get messages in various channels throughout the day letting you know that someone is stepping out for a few hours or working a different than usual schedule for a while and the expectation is rarely that you'll be able to immediately get a response on something from a specific person via chat, so everyone builds their work and there days around themselves making for better documentation and greater work/life balance.\nPeople - The people of GitLab are phenomenal. While I haven't worked with everyone and everyone certainly has different backgrounds and approaches to work, people are open to collaboration and even being remote are genuinely caring about each others' lives.\n Remote - Similar (but different) to flexibility, the all remote arrangement of GitLab makes for very cool work arrangements. Want to work from your local coffee shops each day? Great. Want to beat the holiday travel rush home and work there for a week on either side of the holiday to avoid crazy plane tickets? Great. Want to be a digital nomad and hop around country to country in a new place every other week? Awesome. GitLab encourages and enables people to find what works for them and provides the resources to be successful (they'll even buy you a portable monitor so you can travel with it if that's your thing).\nStartup - GitLab is still a startup and while there are companies that are younger and smaller, GitLab is scaling well and is still a startup with how they approach work and through their transparency is doing a good job of avoiding the usual shift from startup to successful business that pushes all the people that made it a great place to work, out. It's also cool to work on a product that feels like it'll change things for a lot of companies, and to watch that happen.", "cons": "Not many but things that can be a challenge:\nLack of availability - since you can't count on people to be online at the same time as you, especially starting out it can be difficult to adjust to a world where you just push everything as far as you can and then set it down compared to a typical environment where you'd have a desk to walk over to or a person to IM that was on the same hours as you and you could message them for an answer so you could keep going on something. As a whole the asynchronous work style is awesome but takes a little adjusting to at first.\nEasy to be always on - With full time remote it becomes very important to set boundaries between work and life but also, with people spread around the world it's inevitable that you'll have some early morning or late night meetings that pop up that you need to attend. While it is rare and often avoided via recording meetings and sharing a collaborative notes doc, there are times when flexing your schedule for some late nights or early mornings is the simplest way to handle a problem and can lead to burnout if you let those type situations trickle over into never truly turning off from work.\nChange - being a startup things are constantly changing and it can be difficult at times to keep up with all the changes and there are adjustments that seem to happen on a far more frequent basis than other more established companies. While not necessarily always a con, there is the potential that some of the things you may hold most dear about the company upon hire quickly adjust to something else and that may be difficult to handle for some. That being said, the core foundations of GitLab don't seem to be changing and this is a risk at any company, it's just more realized at GitLab due to the size/current nature of the company."}, {"review_title": "Best Company To Work For", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "25 May 2021", "job_title": "Sales Development Representative (SDR) in Kinston, NC", "duration": "N/A", "pros": "Unlimited PTO, All team members are aligned with values and are always continually improving. As an employee I feel that I am seen and heard and not just a number. Great pay and perks.", "cons": "none so far that I can think of."}, {"review_title": "Fun while it lasted", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "23 Nov 2020", "job_title": "Business Development Representative in Nashville, TN", "duration": "N/A", "pros": "Great people. You will receive a lot of help from your peers and leadership team if you ask for it and sometimes even if you don't someone will offer a helping hand. \r\n\r\nGood pay. \r\n\r\nConsidering its remote i'd say the working conditions are excellent.", "cons": "Its seems that if you are placed on a performance improvement plan its already kind of decided that you'll be let go whether you meet the requirement of the plan. \r\n\r\nMay be overstaffed on the leadership side of the ball and in general. \r\n\r\nA lot of shake up happening during 2020 that has everyone a bit hyper vigilant and uneasy."}], [{"review_title": "Great company in general", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "15 Jul 2021", "job_title": "Accountant in Guadalajara, Jalisco", "duration": "N/A", "pros": "100% Remote work\r\nInternal Benefits\r\nFamily first", "cons": "Internal Management\r\nDiscrepancies between benefits offered and availability to be taken"}, {"review_title": "A great employer with fantastic working conditions", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "4 Jan 2021", "job_title": "Support Engineer", "duration": "N/A", "pros": "- The onboarding process is fantastic; it is very well structured and designed in a way that most tasks can be completed without needing additional help\r\n- Everyone is very welcoming / friendly and always willing to help\r\n- I always feel part of a team as people are always willing to help each other and pair up on tasks when needed\r\n- Flexible working conditions are a big bonus; I can structure my day around personal things I need to get done\r\n- Even though I am working from home I always feel connected due to team meetings, coffee chats etc.", "cons": "Everything has been positive so far :)"}, {"review_title": "Everyone Can Contribute", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "11 Jun 2021", "job_title": "Sales Development Representative in Tulsa, OK", "duration": "N/A", "pros": "GitLab does a great job making it feel like you're valued. Generally treat their employees well. Will have to wait and see how much upward mobility there is!", "cons": "Not sure yet, relatively new hire."}, {"review_title": "Prevarication", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "11 Feb 2021", "job_title": "Sales in Santa Rosa, CA", "duration": "N/A", "pros": "outstanding vision, product and CEO", "cons": "Micro Management, culture of punishment"}, {"review_title": "Great company, great culture, great people, happy customers!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "6 Apr 2021", "job_title": "Senior Strategic Account Leader in London, England", "duration": "N/A", "pros": "- Vision, purpose & values that are applied every single day, consistently across the whole organization\r\n- A level of openness and transparency that is unparalleled in the industry\r\n- Market response and enthusiasm to our remote first approach & method", "cons": "None - iteration & continuous improvement built into our cultural fabric"}, {"review_title": "Amazing Company - Absolute Unicorn!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "31 Dec 2020", "job_title": "Security Assurance Engineer", "duration": "N/A", "pros": "GitLab holds true to its values!! Most companies talk about their values, but do not implement. GitLab puts their values into action and holds employees accountable! Amazing, smart, supportive, invested and understanding folks is what it's all about at GitLab!! I am grateful to be a part of this family!", "cons": "There is nothing negative I can report - so far so good!"}, {"review_title": "Growth | Professional & Personal", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "2 Dec 2020", "job_title": "AREA SALES MANAGER in Minneapolis, MN", "duration": "N/A", "pros": "GitLab has a brilliant offering and is an incredible place to contribute; I have been able to experience professional growth within the company but I am most excited by the space where I have been able to grow personally. GitLab lives our values of C.R.E.D.I.T. (do a quick search for context) and I am grateful for the opportunity to continue learning ways I can be a true ally with a tighter focus on diversity, inclusion, and belonging.", "cons": "GitLab is in rapid growth and it can be a bit of an adjustment if you come from a well-established company - each problem is ours to solve!"}, {"review_title": "Dream job", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "7 May 2021", "job_title": "Sales Development Representative (SDR)", "duration": "N/A", "pros": "Remote Work\nAsynchronous workstyle \nwork/life balance\nroom for growth", "cons": "Some people are tired, have been here for a while and maybe have a jaded view of things (as with any startup/new company)"}, {"review_title": "A company that lives its values", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "25 Mar 2021", "job_title": "Manager", "duration": "N/A", "pros": "All-remote, great work/life balance with one of the most generous PTO policies around, amazing co-workers, no shortage of interesting problems to work on and growth opportunities.", "cons": "It's a fast growing, late-stage startup, and with that comes frequent change and more process, which is not for everybody."}, {"review_title": "Great culture", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "10 May 2021", "job_title": "Marketing Manager", "duration": "N/A", "pros": "Great benefits, flexibility, all remote", "cons": "Using our own product to run the business can be cumbersome and time consuming in some disciplines"}], [{"review_title": "All remote done well", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "7 May 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "CEO engages actively with team members\r\nTruly have a voice in the companies direction", "cons": "Timezone issues can be difficult to navigate"}, {"review_title": "Great place to work & learn", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "19 Apr 2021", "job_title": "Backend Engineer", "duration": "N/A", "pros": "- Remote\r\n- Career Growth\r\n- Team members are just wonderful\r\n- Work / Life Balance\r\n- Handbook", "cons": "- Nothing for now on my side"}, {"review_title": "Best company I've worked for so far", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "12 Feb 2021", "job_title": "Sales Development Representative (SDR) in Cincinnati, OH", "duration": "N/A", "pros": "All remote, super supportive and motivating team, never starving for work, unlimited PTO, incentives to do your best, a lot of fun. Territories and quotas are set up so that everyone has the opportunity to succeed.", "cons": "There are no cons at GitLab. I'll be here for a long time."}, {"review_title": "A Refreshing Culture to Be a Part Of", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "2 Dec 2020", "job_title": "Accounts Payable Specialist in Burlington, ON", "duration": "N/A", "pros": "The culture is incredible. The values that are written in the handbook are not just words on \"paper\" but are truly the way the business runs. It has been a refreshing change and a great experience so far.", "cons": "If you are a social person being fully remote can be a challenge, but I find the zoom meetings bring that aspect in sufficiently and I don't burn out on communication towards family/friends!"}, {"review_title": "Good culture", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "25 Apr 2021", "job_title": "Sales Development Representative in Seattle, WA", "duration": "N/A", "pros": "Culture is a major plus here. Good work life balance", "cons": "Career development can sometimes feel stalled"}, {"review_title": "Great company with some quirks", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "13 Jul 2020", "job_title": "Solutions Architect", "duration": "N/A", "pros": "- Work on one of the hottest tools in tech.\r\n- Work with some of the most talented people I've ever been around.\r\n- All remote culture (if that's for you).\r\n- Excellence as a principle. The most transparent organization I've ever been apart of.", "cons": "- The most politically correct organization I've ever been apart of. I understand the idea of honoring others, but many of the rules that we have are just obnoxious and aren't even beneficial.\r\n- Unlimited PTO, but a lot of people can't take PTO because of job demands (I am in sales)."}, {"review_title": "High work ethics", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "22 Apr 2021", "job_title": "Account Executive in Berlin", "duration": "N/A", "pros": "Contributions are recognized and good team spirit", "cons": "Could do better compensation wise"}, {"review_title": "Low comp, but overall, still worth it for fantastic culture and WLB", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "17 Aug 2020", "job_title": "Software Developer in New York, NY", "duration": "N/A", "pros": "They really do live the culture and, by any large, everyone really is in it together. None of the backstabbing or ladder climbing I've seen elsewhere. Company values are an adjustment, but work out well once you decide to embrace them. It would be tough to work for another company that didn't embrace a similar ground-up approach and a similar degree of transparency.", "cons": "Even in the high-comp areas, total compensation is roughly 30% below what you'd get elsewhere in tech companies of similar size (excluding FANG companies, which pay substantially more but bleed you dry). Unlike many other tech companies, no one in SF or New York or Seattle or London is going to be able to buy a home on a GitLab salary, unless they already have a substantial down payment in the bank or the IPO hits it big. The salary scaling by cost of labor is also a little odd, but discussed at length elsewhere on the Web (pros and cons)\r\n\r\nOne thing that's unexpected is the shackle of living in a high-COLA market. Normally, one could decide to add an extra 30 minutes to a commute to find more affordable housing, but once you cross the metro area line, you drop into an often dramatically lower bracket: Leaving New York City (90% of SF base) drops you to \"Everywhere else, NY\" (63%). So a lot of moves of financial convenience just aren't worth it, unless you REALLY move somewhere where the floor is so low that the ceiling dropping doesn't matter. If I leave a $200k TC job in Manhattan for $150k at GitLab, the prospect of moving to White Plains where I could possibly afford a house seems doable, until I learn that my salary will now be $105k. So now instead of being a lifetime renter in the East Village, I'm a lifetime renter in the burbs.\r\n\r\nIf you're looking for a structure within which to build a long-term career plan, you'll need to be fortunate enough to happen upon the right openings at the right time, although that's because people rarely leave, which is a good thing."}, {"review_title": "Great culture, fast growing", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "12 Mar 2021", "job_title": "Analyst in San Francisco, CA", "duration": "N/A", "pros": "good values, especially transparency; fast growing; team members are very competent.", "cons": "learning curve to get used to 100% remote. Once fully ramped, love it."}, {"review_title": "Company values got lost on the journey, politics and bullying are the new policy", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "24 Nov 2020", "job_title": "Sales in Cologne", "duration": "N/A", "pros": "fantastic product, great vision, absolutely easy to sell and to very reliable, technically a dream.", "cons": "HR is supporting bullying managers. Processes are more complicated then at a company at the size of Oracle or Microsoft. Politics instead of start up mentality. Handicaped people are bullied out with the help of Senior HR staff and lawyers."}], [{"review_title": "Best company I've worked so far", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "8 Feb 2021", "job_title": "Technical Support Engineer", "duration": "N/A", "pros": "Amazing culture (Exactly what they say in the handbook); The values in the handbook are lived inside the company;", "cons": "Did not find anything bad"}, {"review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "2 Dec 2020", "job_title": "Recruiting", "duration": "N/A", "pros": "Highly collaborative environment. A lot of autonomy and trust and the whole company lives and operates by the values they publish in every aspect of the company. Great teams throughout!", "cons": "Hard to identify any con's - if anything they could be clearer in the pathway's for progression in roles and how to get there"}, {"review_title": "Fantastic Company", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "24 Nov 2020", "job_title": "Senior Integrations Engineer in Quito", "duration": "N/A", "pros": "- Employees feel a lot of purpose\r\n- Very transparent company\r\n- Fantastic benefits\r\n- Fully remote", "cons": "- Being fully remote can be challenging for some\r\n- A lot of siloing between departments\r\n- Pay is lower than the market rate if you live in a low location factor area."}, {"review_title": "Living our values", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "10 Feb 2021", "job_title": "Marketing", "duration": "N/A", "pros": "Consistent iteration to improve across the company", "cons": "Pay is a little below industry"}, {"review_title": "great organization", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "17 Feb 2021", "job_title": "Senior Support Engineer in Sarajevo", "duration": "N/A", "pros": "super cool for personal development", "cons": "becoming more and more enterprise oriented"}, {"review_title": "Great", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "23 Sept 2020", "job_title": "Backend Engineer", "duration": "N/A", "pros": "Flexibility, great talent, opportunity to grow and competitive market.", "cons": "Its' maturity have grown to a corporation level. It's more stable than ever, but in cost of application complexity and bigger codebase due to the intense amount of features being introduced.\r\n\r\nIt goes according to the plan of a single application for the whole lifecycle, but I fear it reaches a point that it just does too much."}, {"review_title": "Awesome Company!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "30 Nov 2020", "job_title": "Senior Engineer", "duration": "N/A", "pros": "GitLab is definitely one of the Outstanding companies in the market out there.\r\n\r\nEveryone at the company is extremely friendly and helpful.\r\n\r\nExcellent Pay-rate.\r\n\r\nStock Options.", "cons": "Haven't found any as of now."}, {"review_title": "Well run, high growth start up", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "20 Nov 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "GitLab understands the importance of building a healthy company as well as an incredible product and community. One of the challenges with some of the best products out there is they are so focused on the product they are building that they neglect the culture and health of the company. Not so with GitLab. It is balanced, transparent, healthy, and free from office politics. It is run by a CEO who wants to be a CEO, and who puts his energy into continually improving his ability to be an effective CEO.\r\n\r\nOther pros:\r\n\r\n- Talented software developers, ux designers, product managers, marketers, people ops, finance, accounting, solutions architects (SEs), customer support, account managers, and sales professionals. No weak links at the company.\r\n- The company and product are improved by open source contributors.\r\n- Frugal, practical, and operationally mature. Run like an adult company.\r\n- People like working with one another, and are genuinely thrilled to see one another during the company summit held once every 9 months.\r\n- Flexible remote-only work culture. Everything important has a url, decisions get written down, and everyone works well asynchronously.\r\n- GitLab listens to its customers, and ships new features for them on the 22nd of every month.\r\n- The product was the highest rated leader in Forrester's CI Wave.\r\n- Listens to and values feedback from developers, IT ops practitioners, and IT leaders.", "cons": "- There is always a lot of work to do given the company's rapid growth, so life-work balance can be challenging.\r\n- Typical startup challenges: lots of competing priorities and everyone needs to wear a lot of hats."}, {"review_title": "It's All True", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "18 Jun 2020", "job_title": "Senior Brand Designer in Victoria, BC", "duration": "N/A", "pros": "Honestly, I have never worked with a company that practices what they preach as much as GitLab. I was honestly skeptical at first as promises of \"Transparency,\" \"People First,\" and \"Company Culture\" are typically more hollow aspirations than reality, but GitLab backs up what they claim. It's like buying something off of Amazon because the reviews are great and, when it shows up, it's exactly what you were hoping for. It's rare, but it happens.", "cons": "Not really. So far, so good."}, {"review_title": "Finally a company that lives up to their values", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "17 Jan 2021", "job_title": "Software Engineer", "duration": "N/A", "pros": "Lives up to their values", "cons": "Cannot think of any, honestly"}], [{"review_title": "Great place to learn and thrive", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "9 Jan 2021", "job_title": "Director in New York, NY", "duration": "N/A", "pros": "Great place to learn and thrive. Work from anywhere.", "cons": "Asynchronous decision making can make decisions take longer and harder to absorb."}, {"review_title": "Great company full of people who really care", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "21 Feb 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "At GitLab, transparency is key, and what you see is what you get. First off, the company itself is great – the product is strong and loved by many customers, and company performance is well above par. But more important than performance is the team and the people who lead it. Everyone at GitLab is welcoming and friendly, which is particularly difficult for a fully-remote organization. I feel like everyone – from my team, to my manager, to leadership – truly care and are invested in my success. The flexibility and work-life balance is unbeatable. I've been at other remote companies that tout flexibility, but expect you to be at your desk from 9-5 and get on your case when your Slack status is not available in the middle of the workday. GitLab delivers on the flexibility they promise – they trust you to get your work done on your time. They also understand that work is not always the most important thing, and thereby constantly encourage you to take time for obligations and interests outside of work. And lastly, GitLab truly embraces the idea that \"everyone can contribute.\" Because of this, your opportunities for professional growth are limitless in this organization. No problem is too big or small for either an individual contributor or executive to solve. Every employee is encouraged to reach their full potential and explore problems/areas that are of interest to them.", "cons": "Compensation is not always up to par with similar businesses in the industry. Other benefits like remote work, unlimited PTO, etc. absolutely make up for some of this, but it's important that team members also feel the skillset they're bringing to the table is valued with appropriate compensation."}, {"review_title": "Progressive and Caring", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "28 Aug 2020", "job_title": "Manager", "duration": "N/A", "pros": "What is there not to love? \r\nAwesome Product- Check\r\nFull transparency- Check\r\nGreat Salary- Check\r\nSupportive and collaborative culture that genuinely cares- Check\r\nAMAZING BENEFITS- Double Check\r\n\r\nBut seriously, GitLab is so progressive from its 100 percent remote workforce, to it's fully transparent handbook, and its everyone can contribute culture. You really feel like you belong and deserve to be here.", "cons": "I'll tell you when I find one!"}, {"review_title": "GitLab, family is top of mind", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "3 Apr 2019", "job_title": "Enterprise Business Development", "duration": "N/A", "pros": "have now been with GitLab for about 4 months.  I left my previous company not because it was a bad company, not because I wasn't getting paid enough, but because but they did not understand the importance of being able to work from anywhere especially from home surrounded by family.\r\nSee I grew up in a single mom house hold, I'd never trade that experience and my Mom is the strongest woman on the planet, but I spent so much time alone, or at daycare, or not with my Mom because she had to work all the time to make a life for me.\r\nI have woke up every morning since I started at GitLab along with my 12 month old son, to make breakfast for him and my wife. I spend every day working from our home, where both my wife and son are as well and  I can step away, spend time with them, play with my son, take him on a walk. This is something that I have wanted ever since my son was born.\r\nI just want to thank you for providing a work place that places family at the top of mind for employees.  I have never been happier in a role or at any other company than I am at GitLab.", "cons": "The only con is based on the individual. This is a totally remote company. You must be prepared to reach out to others and to share, communicate and be willing to learn without being in an office. But with that being said, GitLab assists in travel costs if you'd like to visit another employee to spend time working along side them learning and getting to know your team."}, {"review_title": "Love this company!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "2 Dec 2020", "job_title": "Senior Sourcing Recruiter in Minneapolis, MN", "duration": "N/A", "pros": "Freedom to work from wherever you want and flexibility with your schedule. Family and Friends first. The best manager I have ever had.", "cons": "Not sure I have experienced any cons as of yet."}, {"review_title": "Yay", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "12 Jan 2021", "job_title": "Sales Development Representative (SDR) in Portland, OR", "duration": "N/A", "pros": "Great company to work for!", "cons": "Lack of career advancement internally"}, {"review_title": "Initial thoughts after first month", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "19 Jun 2020", "job_title": "Support Engineer in Hobart", "duration": "N/A", "pros": "* The biggest, most established all-remote workforce in the world\r\n* Really great technology and product, very interesting, varied work\r\n* Great team mates who are genuine, welcoming and supportive\r\n* No-nonsense reimbursement and good guidance on spending budget\r\n* your equipment expenses are covered\r\n* everything (that I know about) is documented, most of it in public\r\n* truly open-core\r\n* the values are not lip-service", "cons": "* they do harp on those values, quite a lot. they're good ones though\r\n* be prepared for a steep learning curve"}, {"review_title": "Great product and culture, clueless management", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "12 Sept 2020", "job_title": "Strategic Account Leader", "duration": "N/A", "pros": "Excellent product that is priced right", "cons": "Like many startups, top performers are promoted quickly; unfortunately, this leads to a lot of inexperienced and incompetent sales leadership creating ineffective strategies."}, {"review_title": "Company values are just PR, when it gets uncomfortable they are bypassed", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "2 Jul 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "* Full remote\r\n* Unlimited Vacations\r\n* Open-source/source available product\r\n* Transparent company for most things\r\n* You will work with a lot of good people", "cons": "Company HR practices are not different than any San Francisco company, with all the obvious downsides.\r\n\r\nCompany local payment is just a way for the company to lower their human labor cost, despite they trying to sell that publically as “a good thing” and as that being “fair”.\r\n\r\nGitLab keep hiring bad leadership. Some are fired, some are “let go”, some are not replaced when “they leave to pursue other opportunities”. They all seem to get support from CEO, despite obvious mistakes.\r\n\r\nCompany has a bipolar attitude towards culture and values. They will say they care, and company is family and friends first, but as money gets in the way, they go all greedy mode. In many locations, people are hired through different ways of contract or PEO, etc. For reasons specific to company’s own interest, they are migrating every “risky” contract to something else that will result in people’s net income decreasing and they are not eager to cover that cost (as it was their own mistake to begin with), so not family first when money get’s on the way.\r\n\r\nCompany seems to not understand peoples desire to privacy. They keep asking people to not use private messages (when there are obvious reasons why someone would want to do that), they keep moving toward pervasive analytics and telemetry, despite wide community and internal team members opposition, they keep moving toward implementing extensive monitoring of everyones notebook with “compliance” excuses, despite internal opposition.\r\n\r\nCompany keeps saying they need to “raise the bar” with hirings and promotions, which is just a way for them to promote less and hire only in a few “developed countries”. It’s both an internal sabotage of location diversity and a cost-saving policy."}, {"review_title": "Sub par startup with great marketing headlines", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "29 Jun 2020", "job_title": "Sales Representative in San Francisco, CA", "duration": "N/A", "pros": "Great product that the market is excited about.", "cons": "If you speak up to upper management, be prepared to be put on plan depending on you speak to. \r\nThis company is going public and pulling all the wool over the eyes to get there. \r\nIf you're an URG you're safe here\r\nThey're letting people go during covid to due \"execution\" so they don't get any bad publicity."}], [{"review_title": "GitLab - Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "29 Jun 2020", "job_title": "Principal Practice Manager", "duration": "N/A", "pros": "Documentation-first approach helps ensure asynchronous, distributed culture thrives. Values are clear, well documented, and lived by all employees. Tons of smart and motivated employees. Progressive and flexible working agreements. All remote. Periodic all team gatherings. Great outlook to capture a larger percentage of an expanding market. Compensation and Benefits are great.", "cons": "100% remote takes some getting used to - sometimes hard to shut work off."}, {"review_title": "Corporate Stress and Pressure ahead of IPO", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "6 Oct 2020", "job_title": "Sales Representative in San Diego, CA", "duration": "N/A", "pros": "Flexible working practices and great product and some great team members", "cons": "Pressure and Stress's of working for a large organisation"}, {"review_title": "Very bad executive management", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "17 May 2018", "job_title": "Sales Development Manager", "duration": "N/A", "pros": "Great co-workers that aren't in executive management \r\nGood work lifestyle", "cons": "CEO will micromanage the entire company without giving anyone liberty to do the jobs that they are paid to do. If he is unhappy with what he deems as 'his way' you will be called into a video room without notice and let go, he does not even have the audacity to do it in person.  \r\n\r\nTheir severance package is horrible, they do not do matching 401Ks, and most of the company is in fear for being fired after all of the marketing layoffs they did without notice last year.  They recently hired a new CMO that was let go without notice that came as an absolute shock to the entire company. Surprisingly, even though most of the sales team did not hit quota last year, they have never had layoffs. Those marketing employees that are, however, are let go without notice. \r\n\r\nCEO has no concept of sales, marketing, or HR and really should just be a developer. He is not fit to be a CEO of a company and has created a sense of terror in the company that all employees are talking about."}, {"review_title": "Like no other company I've experienced", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "10 Feb 2020", "job_title": "Support Engineering Manager in Erie, CO", "duration": "N/A", "pros": "Interview with a bunch of companies, especially high-tech ones. Each one will tell you about their amazing culture and their special values. It gets pretty old pretty fast. But interview with GitLab, and immediately it becomes clear that something is different, truly different, unique. From the moment I began speaking with people at the company during the hiring process all the way through my first month at the company (as of this writing, I'm pretty new), I've been impressed that absolutely everybody lives the values every moment of every day.\r\n\r\nWhat it looks like is a constant sharing of information and ideas, with even the newest employees being encouraged to contribute from day one. It's really very cool.\r\n\r\nIt's also important to note that this company has no offices anywhere. Everyone works from home, or from wherever. And we're spread around the world. It's wonderful to be free from commuting, to have extra hours added back to your day. And because remote work is what everybody in the company does, GitLab has figured out ways to do this well, from making it really easy to set up your home office, to providing all the communication tools and framework you need to be and feel connected to your colleagues at all times.", "cons": "None. No, GitLab isn't perfect. But with a strong product to offer to customers, a tremendous growth trend, and a strong set of heartfelt values that includes a genuine desire to be improving everything about the company continuously, there aren't any long-term cons that I have spotted."}, {"review_title": "Great company - good leadership at fully remote company", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "13 Jul 2020", "job_title": "Sales Development Representative (SDR) in Teaneck, NJ", "duration": "N/A", "pros": "Great leadership, fully remote company (so many benefits including flexible hours, no commute, increased work-life balance), talented hardworking and kind coworkers", "cons": "Fully remote culture is not for everyone - some people would rather form relationships in the office depending on their season of life and personal preference"}, {"review_title": "Great place to work!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "1 Oct 2020", "job_title": "Senior Director in Austin, TX", "duration": "N/A", "pros": "Everyone can contribute really holds true at GitLab.", "cons": "Due to true remote nature of the company from its beginning, some folks struggle to adapt."}, {"review_title": "best company I have worked for in my career", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "30 Jun 2020", "job_title": "Account Executive in London, England", "duration": "N/A", "pros": "smart people, work life balance, family first culture, great benefits, working from home, great product", "cons": "No real cons that are worth mentioning. Sometimes personalities clash but thats normal. As a company, its a great place to work"}, {"review_title": "Really cares about their employees", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "17 Sept 2020", "job_title": "Product Manager", "duration": "N/A", "pros": "The best you can say about GitLab is how much they care about their employees.", "cons": "Other all-remote companies are starting to offer better salarissen."}, {"review_title": "An incredible place to work, fully remote, growing, and an exciting product to work on!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "14 Aug 2019", "job_title": "Frontend Engineer", "duration": "N/A", "pros": "- Fully remote (the obvious first pro)\r\n- The company supports you working in the way you do best.\r\n- Your performance is measured in results, not hours at your computer.\r\n- Nearly everything about the company is open source, or written and documented, or recorded and on YouTube, or broadcasted on a live stream. It is truly an open company.\r\n- Your colleagues are *people*, not resources, and the handbook emphasizes that.\r\n- Speaking of the handbook, it's great and publicly available online.\r\n- The first week of on-boarding tasks are really well thought out and helps new employees acclimate to the GitLab ways of working.\r\n- I've personally noticed very little to no interruptions during the day, and every day has felt very balanced with productivity, company calls, and coffee chats/social calls.", "cons": "- You might opt in to join a company call outside of your typical domain and be exposed to terminology/acronyms you're unfamiliar with.  It's not much of a con as it is a learning opportunity! But it might be difficult at first to understand what is going on if you don't ask what something means or do a bit of research."}, {"review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "17 Sept 2020", "job_title": "Staff Engineer", "duration": "N/A", "pros": "The company values mainly transparency.", "cons": "The compensation is not so competitive."}], [{"review_title": "Unique and refreshing culture", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "7 Jul 2020", "job_title": "Strategic Account Leader", "duration": "N/A", "pros": "Fantastic and unique culture, great benefits and work life balance. The culture is such that it gets the best out of all employees.", "cons": "Hard to say at this stage."}, {"review_title": "Radically open, joyfully honest, and leading the way in remote work.", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "23 May 2019", "job_title": "Senior Frontend Engineer in San Francisco, CA", "duration": "N/A", "pros": "If you have a passion for DevOps this is the place to be. GitLab offers the opportunity to contribute to every aspect of the DevOps loop and uses its own software to improve the performance and productivity of its own developers and developers everywhere. Are you a skilled developer who prefers using and contributing to open source solutions? Do you value transparency, rapid iteration, and your own autonomy? If so, then you would fit right in at GitLab.", "cons": "As part of a rapidly growing organization with remote employees working together from all around the world, you will need to be naturally self-driven in order to succeed. GitLabbers are wonderful and talented people and the onboarding process is long and well-conceived. But, as a manager-of-one, you will need to embrace disciplined personal organization and balance work and personal life appropriately to ensure your own health and happiness."}, {"review_title": "CEO is a robot", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "21 Jun 2020", "job_title": "HRBP", "duration": "N/A", "pros": "You get to work home, always - even after COVID-19.\r\nThe CEO pretends to care about people but he really does not.", "cons": "The company no longer values its values. It's all marketing, not actually how things work."}, {"review_title": "Remote Powerhouse", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "21 May 2020", "job_title": "SMB Account Executive in Athens, Attica", "duration": "N/A", "pros": "- biggest all-remote company, doesn't just do remote, but does remote well - you feel connected to the entire company\r\n- everything (almost) is public! There is a handbook that everyone contributes to that has all the information you need. I was blown away by the transparency - even before joining I could look up anything about how the company operates.\r\n- truly lives by the values set and there is a lot of credit / thanks going around praising team members exhibiting them\r\n- amazing people all around - great personalities\r\n- very competitive compensation \r\n- amazing time-off policy (best policy I ever encountered) you truly have the freedom to define your life & schedule - time for self-actualization\r\n- manager will actually hunt you down if sees you burning out\r\n- great freedom & financial support to create your dream home workstation\r\n- very inclusive! found a group for everything, diversity is respected\r\n- grand potential for career development\r\n- gosh, there are a lot of good things - I'm afraid I'm forgetting stuff", "cons": "- if you haven't worked remotely before beware of the trap of working all day, also set up needs to be good and distraction-free"}, {"review_title": "Gitlab is setting the pace for the future of work", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "17 Feb 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "You feel welcome by everyone, at every moment. Any question to anyone from the new member to the CEO is always answered with an excellent attitude, you can feel how the entire company is there to help you succeed.\r\n\r\nYou choose your hours, and how you work, so all those small things from your life that used to be not so easy due to office hours are now possible.\r\n\r\nGitlab has excellent documentation and it evolves every minute, I was amazed how well line up my on boarding was, it just feels refreshing.\r\n\r\nEveryone can contribute, the company mission and one I can say, the team really puts their heart into it.", "cons": "Not a company con by itself but with a full remote, you need to make adjustments to take a walk,  have a break and just go out get some sun o so."}, {"review_title": "Great culture and benefits", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "18 Jan 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "The executive team at GitLab is excellent and wants people to be happy at work and succeed in their jobs. I've been given every tool I need to be successful.\r\n\r\nWorking remote has been amazing. I have the opportunity to mold my work schedule to be whenever is most convenient for me. I usually take a break during the day to run errands or go to the gym.", "cons": "Working remote isn't for everyone. Some people can feel isolated. The company is also quick to let people go if they aren't able to work effectively remotely. This has led to a few people that get hired and then let go very quickly or within a few months. I think the company is making efforts to fix this in the hiring process."}, {"review_title": "Best place I've worked - by a long shot", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "10 Apr 2019", "job_title": "Senior Frontend Engineer in Charlottetown, PE", "duration": "N/A", "pros": "- Commitment to remote work.  As a remote-only company, GitLab is forced to do remote work right.  Since everyone is remote, you never feel like you're \"missing out\". GitLab has a number of innovative policies and processes that help make remote work successful.\r\n- Technical competency.  Since GitLab has access to the global talent pool, the level of talent at GitLab is incredibly high.  Every employee I've interacted with has an impressive background and a deep knowledge of their craft.\r\n- Inspiring product.  It's incredibly satisfying to work on a product that millions of people use.\r\n- Dogfooding.  GitLab uses its own product to develop its software.  It's satisfying to see your improvements in the product you use on a daily basis.\r\n- Culture of openness.  All of GitLab's values and company policies are explained in the \"handbook\", a massive, searchable, publicly-accessible document that anyone can edit.\r\n- Positive work/life balance.  GitLab employees aren't pressured to work overtime and are encouraged to take vacations.\r\n- Generous spending policy.  GitLab will pay for any equipment you need to do your job, and there's no red tape or approval processes.\r\n- Global.  It's a ton of fun to work with people from all over the world.\r\n- High morale.  At the time of writing, there's a lot of interest and investment in GitLab.  Everyone at GitLab feeds off this excitement.\r\n- Salaries are (kind of) transparent.  You can get an idea of what you'll make before you even apply using the interactive salary calculator.\r\n- Clean code base. GitLabbers spend a lot of time making sure GitLab is developed using the best practices.\r\n- Competent leadership. In particular, the CEO (Sid) is incredibly knowledgeable about the product and related technologies.\r\n- Growing like crazy.  This is an exciting time to be working at GitLab.", "cons": "- Depending on your area, compensation is sub-par.  \r\n- Benefits for non-US workers are sub-par or non-existent.  For example, Canadian GitLabbers are not offered any health benefits or retirement plans (at the time of writing).\r\n- No annual bonuses.\r\n- Even though GitLab does remote work really well, remote work can still be hard.\r\n- Members of the HR team (referred to internally as PeopleOps) have a ton on their plate, since they are managing a global workforce.  They do an incredible job, but sometimes things slip through the cracks simply because they have so much to do compared to your \"average\" HR person."}, {"review_title": "Great Remote Company to work for", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "19 Feb 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- Fully remote and distributed (if you love remote working this company is for you)\r\n- Capacity to learn and grow\r\n- Super Colleagues (literally everyone I've worked with has been friendly, helpful and warm)\r\n- The product will become bigger; if you want to be part of something that will change the way the world works, it’s a great time to join.\r\n- Great equipment was given to work on.", "cons": "- So many meetings (You are not required to attend all of them as they are recorded. But you still feel like your missing out if you need miss any)\r\n- PeopleOps need more help\r\n- A-sync work is not for everyone\r\n- Everyone is busy so getting reviews/feedback can be at times frustrating"}, {"review_title": "Amazing Culture, Super Bright, Passionate People", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "10 Jul 2019", "job_title": "Strategic Account Leader in Los Angeles, CA", "duration": "N/A", "pros": "Smart, passionate co-workers. GitLab has an excellent culture consisting of a very open, transparent, and flat hierarchy. The people here love what they do and are willing to go the extra mile to help and make sure any job is done in the best way possible. Pay is good, company is growing with excellent market position, and did I mention it is work from home.", "cons": "Work from home can be a negative if you aren't used to it and don't have a bit of an independent streak. The resources and help from co-workers more than makes up for it, and you don't have a hybrid environment because everyone works from home. Everyone works super hard so you have to find your own work-life balance."}, {"review_title": "Defining The Remote Culture", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "13 Jan 2020", "job_title": "Sales Representative", "duration": "N/A", "pros": "Gitlab is a fast growing & progressive software organization that values each employee. Not only is there opportunity to contribute to the entire organization & have an impact on others, it's expected. Everyone can contribute is our motto and we all grow together.\r\nWorking as a remote employee doesn't feel like isolation. It's been the best experience since going Gitlab since the flexibility provides a control on life while still able to hits sales targets.", "cons": "This a rapidly growing software organization that is 100% remote with plenty of growing pains. It's imperative to be the squeaky wheel and speak up when you have questions. Sometimes this isn't communicated upfront & can feel like you're on an island. To that point, we have weekly meetups for local workers to break away from the house routine."}], [{"review_title": "Walking the Walk", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "20 Apr 2020", "job_title": "Team Lead in Johannesburg", "duration": "N/A", "pros": "GitLab offers an 'environment' in which all team members are enabled to succeed - from ensuring correctly spec'd equipment is made available (globally) to their unique and thorough onboarding mechanisms and the role specific training - every touch point has been carefully considered making sure everyone can not only quickly immerse and begin to contribute but do their best work while doing so.\r\n\r\nGitLab walks the walk making sure that the company values are breathed into every facet of the business i.e. collaboration + results + efficiency + diversity (and inclusion) + iteration + transparency.", "cons": "At first some of the tech-speak may seem intimidating to new team members - this is quickly overcome through the training mechanisms and handbook however it can be overwhelming (particularly as someone who had never used Git prior to joining).\r\n\r\nIt can take time to establish a rhythm / routine if this is your first all-remote role - you may find yourself online for longer than anticipated for the first few weeks."}, {"review_title": "Lives up to its values", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "18 Jul 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Work remotely anywhere in the world. Literally. And the company will hook you up with everything you need for your home office.\r\nThe team is so nice. Like really, really friendly. Everyone.\r\nThe company values aren't just written down to make the company sound good, but they're actually upheld and encouraged by upper management. Even (and especially) things like taking time off.\r\nThe CEO and other execs actually listen to all employees, no matter their position or newness to the company. If it's a good idea, it gets heard and acted upon. This rarity is enhanced even further by the openness of the daily team call and other calls.", "cons": "Working remotely is awesome, but... well, it can mean you'll be by yourself a lot if you're not careful. That can be good or bad depending on who you are and how you work."}, {"review_title": "Best team & company culture I ever encountered", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "18 Jul 2016", "job_title": "Executive Assistant to Chief Executive Officer in San Francisco, CA", "duration": "N/A", "pros": "The team is great, from day one you're part of the GitLab family. Even with everybody being remote (everyone works from home) there is so much \"water cooler talk/coffee break talk\" going on; during daily team calls, on Slack, emails; everywhere! It's a high paced work environment which keeps you energized and on your toes to get the best quality work done.", "cons": "Since everyone is remote it can be a little quiet as it's just you at your \"office\". Would love to be able to grab lunch with some colleagues. On the other hand, it's a great way to visit coworkers in a different part of the country or world; work together and travel anywhere you'd like."}, {"review_title": "Excellent company.", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "1 Aug 2019", "job_title": "Backend Engineer", "duration": "N/A", "pros": "- Love love love working fully remotely! Helps a lot when it comes to  manage family life.\r\n- Interesting product and great tech stack to work on.\r\n- I work with a bunch of cool people, I get to have video calls with them often.\r\n- I've been enjoying working asynchronously! For example, sometimes I get to finish my day with some work handed over to a team member to review. This team member would be located somewhere that's 10-12 hours ahead of me, which means that when I start a new working day, it's likely that I'll have already receive my reviews from my colleague. As a developer, asynchronous work is definitely something that works well.", "cons": "- The company is growing very fast. As a result, onboarding was a bit rocky, I didn't get my working laptop until a week / 10 days after my first day. Minor annoyance, but that's part of growth, I understand it."}, {"review_title": "GitLab is everything you want in an employer", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "14 Mar 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "+Incredible growth trajectory\r\n+Employee stock options (which gives everyone further incentive and ownership in the organization)\r\n+Great benefits (medical and dental in US) plus remote only, flexible hours, and unlimited PTO\r\n+Learning culture It's totally ok (and encouraged) to make mistakes as long as you are learning and growing from them\r\n+Incredible product with real market differentiation and clear value proposition\r\n+Committed employees, managers, and community dedicated to making GL great\r\n+Visible and accessible executive team \r\n+Fewer meetings, more productivity\r\n+Everyone contributes and is hands on with the product", "cons": "-Growth is very fast, and the culture is changing as a result. Not a con, but just something to consider. Scaling such a niche awesome culture is hard to do. I think GL is doing a good job so far but I anticipate hurdles.\r\n-Learning curve and onboarding ramp up can be steep\r\n-Only meeting team members once per year\r\n-Some kinds of work are valued higher than others"}, {"review_title": "Freedom", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "15 Jan 2020", "job_title": "Anonymous Employee in Lehi, UT", "duration": "N/A", "pros": "I have worked a bunch of different places, but GitLab has to be my favorite so far.  The culture permeates the organization.  Everything is done remotely and asynchronously so I don't feel pressure to keep my seat warm and there is no commute.  I am actually encouraged to take time off.  Also, the benefits cost less than what my health insurance alone cost at my old job.  All in all, I hope to make a long career out of working at GitLab.", "cons": "You need to be self-motivated and be able to find a place to focus to work remotely.  Not really a con, but something for potential employees to consider.  Also, you may be able to get paid more elsewhere, but the benefits of working remote are worth their weight in gold."}, {"review_title": "Fully Remote, Amazing Company!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "21 Oct 2016", "job_title": "Graphic Designer in Colorado Springs, CO", "duration": "N/A", "pros": "Working for GitLab has been, by far, my best career move yet — from a professional perspective I've been constantly challenged, able to learn and grow from the amazing team around me, and able to contribute my expertise and feel valued. GitLab's values are more than words on paper, they are one of the few companies I've worked for that actually uphold them. A gem of a tech startup to work for — work from anywhere, have a truly flexible schedule, and work with some of the most talented individuals in the world!", "cons": "Sometimes the lines of work / life balance can be blurred, but always with the best of intentions. Working night and weekend happen on occasion, but certainly a rarity."}, {"review_title": "GitLab sets the standard for  remote working", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "9 Jul 2019", "job_title": "Engineering Manager", "duration": "N/A", "pros": "I have worked remotely for several years and worked at GitLab remotely for 1 month.  I must say that GitLab is light years ahead of most companies when it comes to creating the most efficient remote work environment.  I think the key to their success is using tools to support their remote needs.  I have listed a few below:\r\n\r\nRecruiting Remotely\r\n\r\n- Use Zoom for candidate interviews\r\n\r\nRelease Planning Remotely\r\n\r\n- Use GitLab to track and Plan Software Releases\r\n\r\nAgile Ceremonies\r\n\r\n- Use Automated Slack Bot to facilitate daily Stand Ups across remote time zones\r\n- Use GitLab to perform asynchronous Sprint Retrospectives\r\n\r\nMeetings & Company Announcements\r\n\r\n- Use Zoom and YouTube for Meetings & Company Announcements\r\n\r\nSocializing Remotely\r\n\r\n- Use Zoom for informal Coffee Chats\r\n- Use Slack for various social channels", "cons": "I have nothing to report."}, {"review_title": "Maybe not for everyone, but I love it here", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "18 Sept 2019", "job_title": "Senior Frontend Engineer", "duration": "N/A", "pros": "- GitLab is a remote worker's dream\r\n- Their values are great and a much more than a sign painted on a wall. We mean them and we adhere to them every day no-matter your level or status.\r\n- You're treated with respect and everyone has a voice\r\n- The directors and higher level staff are the most approachable I've seen at any company\r\n- I get to work on a product I love\r\n- I get to meet and work with people from all over the world. Sometimes in person. Sometimes in wonderful locations.", "cons": "- The growth here is amazing, but can be a little overwhelming at times.\r\n- Working this remotely can be hard for some people. There can be a steep learning curve if you're new to it.\r\n- Depending on your location, the pay isn't always amazing, but it is fair."}, {"review_title": "Great Culture and Leadership!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "20 Jul 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "GitLab has an amazing culture driven by results. They do not care when you work, but that you simply get the job done. It is refreshing to work for a company that allows this sort of freedom. Everyone at the company is friendly and welcoming.", "cons": "If you are not a fan of working from home (or working remotely) than this company is not for you. The freedom and flexibility come with the possibility of feeling lonely, but GitLab is doing its best to combat that. We have instituted coffee breaks where you schedule time to take breaks and chat with co-workers. We also have many channels on Slack to communicate with co-workers."}], [{"review_title": "Transparent Company, Inclusive Culture, Innovative Product!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "22 Nov 2019", "job_title": "Strategic Account Leader in Washington, DC", "duration": "N/A", "pros": "All remote work, fast growing company with fantastic product, thought leader in the DevSecOps space, insanely transparent (nearly all company information is publicly available,  just try a Google search!), great benefits and compensation package.", "cons": "Onboarding is very self-service, information and communication is in too many channels, sometimes it can be hard to find things and sometimes you have to go to multiple places to maintain data and do work: Handbook, GitLab, Google Docs, Salesforce, Slack"}, {"review_title": "This is a company that walks the talk.  Rare to find these days.", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "1 May 2019", "job_title": "Senior External Communications Analyst in Pittsburgh, PA", "duration": "N/A", "pros": "Incredibly focused on culture and values.   Transparent beyond belief.  Supportive of iterative learning & production. Very flexible and supportive environment. Completely remote with appropriate tools to foster collaboration (slack).   Overall, very positive environment.", "cons": "GitLab tool is used for almost everything...including marketing content, so there's a big learning curve for a non techie and much time spent trying to accomplish things in a one size fits all enviro.  Also, some growing pains...company is quickly growing and, as can be expected, some people and processes aren't ready to scale just yet."}, {"review_title": "No surprises here. Exactly what is advertised!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "15 May 2020", "job_title": "Senior Backend Engineer in Birmingham, England", "duration": "N/A", "pros": "- The handbook is not a marketing tool. The whole company lives and breathes the handbook and it's fantastic. Since I joined, nothing has surprised me as every process and expectation is defined.\r\n\r\n- CEO and executive team are not hidden away. Taking an active role in day-to-day activities. Open to difficult questions from team members regularly.\r\n\r\n- Very open and transparent. If it can be public, it is.\r\n\r\n- Remote work is brilliant. Proper work/life balance is so much easier to achieve, which makes me more productive.", "cons": "None yet! It's been an entirely positive experience.\r\n\r\nIf remote work doesn't agree with your mindset, this isn't the place for you!"}, {"review_title": "Leader", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "7 Apr 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Fantastic company to work for if you love working remote as everyone is 100% remote. No corporate headquarters. Opportunity to meet with people from all over the world.  The values are authentic and true. Extremely transparent.", "cons": "Benefits aren't that great, no 401K. Everything is driven by a handbook, which can be frustrating sometimes."}, {"review_title": "Enterprise Sales Development Representative", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "21 Feb 2018", "job_title": "Enterprise Sales Development Representative in Denver, CO", "duration": "N/A", "pros": "- Servant leadership from management is unparalleled at GitLab. Most high growth startups put product/solution first and the people get left behind - not here! They understand the importance of building the community as well as the product.\r\n-GitLab embraces a fully transparent \"open source\" culture and the values represent this - just check out the handbook online.\r\n- Visionary solution that is changing the DevOps market and how companies develop their software.\r\n- Remote company provides a great work/life balance!", "cons": "- High growth start up - comes with natural growing pains/multiple hats"}, {"review_title": "Awesome culture, organization and product", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "2 Aug 2019", "job_title": "Support Engineer", "duration": "N/A", "pros": "Everyone is extremely helpful and honest, transparency is like I've never seen before, everything about the company is documented and in the open handbook, great work/life balance where people respect each other's time and overall a really great environment. The interview process might take a bit longer but in my experience, I had updates and knew the details at all steps, plus everything about the interview process is also documented so I could read by myself.\r\n\r\nAll the general struggles in remote are thought of and mitigated or alleviated: coffee calls and daily \"breakout groups\" calls for the social interactions that you may miss in a remote environment, asynchronous communication and the \"document everything\" mindset for working across multiple timezones and many others.", "cons": "None so far! (read the last line above)"}, {"review_title": "A great place to grow and thrive as a software engineer.", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "18 Sept 2019", "job_title": "Backend Engineer", "duration": "N/A", "pros": "• Fantastic work/life balance\r\n• Great opportunity to work on unique and interesting projects\r\n• Excellent benefits\r\n• Awesome culture\r\n• You get to work with people all over the world, making the world feel like a smaller place.\r\n• As an engineer, you will receive and learn to give high quality code reviews.\r\n• Yearly company-wide gathering in various places around the world.\r\n• Fully remote, no commutes.", "cons": "Working with people in timezones completely outside of yours can slow down conversations and work."}, {"review_title": "This company understands the importance of each person's time, of family and of course, of the values!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "9 Oct 2019", "job_title": "Sourcer in Bucharest, Bucuresti", "duration": "N/A", "pros": "Form my 1st day in Gitlab, I saw that everyone is there to help you, to answer your questions so you can integrate more easily. Everyone is involved and the company's values are a way of living. \r\n1) Understands the importance of spending time with your family and friends\r\n2)Helps me to grow as a Talent Sourcer, but also as a person\r\n3)Knows the importance of their values and takes them seriously \r\n4)Promotes self care", "cons": "These are not cons, but advices.\r\n1) Because we are working remotely, don't forget to take your time and go outside\r\n2)Try to have as many coffee chats (small meetings) as you can so you can meet a lot of people from the company."}, {"review_title": "Best software/tech opportunity I've seen in a long time", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "15 Mar 2017", "job_title": "Sales", "duration": "N/A", "pros": "The culture & collaborative nature, along with the ability to be 100% remote\r\nThe technology is only getting better by the DAY\r\nThis space in software needs a shakeup and innovation. We are doing that!", "cons": "Because we are all distributed, can make it hard to have true water cooler conversation. We are doing the best we can and have a lot of communication technologies in place to do so...but in person is nice sometimes."}, {"review_title": "Global People Ops", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "2 Aug 2016", "job_title": "Senior Director People Ops in Airville, PA", "duration": "N/A", "pros": "The remote first work relationship is amazing!  I cut 3 hours of commute out of my day.\r\n\r\nEveryone I' ve worked with so far has offered to help with Onboarding.  \r\n\r\nThe People Ops team is amazing!  \r\n\r\nThe Executive team is approachable and down to earth. \r\n\r\nThe organization truly cares about the people.", "cons": "You should be ready to learn a new way of thinking about and working towards efficiency, collaboration and results.  The methodology is a bit overwhelming when coming from conventionally structured orgs. Give it a chance to sink in, it really works!"}], [{"review_title": "Recently hired at GitLab", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "21 May 2019", "job_title": "Support Engineer in San Antonio, TX", "duration": "N/A", "pros": "The people are amazing - everyone has been so nice and helpful with answering questions (work related or not)\r\nVery flexible - they worked with me through a hard time of traveling to see a sick relative even during the interview/hiring process.  This continues afterwards as well with allowing me to schedule time off very easily.", "cons": "Working remote - its a bit of an adjustment, even though I love it, but there is no office so when filling out new hire docs and getting work equipment it does take a bit to figure out."}, {"review_title": "Genuinely great, open company", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "8 Nov 2016", "job_title": "Frontend Engineer in Denver, CO", "duration": "N/A", "pros": "- Nearly everything you do can be shared with others, helps to give a real sense of accomplishment.\r\n- Work with people from dozens of countries around the world, our internal chat and team calls have made me more aware of events and cultures around the world.\r\n- A significant portion of your work will involve contributing to open source software.\r\n- Everyone is remote. You can work anywhere with no manager looking over your shoulder and no (physical) interruptions from coworkers.\r\n- Handbook is available for anyone to read, and our issue tracker and merge requests are useful insight for any engineers looking to apply. If you spend a few hours reading through issues, merge requests, the handbook, etc. you can get a very good feel for how the company operates, including the stuff that doesn't always give the appearance of perfection (wouldn't have it any other way).\r\n- Summits give you the opportunity to travel to other cities and countries every 9 months to be with your teammates and hang out for a week, about half work and half activities (scavenger hunt, zipline, tubing, rafting, etc.).", "cons": "- Remote work can at times be lonely if you don't take full advantage of video calls, coworking spaces, etc. (though there are policies in place to help with this, it's something to note)\r\n- Chat can distracting if you let it be, you definitely want to have self-control to avoid spending too much time on its distractions.\r\n- Depending on what time zone you live in and what hours of the day you work it can be difficult to quickly get answers to questions, feedback on product/technical decisions, etc. Most Europeans and Americans will have plenty of people available.\r\n- We rely heavily on written documentation to allow for asynchronous work, but things can sometimes get lost or become outdated due to the sheer amount of documentation we have."}, {"review_title": "Great Collaboration and welcoming team!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "27 Sept 2019", "job_title": "SDR", "duration": "N/A", "pros": "It was been a great initial 2 weeks with Gitlab. Things have gone well and I have received a lot of help and insight from my new team members. It has the benefits of being remote without making you feel alienated or like a person on an island. I am liking it a lot this far and I look forward to having a successful, collaborative and fulfilling career here. They take care of you at Gitlab.", "cons": "The interview process definitely needs work and I imagine they lose out on a lot of good candidates because of it."}, {"review_title": "Great interview experience, great company", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "7 Jan 2020", "job_title": "Senior Full Stack Engineer in Tucson, AZ", "duration": "N/A", "pros": "Background: I'm a software engineer with 30+ years of full-stack experience.\r\n\r\nI first learned about Gitlab as a user, then became more and more impressed by their fully-distributed nature, massive company handbook which is the source of truth for everything the company does, and by their values, which as far as I can tell aren't just lip service, but lived.  So I decided to apply (I had been in my previous job over a decade, this was the first time I had applied anywhere in that time).\r\n\r\nThe interview experience was challenging, but very professional and well-designed.  I had a total of seven interviews, from the initial screening to a 1-1 with the VP of Engineering.  This included two technical interviews, one for frontend and one for backend.  \r\n\r\nThe technical interviews were very well designed.  They were in the form of a dummy Merge Request, which I received 48 hours in advance.  I had to comment and suggest improvements, just as I would when reviewing a real MR.  Then, I had to do some live coding implementing some of the changes, to prove I knew my way around the code.\r\n\r\nThe interviewers were all kind and punctual.  There were no \"gotcha\" or pointless algorithm questions.\r\n\r\nOverall, a great interview experience.\r\n\r\nWorking there so far is great.  Management and peers are very helpful and respectful, and the massive handbook has the answers to most any basic questions you have about anything.  \r\n\r\nWorking hours and vacation policy is also great  Very few meetings. Very flexible, you are basically expected to get your job done, attend the meetings you are required to, and outside of that you can structure your life however you want.\r\n\r\nMeeting etiquette is also very unique in this completely virtual company.  You are welcome to attend any meeting (and many/most are recorded and published publicly, for future review).  They are very strict and succinct about agendas.  You also are not required to pay attention to everything, even if you are attending.  If it's an hour meeting, and you only have ten minutes that applies to you, you can just keep working while you are on the call the rest of the time.\r\n\r\nThe pay scales are also very transparent and fair.  There are very narrow bands determined by your title, skill level, and location, and there are no exceptions to this.", "cons": "Not really a con, but you must be very organized and disciplined to navigate and thrive in such a documentation-centric and process-driven environment.  I am, so this isn't a con for me.\r\n\r\nThey are also currently going through some scalability and performance issues, which is to be expected during periods of rapid growth.  However, as far as I can tell, they are proactively identifying the issues and actively working on them, which is all you can ask for."}, {"review_title": "Strong values, mature processes", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "31 Jan 2020", "job_title": "Senior Product Manager", "duration": "N/A", "pros": "The values listed in the GitLab Handbook are no joke. They're apparent in everything the company does. I love the commitment to transparency both inside and outside the company. As a 100% remote company, results are valued more than \"time in seat\" which means there is more time I can spend with my family and I don't have to feel guilty about stepping away for 20 minutes in the middle of the day. A truly global team means most work is done asynchronously, which means fewer meetings and more documentation.", "cons": "None that I can tell so far. Remote work isn't for everyone, but it works for me and my family."}, {"review_title": "Great Company, Long Hours", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "14 Jan 2020", "job_title": "Manager", "duration": "N/A", "pros": "* Amazing technology and principles\r\n* Great people\r\n* Growth is through the roof\r\n* Company will be a success (at any cost)", "cons": "I agree with the positive reviews here, but there are one or two toxic teams. I enjoyed working here, but ultimately burned out (70-80 hour/wk + weekends, not time off). PTO is strongly discouraged and management is often \"do as I say, not as I do\""}, {"review_title": "Drinking our own champagne", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "20 Oct 2019", "job_title": "Federal Strategic Account Leader", "duration": "N/A", "pros": "The company adheres to the CREDIT values. Everything is transparent and can be found within the company website. If it's not there and you think it should be, you can create a merge request to update the website with the missing knowledge.", "cons": "The handbook and onboarding process is intensive. Due to the iterative nature and the massive growth of the company in a short period of time, it makes sense that there are some broken links. You can also be pulled into multiple directions at once. After the first few weeks you begin to learn what the real priorities are. If you don't know, ask..."}, {"review_title": "Great Place to work and a great place to learn! (Non-Dev review)", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "21 Nov 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- Work alongside incredibly talented industry veterans from around the world.\r\n- Treated with the same level of respect regardless of your internal rank or title. \r\n- Everyone, again regardless of rank, has the same ability to push through organisational reform and change.\r\n- Represent a product and company that the market is genuinely excited to learn more about.", "cons": "- Sometimes easy to forget to switch off from work in the evenings.\r\n- Sales & marketing need to be better aligned. Progress is being made but there is still room for improvement."}, {"review_title": "Truly a global company!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "16 May 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Team members located in almost every country! This is a big appeal if you're like me and consider yourself a citizen of the world, and value cross cultural relationships.\r\n\r\nEveryone works remotely! I get out of bed and I'm at work at home. No more commuting in heavy traffic, no more unnecessary distractions, the company saves money by avoiding costly office expenses, all the employees gather once a year in a different global location.\r\n\r\nEveryone contributes! Transparency value means even if you're not technical, you get to participate.", "cons": "None as of now, and I don't expect there to be any that can't be resolved!"}, {"review_title": "Great Company -- Lives Its Values", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "6 Feb 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "I am a nonbinary and neurodivergent person. When I first saw GitLab's handbook sections on gender identity and neurodiversity, I was a bit skeptical. During my interview process, everyone was respectful of my pronouns, and was very understanding about how my neurodiversity impacted my interview process. Everyone was really friendly, responsive, and inclusive. \r\n\r\nThere is no pressure to keep your 'butt in your seat' unlike at some remote jobs where you're remote, but still expected to be chained to your desk from 9-5. I am able to walk my dog, go run errands, or even just go talk to my family or do laundry in the middle of the day without feeling like I have to constantly justify where I am every second of the day. They care about results, not about how much time you're at your desk. \r\n\r\nThe time off policy is no joke. You don't have to beg for time off. It's all easy and integrated right into Slack with PTO Ninja. All you have to do is coordinate with your team. You don't have to plead for time off, or juggle. Just let someone know, make a PTO Ninja event, and you're all set. Amazing. \r\n\r\nIf you're just running out for a bit to get errands done or go somewhere with family/friends, they trust you'll get your work done and you can schedule your day as you see fit. Again, it's about results. Some days you may work 4 hours, some days you may work 10. Flexibility to structure your time how you want is huge. \r\n\r\nYou're surrounded by motivated, driven people. If you are also motivated and driven, you'll thrive here. Overall, I love being a part of this team.", "cons": "The hiring process takes a long time. It took 6 weeks from start to finish for me to be fully hired from screening to offer. If you need a job ASAP, worth noting."}], [{"review_title": "Excited to be a GitLabber!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "26 Jun 2019", "job_title": "Data Analyst, Finance in Raleigh, NC", "duration": "N/A", "pros": "GitLab's values of diversity, transparency, and openness are inspiring and the company lives by those values. The company has built a culture and infrastructure that makes remote work very effective and enjoyable. The company is very organized from the recruitment process to on-boarding to managing work flow. GitLab's single application for the entire DevOps lifecycle is a disruptive product that really sells itself. The company is scaling and it is a tremendous opportunity to be a part of something special.", "cons": "I do not have any cons at this time."}, {"review_title": "Sucks if you're a woman", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "25 Apr 2020", "job_title": "Software Engineer", "duration": "N/A", "pros": "* Remote\r\n* Flexible vacation policy", "cons": "* The company has zero diversity. Women rarely speak up, rarely get promoted, and as you can see on the team page, rarely make it to the top. Women have left after being harassed by their managers, and no one's done anything about it. \r\n* Compensation is definitely below the normal, as much as they claim it isn't\r\n* Fast growth is causing a culture shift and competitiveness is becoming the norm - this isn't the GitLab it was years sgo"}, {"review_title": "So Blessed to be at GitLab", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "9 Jul 2019", "job_title": "Senior Security Analyst, Field Security in Austin, TX", "duration": "N/A", "pros": "++++Full Remote Work\r\n++++Encouraged to work around life, not live around work\r\n++++Encourages and celebrates Neuro-diversity\r\n++Unlimited PTO\r\n+Asynchronous Work\r\n+Everything is well documented\r\n+CREDIT (core values)\r\n+High Speed", "cons": "-High Speed (can be painful)\r\n-Fully Remote (limited in person social interactions, no on-site IT support, etc...)\r\n-Extreme ownership (can be uncomfortable if you aren't used to self-management)"}, {"review_title": "Remote-only gem", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "18 Jul 2016", "job_title": "Head of Product in Sausalito, CA", "duration": "N/A", "pros": "One of the best companies I've worked for. I'm working on a fantastic product, doing work I love, with a great team of smart, capable, friendly people. Being remote-only allows a tremendous focus on work-life balance, but is really only the start. The leadership goes beyond to explicitly share a vision for flexibility as seen in the publicly available handbook.", "cons": "Joining a fully remote workforce can be daunting for some. Dealing with coworkers from all over the world can be challenging since different cultural norms and expectations will arise."}, {"review_title": "An excellent company with an outstanding culture", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "18 Jan 2017", "job_title": "Frontend Engineer in Chanhassen, MN", "duration": "N/A", "pros": "- 100% remote\r\n- a lot of freedom and trust is granted in how you spend your work hours\r\n- great benefits\r\n- a very diverse team of people all over the globe\r\n- (their entire employee handbook is open source and published online - give it a look!)", "cons": "- average to below-average salary\r\n- a lot of responsibility to manage time effectively\r\n- a high bar for hiring due to recent spike in publicity and popularity"}, {"review_title": "Early days - what a radically different approach to work/life balance!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "16 Oct 2019", "job_title": "Solutions Architect in Cardiff, Wales", "duration": "N/A", "pros": "I mean, there are literally so many \"pros\" that it's almost impossible to list them all, but I guess the ones that aren't so easily obvious (in the GitLab handbook!); the team are all really, really lovely, happy to help and very welcoming. You're given a large degree of autonomy, with a simple motto: \"Make GitLab great!\". It's definitely a company that is on the up-and-up.", "cons": "It's the flip-side of some of the pros, really; the fully remote aspect certainly isn't for everyone, as is the expectation to self-motivate and be generally autonomous."}, {"review_title": "Great company to work for", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "21 Nov 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "A fantastic company to work for, full of kind, respectful and genuine people all of whom are always happy to help. \r\n\r\nYou'll meet everyone every nine months or as you wish as there's a financial contribution each time you travel to visit colleagues.", "cons": "The way we work takes some getting used to, you need to be a fast reader as everything is written down. \r\n\r\nThe interview process is long, be patient!"}, {"review_title": "Very transparent, ultimate flexibility, and great company culture", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "1 May 2017", "job_title": "Junior Front End Engineer", "duration": "N/A", "pros": "- Flexibility of working remote\r\n- Freedom to work on features that interest you\r\n- The transparency is amazing\r\n- Diverse and super nice team!\r\n- Solid company values - listed in employee handbook (it's published online!)\r\n- Amazing community of people behind the product\r\n- The company summits are a huge perk!", "cons": "- Have to be able to work on tasks in parallel due to people not always being available\r\n- Often have below-average salaries"}, {"review_title": "Not the usual company", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "3 Oct 2019", "job_title": "Senior Backend Engineer in Geneva", "duration": "N/A", "pros": "* Technical interview: you get a dummy project to work on. As a backend engineer, this is critical.\r\n* 100% Remote work\r\n* Benefits\r\n* Super helpful team members\r\n* Everything is written down. You have traceability and version history of everything. Check the GitLab handbook.\r\n* Dogfooding. GitLab uses GitLab for its day to day activities.\r\n* Cross team collaboration", "cons": "* Onboarding can be intimidating.\r\n* It takes time to get around how things work and are organised but this is mitigated by the handbook."}, {"review_title": "Great Company", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "17 Feb 2020", "job_title": "Sales Representative", "duration": "N/A", "pros": "Great company to work at, the CEO is still committed to upholding the revolutionary way GitLab does things. Great perks, value alignment, and collaboration.", "cons": "Sometimes the executive team makes rush and not thoroughly thought through decisions that have led to some negative press lately."}], [{"review_title": "Initial Impressions", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "19 Jun 2019", "job_title": "Senior Backend Engineer in Hillsborough, NC", "duration": "N/A", "pros": "I'm very new to GitLab but I'm nothing but impressed so far.  Here are some of my Pros for working at GitLab:\r\n- Full-time Remote (Done Right)\r\n- Competitive Salaries\r\n- Good Benefits including funds for setting up your remote workspace or co-working space.\r\n- Work-life balance", "cons": "Hard to speak about cons since I just started but the distributed nature of the teams, across time zones, will take some getting used to.  I love the idea though so it's not much of a con."}, {"review_title": "GitLab pays old employees less than recent hires", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "18 Nov 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- Open Source product\r\n- Big ambitious clients\r\n- Interesting challenges\r\n- Work from home\r\n- Unlimited vacations", "cons": "- Culture is suffering a lot as the company grows.\r\n\r\n- Non-Americans are second-class employees, as C-level is culturally biassed to the US\r\n\r\n- There is no real effort in diversity, there is only the \"American biassed version of diversity\": we only need to be a diverse company in the lower ranks and as a way to save on income.\r\n\r\n- In many locations, GitLab pays below the average, doesn't provide local market benefits like health care and pension plans, and only does that on places where they are required by law (with the US bias in trying to provide better benefits for their American peers).\r\n\r\n- People Ops department is 100% focused on hiring, 0% focused on retaining talent. They very often don't reply to the hard questions or to the request for transparency.\r\n\r\n- GitLab is a less transparent company than it used to be (that's C-Level to blame).\r\n\r\n- The way income changes are being rolled out is super shady. New hires are going to earn more than existing and long-term employees, with the excuse of new job descriptions and new job requirements. Change for existing employees is also being delayed with useless bureaucracy to save on a few pennies, and many are receiving way bellow they should because of previous mismanagement."}, {"review_title": "Best company I have ever had the privilege of working for.", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "16 May 2020", "job_title": "Director, Channel Sales", "duration": "N/A", "pros": "Culture is something a lot of companies give lip service about...at GitLab, it’s everything. From the way we conduct calls, to how we communicate, to how we treat each other. I truly feel that I’ve hit the employment jackpot and I’m loving being a part of it all.", "cons": "Zero, zip, zilch, nada. Best company ever."}, {"review_title": "Excited to contribute to the team!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "31 Jul 2019", "job_title": "Sale Operations", "duration": "N/A", "pros": "Working remote, competitive compensation, opportunity to contribute and grow within a great company. Open source. Transparent communication. Strong core values that aren't just buzzwords. Focused on results and impact. This company values the people that work here. Recognition and thanks are common and genuine. \r\n\r\nInterview process was fast and transparent. Great people all across the company, folks are excited to work here.", "cons": "None so far - very excited to be a part of the team. Will update in the future if necessary."}, {"review_title": "Fantastic culture, transparency and lives up to their values!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "16 Nov 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Communication internally is fantastic, as this is  a remote first organisation, they have ensured the right channels are available to allow transparency, a direct but kind approach and a lot of collaboration. \r\nBrilliant products to work on \r\nKnowledge sharing \r\nDiversity \r\nLeading/ Mentoring Management style\r\nFlexible approach\r\nI can go on here the whole day...", "cons": "If you are a non engineer, you'll need to get Tech savvy and fast :-)"}, {"review_title": "Awesome and Innovative Company", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "10 Jun 2019", "job_title": "Technical Account Manager in Sydney", "duration": "N/A", "pros": "- Fully transparent and open in almost everything\r\n- Great flexibility in defining  what work and life balance should be for everyone\r\n- Fast growing and innovative in providing  one stop shop for complete a DevOps  application.", "cons": "- Fully remote work might not be for everyone but it works great for those who love it (me ! ) as it can be quite addictive."}, {"review_title": "Remote done right", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "1 May 2019", "job_title": "Anonymous Employee in San Diego, CA", "duration": "N/A", "pros": "Emphasis on connecting people to create a coherent organization\r\nHyper-transparency should give a clear view of how the company functions\r\nThe team is amazing", "cons": "It might be difficult to predict how scaling will affect culture given that these inflection points are unknown until they arrive."}, {"review_title": "I Still cannot believe I am working for Gitlab !!!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "5 Jul 2019", "job_title": "Strategic Account Leader in London, England", "duration": "N/A", "pros": "The company is growing at the speed of light !!! You have to keep in mind the company is 100% remote so you will have to adjust.\r\nThe on-boarding is done smoothly and you will get full support if you need too.\r\nThe product is amazing + market disruptor and this is the reason why they are growing fast.", "cons": "none at the moment..."}, {"review_title": "First days but so far what an amazing onboarding", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "7 Aug 2019", "job_title": "Backend Engineer in Amsterdam", "duration": "N/A", "pros": "The company and your colleagues take care of your soft landing into the company (and the remote work) with simple things like:\r\n* Calls with your manager and the onboarding buddy.\r\n* Breakout calls\r\n* A self-explained and step by step onboarding (using GitLab).\r\n* And everything is documented, so you can learn at your own pace.", "cons": "Partially doing single sign on, which implies a lot of work to setup online accounts on your first days."}, {"review_title": "My Dream Job", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "8 Nov 2019", "job_title": "Sales Development Representative in Atlanta, GA", "duration": "N/A", "pros": "The handbook and GitLab values are consistently mirrored in all of the interactions I've had via zoom meetings, which is AMAZING! From the interview conversation, coffee chats, and onboarding training. GitLab provides unlimited opportunities to reach your self development goals in every aspect. The culture is driven by our values and it saves everyone from the mundane office complaints.", "cons": "No cons so far and I don't expect any!"}], [{"review_title": "GitLab is Amazing", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "13 Feb 2020", "job_title": "Security Engineer in San Diego, CA", "duration": "N/A", "pros": "The transparency at GitLab is shocking. I have never experienced something like this with former employers. I knew more about the workings of the company before I started than with any other company. Also the embodiment of of GitLab's values is prevalent and apparent among most everyone.", "cons": "I spend more time searching written documentation than at other companies, but I think it's a good thing in a way."}, {"review_title": "The right way to do remote", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "24 Jul 2019", "job_title": "Developer", "duration": "N/A", "pros": "I joined GitLab recently and I am very impressed by this organization. Processes are very clear and documented and there is always a desire to improve. \r\n\r\nPeople are extremely helpful and kind, it is very welcoming.", "cons": "Working at GitLab requires personal discipline and responsibility, so I would suggest more mature professionals apply."}, {"review_title": "Fantastic Company and with an honest/transparent hiring process", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "14 Jan 2020", "job_title": "Sales Development Representative in Durham, NC", "duration": "N/A", "pros": "GitLab is doing really important work in tech. You have the opportunity to help shape the future of the DevOps, which is applicable to countless fields. The company culture is really transparent, which is evident in the online handbook.", "cons": "Working fully remote isn't for everyone. You need to be self-motivated and willing to work in a non-traditional work environment."}, {"review_title": "Awesome company with true transparency", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "15 Oct 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- Everything is documented, easy to get on board\r\n- Everyone is very kind and willing to help out \r\n- Massive growth over the past years which leads to great dynamics \r\n- All-remote and flexible working hours which leads to great work-life balance.", "cons": "Some growth pains as a lot of people recently joined, things can be chaotic and unstructured. Timezones can be tough too. But all not a real showstopper."}, {"review_title": "A special place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "10 Jan 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "All remote, fully distributed, remote by default\r\nExciting opportunities to grow, literally anyone can contribute to anything\r\nGreat engagement from community and customers \r\nProduct led company\r\nCreating the future or remote work everyday", "cons": "No 401k matching\r\nNo health/fitness expensing"}, {"review_title": "Couldn't be happier", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Great people, very friendly\r\nLives up to the transparency name in everything they do\r\nEveryone has a voice\r\nTruly remote\r\nGreat trips to fun places\r\nGet rewarded for the hard work you do\r\nGreat leadership\r\nHappier more satisfied life in general", "cons": "Slightly lower salary than normal"}, {"review_title": "Truly different than their peers", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "9 Jun 2020", "job_title": "Director of Security Compliance", "duration": "N/A", "pros": "- CEO and Executive Leadership are actively engaged, accessible and approachable\r\n- Everyone really can contribute! (sometimes also a con)\r\n- Everyone is remote so there is no bias exhibited against remote staff\r\n- Personal/Family time is prioritized and exemplified y the top down", "cons": "- Everyone really can contribute, which sometimes leads to initiatives getting bogged down\r\n- If you don't like working remote, this is not the place for you"}, {"review_title": "Onboarding", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "5 Sept 2019", "job_title": "Sales Development Representative", "duration": "N/A", "pros": "- Thorough interview process giving me a great understanding of the job at hand\r\n- On-boarding is very thorough and allows me to learn at a pace that I am able to grasp all the information\r\n- The culture and people are so amazing, unlike anything I have ever seen before", "cons": "- I haven't experienced many cons yet as I am new"}, {"review_title": "Great company with great opportunity", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "17 May 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Strong shared product vision\r\nFull Remote is the future of work\r\nHaving all employees use GitLab internally is great for productivity as well as \"Drinking your own wine\"", "cons": "Not necessarily a con, but the company is growing at light speed, so lots of new people joining every week"}, {"review_title": "Amazing company!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "23 Jan 2020", "job_title": "SDR in Melbourne", "duration": "N/A", "pros": "- Great culture that is extremely transparent.\r\n- Friendly and approachable team.\r\n- You get to work with talented people from all over the world.\r\n- 100% remote, offers fantastic work/ life balance.\r\n- Everything is well documented so you can learn at your own pace.\r\n- Lots of learning opportunities.", "cons": "None that I have experienced so far."}], [{"review_title": "I feel unbelievably lucky to be here", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "2 Jan 2020", "job_title": "Sales Manager", "duration": "N/A", "pros": "The people are great, GitLab makes a point of hiring good humans and it shows\r\nYou're trusted to do your job in the most productive way for you\r\nThe company goes out of its way to make sure you don't feel alone as a remote worker", "cons": "None that I can think of right now"}, {"review_title": "Rather revolutionary if you ask me", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "22 May 2019", "job_title": "Senior Site Reliability Engineer in Austin, TX", "duration": "N/A", "pros": "Excellent colleagues.\r\n\r\nVery transparent and open.\r\n\r\nVery welcoming.", "cons": "I have not been an employee long enough to knowledgeably comment on this."}, {"review_title": "Great Company with Results-Driven Mentality", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "22 May 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Colleagues and leadership are helpful from the start. Onboarding is very specific, therefore less likely to get stuck. Remote working = flexibility to do more of what is important to you. Employees are eager to get to know you.", "cons": "Remote working can be an adjustment - meaning it's easy to work through lunch and easier to caught up in a task."}, {"review_title": "Best place I've ever worked", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "9 Oct 2019", "job_title": "Candidate Experience Specialist", "duration": "N/A", "pros": "Remote work, async communication, fantastic PTO policy, opportunities for career growth, and transparency!", "cons": "Some orgs have less work/life balance, it's something they're working on."}, {"review_title": "Outstanding employer and team", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "2 Sept 2019", "job_title": "Engineer", "duration": "N/A", "pros": "Interesting work, competitive salary, fantastic colleagues and a company that really walks the walk when it comes to openness and clear process. All of GitLab's HR and process documents are online and followed. Any employee and contribute to change within the company. I hope more employers follow GitLab's example.", "cons": "Heavy workload, but clearly communicated and manageable."}, {"review_title": "GitLab is the place to be!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "16 May 2019", "job_title": "Product Manager", "duration": "N/A", "pros": "- Company Culture\r\n- Remote work style\r\n- Great values\r\n- High standards", "cons": "- Interview process can be long\r\n- Diversity, one of few females on my team"}, {"review_title": "Interview Process - Remote EMEA", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "8 Oct 2019", "job_title": "Marketing Manager in Dublin, Dublin", "duration": "N/A", "pros": "Quick and Professional Process\r\nVery friendly and approachable team\r\nOpen and Transparent\r\nBig focus on values and ethics", "cons": "Compensation could be higher in this marketplace but they are looking at that. Also creating Ireland as an entity in coming down the lines which is a great move!"}, {"review_title": "Great Company!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "16 Oct 2019", "job_title": "Customer Reference Manager in Atlanta, GA", "duration": "N/A", "pros": "Full time work from home, competitive pay, great product, great people.  The coffee chats and breakout meetings help you to not feel isolated working from home, everyone is very friendly and helpful", "cons": "None thus far, except the extensive interview process!"}, {"review_title": "Aligns with my values", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "16 Oct 2019", "job_title": "Recruiting", "duration": "N/A", "pros": "There are quite a number of pros about working at GitLab but a major one for me is that I'm closer to my family.   I also like the fact that there are real opportunities for growth within the company.", "cons": "This isn't a con as such but it's up to you as an individual to manage your time wisely."}, {"review_title": "Dream Job", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "7 Mar 2020", "job_title": "Senior Frontend Engineer in Zürich", "duration": "N/A", "pros": "- Awesome people\n- VERY flexible schedule\n- Challenging job\n- Remote work\n- Access to resources\n- Great benefits\n- Good salary\n\nFor the first time in my life, I think I found a job where I could work until my pension (still have 35 years to work 🤣)", "cons": "None so far, only positive vibes."}], [{"review_title": "Great Company, Great People, Great Future", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "14 Mar 2017", "job_title": "Sales", "duration": "N/A", "pros": "Best company and best growth opportunity I have seen in many years\r\nGreat product and product direction\r\nAmazingly open/transparent \r\n100% Remote company\r\nToo many good things to list", "cons": "Comp plan could be more competitive with market rates."}, {"review_title": "Incredible Opportunity", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "4 Nov 2019", "job_title": "Solution Architect", "duration": "N/A", "pros": "- Company continually lives up to CREDIT values\r\n\r\n- Transparency: how many other companies are there where the community can see full, collaborative conversations between employees at all levels of the organization?\r\n\r\n-Contribute is a huge perk! \r\n\r\n- The product itself is great, and growing rapidly", "cons": "- Remote work isn't for everyone. \r\n\r\n- Unsure of raise/promotion structure"}, {"review_title": "Smooth Recruiting and Onboarding Process", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "14 Jun 2019", "job_title": "Support Engineer in Austin, TX", "duration": "N/A", "pros": "- Transparency is unmatched\r\n- Great benefits package\r\n- Remote work only, built into the company and culture\r\n- Solid set of core values that is clearly lived by each person in the organization\r\n- and much more", "cons": "- Haven't found much in the way of cons yet, will update if I run into any!"}, {"review_title": "Great place to work.  Great software technology and great atmosphere!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "5 Aug 2019", "job_title": "Sales Manager in Washington, DC", "duration": "N/A", "pros": "100% of workforce is remote.  No offices with over 700 employees and growing.", "cons": "No water cooler to gossip around"}, {"review_title": "A feeling you wouldn't get on many other places", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "11 Nov 2019", "job_title": "Senior Backend Engineer", "duration": "N/A", "pros": "From your first moment everyone makes you feel at home. Everything is well documented and structured and if there's something unclear there are always tons of people willing to help.", "cons": "Sometimes timezone differences can be non-optimal but since most of the work is asynchronous most of the time it's a non-issue."}, {"review_title": "Diversity and Transparency", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "12 Jun 2019", "job_title": "Billing Specialist in Islamabad, Islamabad", "duration": "N/A", "pros": "All remote, Diverse culture, Transperancy.", "cons": "Not really as it helps to spend more time with your family and you can take a shared space if you need to socialize and work both at the same time."}, {"review_title": "Great so far", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "17 Mar 2020", "job_title": "Inside Sales Account Executive in Ashburn, VA", "duration": "N/A", "pros": "100% Remote work with a focus on results over hours.\r\nAttention to details and focus on documentation\r\nEven though it is 100% remote, I find people very accessible.\r\nManagement focus on results keep them away from micro-managing", "cons": "Not really a con, but there is an adjustment to working remote if you haven't been."}, {"review_title": "The GitLab life is for for me", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "4 Jul 2019", "job_title": "Support Engineer in Cape Town", "duration": "N/A", "pros": "Incredibly helpful colleagues\r\nCulture and values owned by each employee\r\nStrong agency throughout the ranks\r\nA culture of appreciation (\"Thank You's\" flow freely)\r\nHighly refined (yet still work in progress) remote work model\r\nProcesses are living constructs - constantly being revised and experimented on", "cons": "I have no cons at this time"}, {"review_title": "Impressive", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "29 Jul 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "It's a pleasure to work with both talented and helpful colleagues.  Remote is in the DNA of the company and makes it super efficient. Last but not least, CEO has a real vision.", "cons": "Company is growing fast. Not possible to get a contract from some countries."}, {"review_title": "You want to work here", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "1 Jun 2017", "job_title": "Sales", "duration": "N/A", "pros": "-Amazing product\r\n-Great Co-Workers\r\n-Fun culture\r\n-Exciting time and place in the company's history\r\n-Excellent perks and benefits", "cons": "-No free snacks (everybody works from home)"}], [{"review_title": "Amazing!!!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Where do I begin?! I'm a new hire but everything so far has been AMAZING! All the prior reviews about the culture, transparency, and team are NOT wrong. Everyone I have met so far has been nothing but nice!\n\n-Transparency\n-Culture\n-Team/People \n-100% Remote\n- Pay", "cons": "Nothing so far but Glassdoor requires a 5 word minimum for Cons."}, {"review_title": "In Awe!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "15 Jul 2019", "job_title": "Sales and Business Development Representative in Redding, CA", "duration": "N/A", "pros": "The company culture is unlike anything I have ever experienced. We are fully remote , yet the buy-in is palpable. No company is perfect but dang, it's pretty close!", "cons": "Not really a con, but it is taking time to navigate working in a remote environment."}, {"review_title": "Excellent Hiring Process", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "16 Oct 2019", "job_title": "Manager", "duration": "N/A", "pros": "The hiring process was extremely transparent. I had clear, consistent communication, and was told specific dates to hear next steps.", "cons": "If I had not read the handbook beforehand I may have been confused about a zoom issue I had."}, {"review_title": "Great company, great people, great culture!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "20 Nov 2019", "job_title": "Support Agent (APAC) in Negombo", "duration": "N/A", "pros": "Work from anywhere.\r\nGood compensation for the role.\r\nHoard of benefits for the employees.\r\nGreat policy on time off.\r\nSupportive and positive colleagues and management.\r\nFocuses on employee development.\r\nRespects employees' learning curve.\r\nGreat company culture.\r\nTransparent as a company could be.", "cons": "Wish I could meet the amazing people I work with more often."}, {"review_title": "Off to a great start", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "24 May 2019", "job_title": "Senior Frontend Engineer", "duration": "N/A", "pros": "The people are amazingly friendly and helpful. Gitlab's processes and documentation are the best I've ever seen.", "cons": "It can be a bit overwhelming. I am a huge fan of remote work, but this level of communication and documentation may not be for everyone. (and that's ok!)"}, {"review_title": "Great Company!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "7 Aug 2019", "job_title": "Senior Backend Engineer", "duration": "N/A", "pros": "Remote work that does not lose the communication and interaction. Great culture. Everyone's helpful and supportive.", "cons": "Timezone difference if you're in the APAC region can be a bit challenging but it's a minor thing. The company's doing its best to remedy this issue."}, {"review_title": "Fast-paced, remote workforce focusing on exciting a product", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "2 Dec 2019", "job_title": "Engineering Manager in Eugene, OR", "duration": "N/A", "pros": "100% remote\r\nOpen-source, cutting edge product\r\nInclusive environment - lots of focus on diversity\r\nThorough on-boarding\r\nAll levels of the company are amazingly transparent\r\nGrowing VERY fast", "cons": "Long interviewing process\r\nNot a good option for someone who isn't self-organized \r\nGrowing VERY fast"}, {"review_title": "Amazing place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "11 Dec 2017", "job_title": "Junior Build Engineer in Cochin", "duration": "N/A", "pros": "* Commitment towards transparency - Almost everything is public in the handbook\r\n* Attitude towards FOSS\r\n* Unlimited Paid Time Off\r\n* Awesome work culture", "cons": "* Compensation, when compared to peers may be lesser in some places."}, {"review_title": "Making the GitLab Magic", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "30 Oct 2019", "job_title": "Senior Product Manager", "duration": "N/A", "pros": "- Focus on Outcomes not Output\r\n- Dedicated delivery teams\r\n- Strong Product Leadership\r\n- Strong Product Manager career growth program", "cons": "- Not for folks who aren't self motivated\r\n- Not for folks who are afraid to ask questions"}, {"review_title": "a company that walks the talk", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "18 May 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "interesting and challenging work, people, culture, pay, time off, benefits, equipment, helpfulness of other employees, efficient and effective meetings, thoughtful management", "cons": "haven't noticed any cons yet"}], [{"review_title": "Great Opportunity, Great Company, and Great Benefits", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "29 Jul 2019", "job_title": "Commercial SDR Manager", "duration": "N/A", "pros": "Excellent hiring process.\r\nGreat compensation and benefits.\r\nAbility to work remote\r\nChallenging job where you are always learning. \r\nAmazing people.", "cons": "I have only been here for a short time and so far I have not found any cons."}, {"review_title": "Great place to learn and grow!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "15 Aug 2019", "job_title": "Sales", "duration": "N/A", "pros": "Everything you can ever want is online. It is a fully remote company, so sales enablement is top notch. Everyone is extremely helpful.", "cons": "None so far. I like the \"no water cooler\" comment below."}, {"review_title": "Well organized, transparent, friendly and quality-focused", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "6 Dec 2019", "job_title": "Senior Backend Engineer", "duration": "N/A", "pros": "Great impression so far. The company is extremely well organized and transparent in terms of processes and management.\r\n\r\nFriendly environment full of diverse, smart and helpful people. Very clear attention to details and quality.", "cons": "Nothing so far to be honest."}, {"review_title": "Absolutely incredible company, proud to be apart of the team.", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "4 Mar 2020", "job_title": "People Experience Coordinator in Cape Town", "duration": "N/A", "pros": "* Amazing values, which I operate on a personal level > mainly collaboration and transparency. \r\n*Working remotely\r\n* Competitive salary\r\n* Amazing, helpful team", "cons": "* You need to a self-organized and disciplined person, as you work remotely."}, {"review_title": "Awesome cutting-edge software company!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "8 May 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Really cool cutting-edge cloud-based software company! Great culture! Awesome company values! Great compensation and benefits! I can't say enough! GitLab keeps growing and growing and I'm excited about the present and future with them!", "cons": "I really can't think of any."}, {"review_title": "Awesome company with incredible people and values!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "21 Aug 2019", "job_title": "SDR in Portland, OR", "duration": "N/A", "pros": "Everything! Fully remote philosophy with incredible people,  values and documentation processes.  Let me tell you, I am drinkin the Kool-Aid.", "cons": "I'm obsessed with this company!"}, {"review_title": "Strong culture in a fast-paced, collaborative environment", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "18 Sept 2019", "job_title": "Account Executive in Steamboat Springs, CO", "duration": "N/A", "pros": "transparency, efficiency, results and support from the entire org", "cons": "process changes often and requires constant work to stay up to speed"}, {"review_title": "Life at GitLab", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "9 Dec 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Culture, Diversity, Iteration & Team", "cons": "None as of now. But Glassdoor wants 5 words for cons forcefully :D"}, {"review_title": "Exciting Opportunity at GitLab", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "13 May 2019", "job_title": "Solutions Architect", "duration": "N/A", "pros": "Great People who are highly motivated\r\nWork Remote\r\nFast Growing Company\r\nExcellent Product", "cons": "Fast Growth can put culture at risk"}, {"review_title": "Thoughtful and Friendly", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "2 Nov 2019", "job_title": "Backend Engineer", "duration": "N/A", "pros": "Extensive and up to date documentation for essentially everything.", "cons": "Getting out of the the house and interaction with non-roommate non-family people, is a manual operation now."}], [{"review_title": "Currently at GitLab - I love it.", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "18 Jul 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- Brilliant team\r\n- Fast-moving product\r\n- Friendly people\r\n- Great community\r\n- Everyone is remote\r\n- Very, very transparent.", "cons": "- With any fast growing company, sometimes it can be stressful at such a high pace."}, {"review_title": "Best place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Great people, growing fast, exciting challenges, be self sufficient", "cons": "There are no cons to working at GitLab"}, {"review_title": "The company with great culture.", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "15 Mar 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "1. Supportive team members and manager.\r\n2. Great benefits, including unlimited PTO, flexible working hours, stock options...\r\n3. Transparent communication.\r\n4. Working from anywhere.\r\n5. Great company culture.", "cons": "1. Only can meet your colleagues once a year."}, {"review_title": "The people, culture, and product are as great as advertised!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "10 Jul 2019", "job_title": "Senior Product Designer in Amsterdam", "duration": "N/A", "pros": "Flexible schedule, trusting, great product, straight forward expectations, and a realistic ramp up time.", "cons": "None that I can think of"}, {"review_title": "Good so far", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "24 Jul 2019", "job_title": "Web Designer/Developer", "duration": "N/A", "pros": "Everyone has been friendly and welcoming. It's nice to be at a fully remote company with so much transparency and good core values.", "cons": "No cons so far but I'm new"}, {"review_title": "So far so good!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "2 Aug 2019", "job_title": "IT Analyst in Newark, DE", "duration": "N/A", "pros": "All remote, company wide transparency, great benefits for US, diverse workforce, can tell your coworkers and leadership actually care.", "cons": "All remote might not be everyone, normal start up problems."}, {"review_title": "Complete Transparency in Action", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "27 Dec 2019", "job_title": "Senior Technical Instructional Designer", "duration": "N/A", "pros": "Love it so far! Everyone is totally transparent and they support full collaboration between all departments so there is no siloing of ideas or functions.", "cons": "None so far. Everything to date has been great."}, {"review_title": "Collaborative Culture", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "4 Feb 2020", "job_title": "Recruiter", "duration": "N/A", "pros": "You are able to get involved in ANYTHING. You are not limited to your team, role or skillset. You are genuinely able to contribute.", "cons": "There are no Cons at this time."}, {"review_title": "A company that lives and breathes their culture!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "26 Feb 2020", "job_title": "People Experience Associate", "duration": "N/A", "pros": "They take the time to make you feel comfortable and apart of the team!", "cons": "I have not found any yet!"}, {"review_title": "Great culture", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "23 Jun 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- Trust based system (no tracking)\r\n- Remote work\r\n-  Open Source\r\n- Able to contribute to product\r\n- Great team", "cons": "- Compensation calculator made no sense\r\n- Micro Management"}], [{"review_title": "Remote Work Done Right", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "12 Aug 2019", "job_title": "SDR Manager in Athens, Attica", "duration": "N/A", "pros": "- Excellent Organisational Structure \r\n- Very Human Approach to Remote Work", "cons": "- None that I can think of"}, {"review_title": "Great organization!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "9 Jul 2019", "job_title": "Federal Solutions Architect in Washington, DC", "duration": "N/A", "pros": "Well organized, lots of communication and transparency.  Growing company with a solid vision and the leadership to execute.", "cons": "No cons that I have experienced."}, {"review_title": "GitLab isn't too good to be true, it's really that good!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "26 Sept 2019", "job_title": "Senior Executive Business Administrator in Danville, CA", "duration": "N/A", "pros": "Inclusive culture.\r\nTransparency.\r\nA handbook that will become legendary.\r\nAmazing leadership.", "cons": "Nothing to share on this one, no cons so far."}, {"review_title": "Very welcoming, friendly and creative", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "4 Jun 2019", "job_title": "Legal in Minneapolis, MN", "duration": "N/A", "pros": "The people are amazing.  Love being able to work remote.  Nice life balance.", "cons": "Its not really a con but there is a very extensive on-boarding process."}, {"review_title": "Commercial SDR", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "25 Nov 2019", "job_title": "Commercial Sales Representative in Raleigh, NC", "duration": "N/A", "pros": "Benefits kick in on day one, competitive salary, room for career advancement, and great DevOps product.", "cons": "Hard to think of any! I would say remote work may not be for everyone."}, {"review_title": "Collaboration", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "24 Jan 2020", "job_title": "Facilitator/Organizer in Warri, Delta", "duration": "N/A", "pros": "Team work,\nCollaboration,\nGood communication skill,\nRemote,\nVersion control system.", "cons": "Poor time Management,\nLack of communication,\nPrivate,\nThe ability for not saving repo\nLack of team work"}, {"review_title": "Awesome Culture", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "1 May 2019", "job_title": "Manager", "duration": "N/A", "pros": "Strong core values\r\nRemote culture\r\nExtreme transparency\r\nStrong senior leadership", "cons": "Remote onboarding is time intensive\r\nLimited opportunities to meet with team members in person"}, {"review_title": "Great company!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "5 Sept 2019", "job_title": "Senior Product Designer in Roswell, GA", "duration": "N/A", "pros": "Friendly, helpful people, great culture and well documented policies and procedures. Amazing product as well!", "cons": "None that I have seen!"}, {"review_title": "A place that lives its values - not just speaks them", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "8 Oct 2019", "job_title": "Federal Solutions Architect in Greenville, SC", "duration": "N/A", "pros": "supportive of employees - transparent -competitive pay", "cons": "none so far - they hare very open"}, {"review_title": "Frontend Lead", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "13 Nov 2017", "job_title": "Frontend Lead in Washington, DC", "duration": "N/A", "pros": "Work from home, everyone is friendly and understanding, work life balance.", "cons": "there are no cons to working at GitLab"}], [{"review_title": "Amazing company!!!!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "20 Jun 2019", "job_title": "SDR in Yuma, AZ", "duration": "N/A", "pros": "Work remote, great people, up-beat geniune culture, excellent benefits, employer provides everything you need to be successful. Transparency!", "cons": "At this point I don't have any cons to share."}, {"review_title": "Awesome start!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "7 Oct 2019", "job_title": "Senior Sal in San Francisco, CA", "duration": "N/A", "pros": "Thus far the culture and vibe has been fantastic !  Can't wait to hit the ground running!", "cons": "None .  So far so good."}, {"review_title": "Amazing workplace!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "21 May 2019", "job_title": "Backend Engineer in Mumbai", "duration": "N/A", "pros": "Flexible work hours\r\nHigh Quality and efficient team\r\nEverything you need to know is documented!", "cons": "Work only if you enjoy a remote (virtual) setup!"}, {"review_title": "Excellent Place to Work For", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "29 Jul 2019", "job_title": "Support Engineer in San Antonio, TX", "duration": "N/A", "pros": "Unlimited vacation time, and no commute", "cons": "The benefits process during the initial start was delayed and a bit disorganized."}, {"review_title": "A Great Company", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "5 Sept 2019", "job_title": "Support Agent", "duration": "N/A", "pros": "Fully remote\r\nUnlimited PTO\r\nGreat Management\r\nGreat co-workers", "cons": "Fully remote positions require a very self driven individual - you must be a self director."}, {"review_title": "Great company!", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "5 Oct 2018", "job_title": "Developer Advocate in Belgrade, Central Serbia", "duration": "N/A", "pros": "A lot of freedom. Great CEO!", "cons": "A lot of freedom. Lack of clarity in Marketing Department (thing should get better now I believe)"}, {"review_title": "Great Compant, Very Supportive", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "29 May 2019", "job_title": "Implementation Engineer in Rochester, NY", "duration": "N/A", "pros": "Work from home, great vacation policy and benefits. Awesome support from HR and management!", "cons": "If i find one I'll add it here later :-)"}, {"review_title": "Amazing company and people!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "16 Dec 2019", "job_title": "Senior Backend Engineer", "duration": "N/A", "pros": "Remote work, async communications, transparent company.\r\nEveryone is really friendly.\r\nThe handbook is an important part of the company's DNA.", "cons": "None. So far everything is great."}, {"review_title": "A company unlike any other I have seen!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "21 Dec 2019", "job_title": "IT Analyst", "duration": "N/A", "pros": "Fully remote, Great perks, Amazing culture, very competitive salary", "cons": "No cons as of now"}, {"review_title": "Thrilled to be a contributing employee @GitLab!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "5 Jul 2019", "job_title": "Public Sector Inside Sales Representative in Washington, DC", "duration": "N/A", "pros": "Transparent.  Customer Focused. 100% Remote.", "cons": "Have not found one yet. :-)"}], [{"review_title": "Best Job I Ever Had", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "4 Jun 2019", "job_title": "Data Analyst", "duration": "N/A", "pros": "Company is headed in a really good direction.", "cons": "Things are moving very quickly"}, {"review_title": "Great People", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "31 May 2019", "job_title": "Sales Development in Nashville, TN", "duration": "N/A", "pros": "Great Work life balance and benefits. Awesome people to work for and with", "cons": "Long interview process, onboarding,"}, {"review_title": "Excellent company and very good people", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "22 Jul 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Lovely and fantastic atmosphere with perks", "cons": "No cons at all excellent company"}, {"review_title": "Great experience !!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "5 Sept 2019", "job_title": "Technical Accounting Manager in Chennai", "duration": "N/A", "pros": "Working from remote location with flexibility in work timings", "cons": "None so far, good experience"}, {"review_title": "True to their Values", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "6 Jan 2020", "job_title": "Solution Architect in Chicago, IL", "duration": "N/A", "pros": "Extremely transparent and easy to see what you're joining.", "cons": "None that I can think of at this time"}, {"review_title": "Great Experience", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "2 Mar 2020", "job_title": "Community Advocate", "duration": "N/A", "pros": "All remote and transparent culture", "cons": "Might be not easy for people who like office environment"}, {"review_title": "Very welcoming", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "21 Aug 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "great work atmosphere \r\nvery friendly colleagues \r\nremote work", "cons": "Cannot think of any so far!"}, {"review_title": "Amazing Company", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "3 Sept 2019", "job_title": "Candidate Experience Specialist", "duration": "N/A", "pros": "Remote \r\nGreat incentives and perks\r\nGreat Health Insurance Plan \r\nVery Welcoming", "cons": "Nothing as of yet"}, {"review_title": "Manager", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "29 Oct 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Culture, remote, fun, tons of learning opportunities!", "cons": "Below average base pay for some roles"}, {"review_title": "Great company", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "30 Dec 2019", "job_title": "Junior Data Analyst", "duration": "N/A", "pros": "Everything documented in the company handbook\r\nAlmost all the issues are open sourced\r\nGreat coworkers", "cons": "So far I have none."}], [{"review_title": "Great hiring process", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "11 Sept 2019", "job_title": "Senior Front End Engineer in Budapest", "duration": "N/A", "pros": "100% remote\r\nKind and welcoming environment\r\nCompetitive salary\r\nLots of talented people", "cons": "100% remote is not for everyone"}, {"review_title": "Senior Product Marketing Manager", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "28 Oct 2019", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Remote, friendly culture, thriving industry, demanding and tolerante expectations.", "cons": "Remote can be hard sometimes."}, {"review_title": "too internally focused", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "17 Mar 2020", "job_title": "Sales Representative", "duration": "N/A", "pros": "excited to join the team and grow", "cons": "no time for new customers"}, {"review_title": "Amazing!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Remote work and less interruptions from colleagues.", "cons": "No face to face contact."}, {"review_title": "GitLab", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "7 Sept 2019", "job_title": "Junior Community Advocate in Belgrade, Central Serbia", "duration": "N/A", "pros": "Great culture and values, flexibility, remote", "cons": "Unable to hire from many locations"}]]