[[{"review_title": "Unique company - successful financially and takes good care of its people", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "26 Jan 2023", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "I like working here. It’s successful financially and thus relatively stable and can make long-term decisions. It does interesting and meaningful things for its customers, and I think the company takes good care of its people.", "cons": "Colleagues are distributed across several timezones, mostly Europe to Asia, and that means lots of video calls."}, {"review_title": "A bit of a mess", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "18 Dec 2022", "job_title": "Individual Contributor", "duration": "N/A", "pros": "The people here are great. No egos, everyone is friendly, willing to share info/help out. Our offices are also in good locations, so fairly easy to get in and out of work. And the work is good - strong company mission everyone can get behind.", "cons": "The acquisition by Kape has been poorly managed. Don't think they hired a change or M&A consultant and tried to do everything internally which has meant a lot of crossed wires and lack of clarity. Benefits are so-so. Only 1 day WFH, no standard tech company benefits like free lunches, dental, merch, etc. Bonuses are usually pretty subpar too (annual, not quarterly)"}, {"review_title": "Unsure", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "1 Sept 2022", "job_title": "Talent Acquisition Coordinator", "duration": "N/A", "pros": "Culture, work life balance, Pantry", "cons": "I do not wish to comment"}, {"review_title": "Great so far", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "29 Nov 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "ExpressVPN has a great company mission, and the people I've had the opportunity to work with have all been fantastic. There is a culture of cross-team collaboration, meaning I get to work with people I wouldn't usually and learn immensely from them. Because the company is relatively small (in the grand scheme of things), it provides flat hierarchy and people feel empowered to speak up, contribute, and make a difference.", "cons": "For a internet/tech company, the benefits aren't super great. There isn't a hybrid working structure (only one day WFH at the moment), but there are flexible hours and unlimited sick days. Compensation is pretty much mid-market, and health insurance is sufficient but not as comprehensive as previous companies I've worked at. The team I'm on has pretty decent hours though, so I'm not doing a lot of overtime, which is good !"}, {"review_title": "Great people, difficult senior management", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "20 Jan 2022", "job_title": "Anonymous Employee in Singapore", "duration": "N/A", "pros": "You get to work with some really smart, nice and helpful peers.\r\nIts a steep learning curve for some who might not be used to a start-up place and in a good way.", "cons": "LOTS of attrition, lots!\r\nDifficult senior management\r\nInterviews processes are way more complex and difficult than they need to be"}, {"review_title": "Get your roles clarified before taking the offer", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "14 Mar 2022", "job_title": "QA Manager", "duration": "N/A", "pros": "- Great team, very international, some intelligent people", "cons": "- No peace of mind.\r\n- No proper understanding what needs to be achieved and how."}, {"review_title": "A place to drive change with like minded colleagues", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "6 Aug 2021", "job_title": "Head of IT in Singapore", "duration": "N/A", "pros": "Offers very rewarding work\nGreat colleagues\nClear mission and company goals\nVery profitable\nIdeas and contributions are recognised\nStrong leadership team\nFast growing company with opportunitues to progress your career and even change direction", "cons": "Express VPN are growing quickly - you need to be able to cope with and manage change in your role and the companies requirements. \nSome people will not be able to/want to commit to their role and career - these people will not succeed here - bit if you are committed, smart and want to progress and make a difference, this is the place for you"}, {"review_title": "Great People, culture, feedback driven, overall awesome place to work!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "12 Oct 2021", "job_title": "Operations Manager in Singapore", "duration": "N/A", "pros": "2+ months in to the role.\r\n\r\n- Interactive Interview process\r\n- Detailed in CV deep-dive and experience candidate brings to the table\r\n- Interview process is tailored to bring right people to the org\r\n- Clear communication and expectations\r\n- Flexible work environment \r\n- Work-life balance \r\n- Helpful people around \r\n- Helpful management\r\n- Helpful HR system\r\n- Company management always thinking to make work life to the best\r\n- Feel Productive", "cons": "- None to report so far."}, {"review_title": "Fantastic place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "11 Nov 2021", "job_title": "Content Strategist in Singapore", "duration": "N/A", "pros": "- Great onboarding process\n- Supportive management and colleagues\n- Questions are always welcomed\n- Clear growth paths\n- Mentorship and skills development opportunities", "cons": "I'm a relatively new employee, none to report so far"}, {"review_title": "Great place to work and awesome people!!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "13 Aug 2021", "job_title": "IT Engineering Lead", "duration": "N/A", "pros": "Forward thinking and blameless culture\nGreat vision and product\nOpportunity to make a difference and drive change\nSuper cool and tech minded people\nFreedom to choose your career path and learn new things", "cons": "Not a lot of perks compared to other tech companies but they make it up for it with a generous salary."}], [{"review_title": "I learn something new every day", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "4 May 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "*A really flexible and supportive environment where everyone is encouraged to put their hand up to try new things\n*Co-workers come from diverse backgrounds but everyone is really friendly, smart, and funny\n*An amazing culture of getting things done, effectively and efficiently. It's been really cool to see ideas come to fruition relatively quickly. \n*The environment is super laid-back with lots of flexibility around working hours\n*The brand is well-known globally; it's nice working for a company with great name recognition and prestige within its field", "cons": "*Definitely fewer perks and benefits in comparison to what other tech companies offer"}, {"review_title": "A collaborative environment focused on excellence", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "14 Mar 2021", "job_title": "Talent Acquisition", "duration": "N/A", "pros": "- Great company culture. Everyone is very friendly, welcoming and highly engaged\r\n- Focus on personal and professional growth from day 1\r\n- Senior Leadership are heavily invested and care deeply about your growth and success\r\n- Flexible working environment with a focus on getting important stuff done", "cons": "None to speak of so far."}, {"review_title": "Fantastic Place to Work", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "8 Mar 2021", "job_title": "Marketing Team Member", "duration": "N/A", "pros": "- Positive, collaborative company culture\r\n- Super smart colleagues \r\n- Invested in L&D/training for team members\r\n- Compensation & benefits are fair \r\n- Culture of focusing on getting things done to create impact, no busy work", "cons": "Nil to report at this time."}, {"review_title": "Great company culture", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "12 Jan 2023", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Multinational culture. Flexible working culture and environment", "cons": "my job role was a mismatch, the management should have better communication and expectation on the role they hire with the talent team before they hire someone."}, {"review_title": "WOW", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "21 Jan 2023", "job_title": "Assistant Mentor in Rome", "duration": "N/A", "pros": "Just incredible! Really I can't,", "cons": "I loved it too much."}, {"review_title": "Nice Company", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "26 Dec 2022", "job_title": "Senior Software Engineer", "duration": "N/A", "pros": "Work life balance Friendly and talented colleague", "cons": "Bad compensation compared with FAANG"}, {"review_title": "The best company I've worked for in my career", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "17 Sept 2022", "job_title": "Staff Software Engineer", "duration": "N/A", "pros": "Great, great people, I cannot stress this enough\nA meritocratic environment\nA lot of trust given to the employee and this trust is reciprocated\nEnjoyable work\nLots of opportunity to grow and move upwards or sidewards in your career\nOpen to feedback in all levels of the ladder\nGreat work life balance\nYour colleagues and managers actually care about your overall well being", "cons": "Benefits package isn't standardized across all countries they operate from"}, {"review_title": "Great culture with opportunities to learn and grow", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "25 Jul 2022", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "- Lots of cool projects to get involved with\r\n- Autonomy to get things done\r\n- Collaborative and supportive culture \r\n- Safe environment to make mistakes; focus is on learning from the mistakes and making improvements going forward rather than who actually made it\r\n- Open communication across the company; kept informed on what's going on and there's a big focus on providing feedback at all levels", "cons": "Lack of benefits in the UK but it will likely change at some point as the company establishes itself as an employer in the market. Organisation in the UK is still relatively small and HR team was recently hired locally. Good salary makes up for it."}, {"review_title": "Excellent company", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "8 Oct 2022", "job_title": "Affiliate Manager", "duration": "N/A", "pros": "Constantly learning and developing, with the aim to be the best", "cons": "Fastpaced, high targets, demanding, high pressure"}, {"review_title": "Not perfect, but good", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "12 Jun 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- Good work culture, I've met many people that I respect and enjoy working with here\r\n- Many talented people who care about their work\r\n- The company is profitable, good job security\r\n- You'll be given a chance to step up if you've been performing well", "cons": "As the company is getting bigger, it is starting to get more bureaucratic, more senior management are being hired."}], [{"review_title": "Positive experience", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "22 May 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "-Working with colleagues who are flexible and open to change\r\n-Talented people of different cultures and backgrounds\r\n-Good managers (no micromanagers)\r\n-no politics (amazing!)\r\n-well-stocked pantry\r\n-nice office environment\r\n-autonomy to work\r\n-freedom of speech\r\n-working in an agile, face-paced environment", "cons": "-no major cons as far as now, just that you need to adapt to our unique culture and processes."}, {"review_title": "Avoid like the plague", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "23 Feb 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "I worked with several great people here who were talented, hard working, and driven. They are able to hire some very talented people, but retaining the best ones is where they fail, because leadership is so horrible.", "cons": "ExpressVPN is the worst place I've worked in my entire career. Co-Founder/Co-CEO Peter Burchhardt is a classic psychopath/sociopath. He is horrible and abusive to his employees. If you don't do exactly what he wants and how he wants it done, he first tries to manipulate you to do it his way, and then he yells at you with all sorts of awful things and makes up lies about you. In fact, he tries to manipulate everyone around him. He says he invites open conversation, constructive feedback, etc, but as soon as he receives negative feedback from anyone, he lashes out at them, yells at them, and tries to embarrass them in front of their colleagues. It was awful sitting in meeting after meeting where he tries to publicly tear down a colleague because he doesn't like what they said, or they disagree with him. He's the most verbally abusive individual I've ever worked with. If he wasn't the CEO and co-owner, who also controls HR, he probably would have had many charges of workplace harassment filed against him. I truly believe he'd hurt his company for the benefit of his ego. The good reviews clearly come from people who don't have to work with him regularly or report to him. The other Co-Founder/Co-CEO, Dan Pomerantz, is reasonable by comparison. The attitude from many long time employees at ExpressVPN is Dan and Peter just dictate everything and expect their employees to execute blindly or face consequences. The company has a culture of people making excuses for both co-founders' bad behavior, which just perpetuates Peter's abusive behavior. The overall environment at ExpressVPN is very toxic, with people unwilling to work together, and certain people being nasty to each other. The co-founders also have no idea what direction to take the company and haphazardly move teams around every quarter expecting better results. In 2021 attrition was extremely high. They are also losing market share to competitors. The Kape acquisition was problematic for a lot of employees since Peter and Dan had 100% ownership of the company and didn't grant shares to any employees. That means they profited considerably off of the hard work of their employees, while we were only given a tiny acquisition bonus. If you like being abused, apply for a job here. Otherwise, STAY AWAY."}, {"review_title": "Nice company", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "11 Apr 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Work smart, fast-paced, friendly, productive", "cons": "Can't think of one atm"}, {"review_title": "Best place I've worked", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "8 Oct 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "I'm in Hong Kong and have worked in HK offices of international companies. By comparison, ExpressVPN is a great place to work.\n\n-Good pay and bonuses (average 2-months' salary as year-end bonus, depending on performance)\n-Good work culture: Bosses will find ways around you working overtime whenever possible; minimal micromanaging; strong project management and team structure\n-Good social culture: People here generally love each other as people and tend to hang out after work; generous social event organized by company\n-Growing company. Extremely diverse. Employees are younger on average (typical tech company), if that's your thing.", "cons": "You have to be committed to working on pretty much just one product (VPN)."}, {"review_title": "Ambitious company with good colleagues and prospects", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "11 Nov 2021", "job_title": "Marketing Project Manager", "duration": "N/A", "pros": "- I enjoy the work I do\n- My colleagues are friendly and the atmosphere is very international\n- Low company politics\n- High opportunity for personal growth as long as you put in effort", "cons": "- It's a really high output/fast-paced working environment. Not a downside for me personally, but not suitable everyone. Come here if you're willing to challenge yourself!"}, {"review_title": "The best place I've ever worked!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "27 Jul 2021", "job_title": "Engineering Manager", "duration": "N/A", "pros": "⚫️ Amazing culture. People are great to work with. Smart, friendly, collaborative and fun.\n⚫️ Lots of opportunities for growth. Since I've worked there I've been an engineer on many teams covering both server and client side technologies. I've taken on management responsibilities for a big team of both ICs and managers. I've been deeply involved in hiring. The list goes on.\n⚫️ Dedicated to security and privacy. Thinking about these is part of your daily life.\n⚫️ The company is doing very well and growing fast.\n⚫️ Cool office and lots of good social events!", "cons": "It's hard to think of anything TBH 🤷‍♂️. Sometimes get very busy, but the company is pretty good at helping people not get overloaded."}, {"review_title": "Great people and an exciting industry!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "27 Apr 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "I've worked here for 2 and a half years, leading a team within the marketing department. My co-workers are smart and driven and really great to work with. I appreciate that the company always has my back and is genuinely supportive. The office space is super nice, lovely views, tons of space, lots of free food! Since starting here I have learned a ton about marketing, branding and web development and continue to find new challenges and things to learn every day. There are lots of opportunities to expand your role or try something new and your contributions are fairly recognized. The culture is open, flexible, positive.", "cons": "As we are growing rapidly and expanding in many countries and timezones, it isn't as easy to get to know everyone, although the company really does a great job in trying to encourage this, it still isn't easy to do so."}, {"review_title": "Awesome Tribespeople", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "9 Dec 2021", "job_title": "Tech Ops Supervisor in Hong Kong", "duration": "N/A", "pros": "No politics, Freedom on how you will deliver your goals, People are passionate about privacy and security. As an individual employee, you are valued. Career growth is assured.", "cons": "Can't really advertise that your objective is to help people gain access to blocked content."}, {"review_title": "A comfortable place", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "18 Jan 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "A pleasant, often quiet environment.", "cons": "Don't expect any real progression."}, {"review_title": "Great culture, fast paced and always learning!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "12 May 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- The company never stops! I didn't expect to be kept so busy when moving in-house but ExpressVPN are always innovating and coming up with new ideas and projects to tackle.\r\n- You'll be given a challenge regularly! With such a fast-paced company, you need to be able to keep up and take on new challenges on a very regular basis. This is something I really enjoy. \r\n- The culture here is great. Everyone is super supportive of each other, and there is a great sense of teamwork and friendship that upholds this culture. There is also a huge mix of cultural backgrounds which I love.\r\n- Work-life balance is highly valued and encouraged.", "cons": "- There are many set processes or methods of working within the company which I feel some people can find overwhelming."}], [{"review_title": "Excellent people, product and company", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "11 Aug 2021", "job_title": "Senior Affiliate Manager in London, England", "duration": "N/A", "pros": "Overall, by far the best company I've worked for, with extremely good organisation and a desire to make the everything it does as good as possible. The culture is excellent; everyone is very helpful and friendly and the management team focus on the right things.", "cons": "With a focus on being the best at everything it does, the roles can be quite demanding."}, {"review_title": "Startup with work-life balance", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "13 Apr 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "This is my third job at a startup, and I know lots of people at startups as well. I love the vibe, growth opportunities, ability to have an impact, sharp colleagues, etc. of startups, but usually that also means tons of hypergrowth pressure and long hours. ExpressVPN has been great because it has all those benefits, but very rarely do I have to work outside of my chosen hours of 10 to 7. The work is still challenging during the work day, of course, but I get to leave it at work at the end of the work day.", "cons": "One thing that I do miss compared to my other startup roles is equity, which ExpressVPN doesn't offer at all."}, {"review_title": "I feel lucky to be here, I can't get enough of it.", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "13 May 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "When I was in early stages of interviewing and considering working at ExpressVPN, I honestly didn't know very much about VPNs in general or much about how they work. But the company was looking to fill a role inside their Marketing department which very closely suited my skills and experience, so I was definitely drawn to it.\r\n\r\nThe interview process was the longest I've experienced in my career so far, but honestly not by much. I had several rounds and met many different people of different seniority levels and on top of that I also had to submit some assignments, in order to really prove my ability. This did seem like quite a bit of work initially, but it completely makes sense in order for a company to really know for sure if a person is the right fit and the chemistry between team members would work out. \r\n\r\nI also asked for a little more time to complete my assignments as I told the recruiter at ExpressVPN that I had a lot of work on my plate at that time and I wanted to do the tasks the right way. The company was very cool about it, which was awesome. \r\n\r\nI'll also add that the whole experience with each person that I met through the interview, (especially the main recruiter who was with me every step), were so warm and welcoming and I've never felt so strongly like they really wanted me to get the job! So that was such a delight and really was a great experience. Even if I hadn't gotten the role I would have definitely learnt some valuable things from the interview process here.\r\n\r\nThat being said I did accept the offer and haven't looked back. The company is so well organized and everything is so clear in terms of what is expected of you and how to communicate and execute on projects. \r\n\r\nI've worked at different companies in the past that had just 6 employees, and I've been in ones that had over 10,000 globally. And none of them have had such a lid on making sure everyone communicates effectively, everyone feels comfortable, that when teams which are made up of people with completely different skills and backgrounds, they are all managed extremely well and have the resources and support they need to get things done.\r\n\r\nIt's hard to put into words honestly when everything just feels right, but I think it's great place to work.", "cons": "There are a lot of processes and procedures to learn, but it's not difficult."}, {"review_title": "Best company I've ever worked with so far", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "19 Apr 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- Healthy work environment promoting work-life balance with flexible hours\r\n- Super smart coworkers sharing the same energy, humility, and desire to build a great product for users\r\n- A great opportunity to be part of a profitable, privately-owned, growing company that has its processes together but also its \"all hands on deck\" moments\r\n- Caring and skilled management investing in people's strengths and helping them grow into manager roles\r\n- Highly competitive industry that makes it fun to chase new frontiers\r\n- Attractive benefits and compensation\r\n- I've made friends for life in the few years I've worked here", "cons": "I can't think of any worth mentioning"}, {"review_title": "Collaborative Culture", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "4 Jun 2021", "job_title": "Content Strategist in Toronto, ON", "duration": "N/A", "pros": "Fast-growing company with some very smart individuals at the helm", "cons": "tough for remote staff to be promoted"}, {"review_title": "Collaborative, Diverse, and Agile", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "7 Apr 2021", "job_title": "Project Manager in Hong Kong", "duration": "N/A", "pros": "1. An inclusive work culture that is driven by meritocracy\r\n2. Flexible working hours\r\n3. Focussed on getting things done!", "cons": "None to report so far!"}]]