[[{"review_title": "-", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "2 Mar 2023", "job_title": "Director", "duration": "N/A", "pros": "all good, no comment at all", "cons": "nothing to complaint at all"}, {"review_title": "Work life balance and a very lovely culture", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "20 Feb 2023", "job_title": "Associate in Singapore", "duration": "N/A", "pros": "There is a good work environment where there are team collaborations and open discussions. Management provides us with flexibility and a lot of empowerment.", "cons": "No cons to share currently"}, {"review_title": "OK not bad", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "30 Jan 2023", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Heaps of learning opportunities, Great Benefits,", "cons": "Can be quite stressful at times."}, {"review_title": "Burst of growth", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "29 Jun 2022", "job_title": "Sales and Marketing", "duration": "N/A", "pros": "1 month in Klook feels like 1 year. You learn loads in a very short period of time because of the large amount of exposures and of course, work. \r\n\r\nAwesome people - young, young at heart, vibrant, experimental, always aspiring to be different.\r\n\r\nCompetitive - Klook must (and will) win.\r\n\r\nAwesome place to start with a right footing. To learn how to be aggressive, to strive to be the best, to think out the box to beat the competition.\r\n\r\nWant to learn more by taking up \"CCAs\" and extra projects? This is definitely the place.\r\n\r\nRecommended as a stepping stone for 2-3 years to bring you to greater places.", "cons": "Pay and benefits are really not great especially among tech companies and especially so for the amount of achievement various teams have achieved. Truly affects staff retention.\r\n\r\nLimited career progression opportunities especially if one is looking to expand regionally. This is due to the company structure - there are local offices in almost every country Klook has footprint in so if you want to have \"regional\" in your title, you will have to climb upwards.\r\n\r\nTop-heavy. Unthinkable number of ADs, Ds, SDs and above. Everyone is asked to go \"strategic\" - who is going to do the work then?\r\n\r\nNot 100% sure if global people really know what's going on on the ground since they sometimes set unrealistic expectations and targets. Not too sure if they really care about the career progression about the local teams too."}, {"review_title": "Wholesome environment with little politics", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "17 Oct 2022", "job_title": "Manager", "duration": "N/A", "pros": "Everyone was generally nice and helpful, the team members especially in certain countries were exceptionally hardworking and take great ownership of their work.", "cons": "KPIs can be a bit confusing, new teams might feel a little lost but quite expected of fast-growing companies"}, {"review_title": "Amazing interview process!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "16 Aug 2022", "job_title": "Anonymous Employee in Singapore", "duration": "N/A", "pros": "The HR in charge of my application was absolutely STELLAR. He followed up with me on each round of my interview (SUPER QUICKLY) and even added the feedback from the hiring team + followed up without me having to ask or send any follow up emails. He was also super patient and understanding of my situation and I really think this was one of the best experiences I've ever had.", "cons": "None. Excited to start work!"}, {"review_title": "Great company to work with", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "14 Jul 2022", "job_title": "Business Development Associate in Singapore", "duration": "N/A", "pros": "Travel benefits, great company culture", "cons": "Workload can be high at times"}, {"review_title": "Amazing place to work at", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "19 Jun 2022", "job_title": "Anonymous Employee in Singapore", "duration": "N/A", "pros": "- Remote/ hybrid working \r\n- Great culture and benefits \r\n- The team is young and vibrant\r\n- Fast career advancement", "cons": "- OKRs can be unclear at times"}, {"review_title": "Flexible working arrangements", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "5 Jun 2022", "job_title": "Finance", "duration": "N/A", "pros": "Can work from anywhere and flexible working hours as long as work efficiently", "cons": "Being a mature start up, things are messy"}, {"review_title": "Haven't Graduated From Startup Mentality", "rating": "3.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "25 Apr 2022", "job_title": "Manager in Singapore", "duration": "N/A", "pros": "- Agile\r\n- Transparent management that lends a lot of confidence to the staff\r\n- Collaborative \r\n- Committed & talented pool of staff", "cons": "- Too much collaboration\r\n- Matrixed structure which results in overwork \r\n- Hard to achieve work life balance"}], [{"review_title": "Great business but management needs to work on building a better culture", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "9 Feb 2022", "job_title": "Anonymous Employee in Singapore", "duration": "N/A", "pros": "Fun, smart & hardworking folks\r\nOpportunity to get hands dirty and make an impact/influence\r\nGreat business with B2C & B2B model", "cons": "To invest more on Product side\r\nNot diversified workforce\r\nLong hours\r\nMinimal benefits\r\nLack of investment in tools/platforms for HR/Finance"}, {"review_title": "Complex Structure", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "4 Apr 2022", "job_title": "Analyst", "duration": "N/A", "pros": "hyper growth environment\r\nGood learning ground \r\nnice colleagues", "cons": "Culture not great and managers are inexperience"}, {"review_title": "Still believe Klook can be great", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "2 May 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- If you enjoy creating projects from blank slates, you’ll appreciate the autonomy that is given to the working level to design and execute. This is rare, and has helped to build a culture of creativity and innovation. \r\n- Colleagues for the most part genuinely want to see the company succeed and are willing to put in the hard work to get us there. \r\n- Great exposure to multiple parts of the business if you put your hand up for it. Getting to work with some of the most brilliant minds in the industry / their respective fields. \r\n- COVID has been a major catalyst to push innovation / pivot to new strategies (e.g. our own in-app live streaming function, launching hotels etc) \r\n- In the past year, the company has demonstrated a resilience that not many other companies can say they’ve matched. Confident that Klook will be at the forefront of post-COVID recovery.", "cons": "- We were at the brink of major global expansion in 2019, and had hired accordingly - resulting in an odd mish mash of “big company” thinking and start-up / growth mindset hustle. With COVID hitting, many employees, especially new joiners, did not get a chance to see Klook on the rise nor have they been through starting things from scratch without a fixed structure. A lot were lost when the pandemic first hit and we had to build again from rock bottom. \r\n- Top-heavy structure that is sometimes too preoccupied with formulating strategy, that they do not check in with the ground. Said strategies are also poorly cascaded and do not translate well when executed. There is no point having so many “strategists” or “brainiacs” in the room when ultimately the implementation is a flop. \r\n- Most central teams have no real experience with multi-market coordination, resulting in poor communication. Certain projects tend to be built only for specific markets / cultures, without seeking consensus or use cases. \r\n- Experimentation is a bit too encouraged. Building a culture of learning and failing isn’t wrong, but the experiments we embark on still need to drive impact and make sense. Because every team tries to drive their own experiments, it results in exhaustion all round. There is a lack of direction and prioritisation."}, {"review_title": "Great Culture", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "8 Mar 2022", "job_title": "Go-to-Market Growth Hacker in Singapore", "duration": "N/A", "pros": "Good working culture that is collaborative in nature", "cons": "expected to work even outside of working hours"}, {"review_title": "Great company culture", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "18 Feb 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- great company culture\r\n- good perks for employees\r\n- is a company that will nurture you to grow", "cons": "- can’t think of any!"}, {"review_title": "Fun but terrible in hindsight", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "12 Feb 2021", "job_title": "Anonymous Employee in Singapore", "duration": "N/A", "pros": "Fun colleagues who make working there enjoyable. You also get to lead your own projects and get a sense of autonomy.", "cons": "- Practically no work-life balance\n- Colleagues are over-involved in each others’ personal lives\n- OT culture is glamourised. Important decisions sometimes made during OT sessions, so you’d miss out on those opportunities if you value a work-life balance\n- Expect huge workloads\n- Favouritism is rampant (stepping on the toes of a “favourite” can ensure you have one foot out the door)\n- Colleagues (even managers) can get very cliquey\n- No sense of structure (calls to implement more structure were always met with a thats-how-its-always-been-done attitude)\n- No recognition for the work you do\n- No recognition for the position you’re hired at, longer-serving employees’ considerations will always be of a higher priority\n- Practically lied through their teeth when they were retrenching people due to Covid, with no effort to ensure retrenchment was handled sensitively and respectfully"}, {"review_title": "Awesome work culture", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "21 Jan 2022", "job_title": "Creative Director in Singapore", "duration": "N/A", "pros": "Amazing work culture and environment", "cons": "Increment can be slightly slow"}, {"review_title": "Bad Management - Family Business", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "30 Sept 2021", "job_title": "Manager in Singapore", "duration": "N/A", "pros": "- Fast & flexible working culture", "cons": "- Higher management people do not have the skill sets and leadership required for the job. They are simply at their position because they are the pioneer batch of the company \n- Those who have power in decision making are those that are good friends of the higher management. It’s a family business rather than a corporate company. \n-HR works for the boss only. They are not there to speak up for the employees."}, {"review_title": "It had so much potential", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "4 Feb 2021", "job_title": "Sales in Singapore", "duration": "N/A", "pros": "- Steep learning curve\r\n- Working with people of all levels and background - matrix organization\r\n- People are very nice and generally nice to work with\r\n- Lots of fun and energy\r\n- Working with some of the most talented and brightest minds", "cons": "- Spreadsheets everyday everywhere- many things need automation\r\n- Quarterly restructure - employees not knowing what or how to prioritise as management wants to dominate every space - lack of clear direction as everything is still experimental\r\n- Overworking of staff - want to grow but unwilling to hire\r\n- Unfair remuneration even with hours of sacrifice\r\n- Terrible work life balance\r\n- Targets are always readjusted, wasting employees efforts and making it hard for employees to prioritise and hit the actual target"}, {"review_title": "Nice office, but team mates are more concerned about performance than collaboration", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "8 Sept 2021", "job_title": "Marketing", "duration": "N/A", "pros": "- good pay package\n- nice working environment\n- great HR set up and processes", "cons": "- not big on diversity"}], [{"review_title": "No clear goals, demeaning senior management", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "9 May 2021", "job_title": "Business Development in Singapore", "duration": "N/A", "pros": "Opportunities to learn, nice office", "cons": "Poor senior management, no clear goals"}, {"review_title": "Salary", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "2 Oct 2021", "job_title": "Senior Manager", "duration": "N/A", "pros": "Nice place to work in", "cons": "No clear direction from BLM"}, {"review_title": "Still a great company with vision and potential", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "1 Jul 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Fast paced, exciting and genuinely looking make an impact \r\nLots of smart people around to work with and learn from", "cons": "Indeed, the organization has went through a rapid growth phase and will need to catch up on organizational structure, management, people issues, communication, etc. It is easy to identify areas of improvement but for others who have been in other startups, these are common growing pains of a startup journey. Confident that the founders are committed to addressing all issues as they arise and continue to grow from strength to strength"}, {"review_title": "Opportunity Everywhere", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "18 Jun 2020", "job_title": "Business Development Director in Singapore", "duration": "N/A", "pros": "The business has grown extremely quickly by setting high goals and standards while being very open to ideas and new vertical and geographic launches. The net result is if you want to progress quickly and are open and clear with your manager about this, there is opportunity everywhere. The people who do best at Klook are self starters who are curious and data driven. Ownership is a core value that is not just written in PPT's but really lived but team members.", "cons": "Like many companies with rapid growth, structure and process need to grow and evolve over time. This can sometimes create confusion but most people and departments are very open to talking about issues and resolving the quickly."}, {"review_title": "Need to be pro-active", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "8 Jun 2021", "job_title": "Anonymous Employee in Singapore", "duration": "N/A", "pros": "Has an open culture that promotes a collaborative spirit", "cons": "Fast-moving environment which may not be suitable for all"}, {"review_title": "Fast Paced Company with Many Opportunities", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "19 Oct 2020", "job_title": "Manager", "duration": "N/A", "pros": "Tech savvy and great acceptance to diversified ideas. Rooms given to Employees to grow, be creative and learn knowledge from outside work scope. It encourages Employees to stretch and share their views, achieve the impossible. Great company if you like changes, varieties and achieve self actualization.", "cons": "Fast paced environment and many programs/project deadlines to meet. The volume of work is not for the fainted hearted."}, {"review_title": "Amazing place to work!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "6 Sept 2020", "job_title": "Director, Learning & Development in Singapore", "duration": "N/A", "pros": "There are lots of opportunities to think of creative solutions to improve our processes and methods, and I feel a great sense of achievement at seeing how quickly ideas get turned into real action! I also get to work with an incredible team of curious, helpful and committed individuals that share a common goal of achieving the best outcome for the company!", "cons": "A lot happens quickly in our environment, so it's important to build a network and stay connected. Personally, I see this as more of a pro than a con! :)"}, {"review_title": "Great exposure", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "14 Apr 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "A lot of exposure and opportunity to lead", "cons": "Long working hours and sometimes lack of transparency"}, {"review_title": "Too many problems. Not ready.", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "7 Jul 2020", "job_title": "Anonymous Employee in Singapore", "duration": "N/A", "pros": "- Still very young, so it's good if you enjoy working from the ground up and fixing things along the way.\r\n- Ample opportunities\r\n- It's a great idea and has potential definitely (the idea, specifically).", "cons": "Wow where do i even begin. The problem with Klook is obviously it's Management. For example, Most Tech and People teams cannot even speak proper English but still  pride themselves as an international company?\r\n- Most of the people at the top have little experience with the travel industry let alone, experience leading remote teams/large teams. \r\n- Developers/Engineers only speak Mandarin and to be honest, back when they were hiring, the ability to speak Mandarin was in almost every job posting. So no, not international at all.\r\n- Klook did a mass lay-off and INSISTED that it was kept under the table and tried to be extremely hush-hush about the situation. They were not transparent and most lay-offs were done on the same-day with immediate effect. They have alot to learn from the likes of AirBnB and other international companies who actually care about their employees. \r\n- Company does not see the problems unfortunately, for example: They don't see that's it's a problem that most of the departments rely heavily on Google Excel Sheets to do their day-to-day work. They see it as \"hustling\" to get things done. \r\n- They also don't see the problem with the fact that majority of their employees work late-nights and unhealthy hours to get their work done. In fact they incentivise on it and offer taxi allowance for after 11pm rides - yup."}, {"review_title": "Full of energy", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "3 Sept 2020", "job_title": "Director in Singapore", "duration": "N/A", "pros": "Everyone pulls together and does what it takes. Especially in the past couple of months it has been clear that most of us are focused on customers. We are busy building the company and products that we see are important in the short and long term. I enjoy helping with novel solutions.", "cons": "Klook is not the right place if you want stability and predictability."}], [{"review_title": "Great place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "31 Mar 2021", "job_title": "Customer Service Representative", "duration": "N/A", "pros": "Good payment and career progress", "cons": "High turn over and uncertainty"}, {"review_title": "Dynamic and full of opportunities", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "30 Sept 2020", "job_title": "Anonymous Employee in Singapore", "duration": "N/A", "pros": "- My manager does care for my wellbeing and growth\r\n- Working with driven and capable people who aim high\r\n- Despite business being impacted by COVID19, colleagues are resilent \r\n- I can see positive changes in communication and transparency", "cons": "- Org structure is complicated\r\n- Multiple reorganizations in a span of a short time can take a toll"}, {"review_title": "Better to look elsewhere", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "1 Sept 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "I had a good manager who gave me learning opportunities. Some colleagues are nice.", "cons": "Where should I start? There is something wrong with the management when they:\r\n- Care more about keeping their retrenchment news a secret, than about the welfare of retrenched employees who lost their livelihood\r\n- Lay off people and proceed to post job openings on LinkedIn in the same month\r\n- Want to find out who leaked the retrenchment news when they should care more about WHY people are leaking the news\r\n- Care more about their glassdoor ratings and not why their current employees have low morale (also covering up bad reviews with good reviews)\r\n- Still haven’t learnt how to handle the second retrenchment properly after how badly they did the first one\r\nIn difficult times, you see the true competencies of the management team. Unfortunately, Klook appeared to be promising in good times but this covid has proven otherwise. You are not treating your employees humanely if you give them only 5 hours to handover their work and say their goodbyes. In some countries, we get furloughed without a single cent and that is all we get? I get laid off without my manager knowing? Can you even call yourself HR when you lack empathy?\r\n\r\nCareer progression\r\n- Don’t expect to get promoted easily. Hard work will not get rewarded. Employees who have been in the company for long get promoted every year while the rest just watch.\r\n- Increments, bonus and salary are below market average\r\n\r\nCompany direction\r\n- Changes continuously, especially due to indecisive management. Investors have a huge role to play in this\r\n- Not sure why some teams are even around, especially at this period of time, do you need 3 teams working on the same thing? Layoff selection was definitely unfair :O \r\n- Klook always strives to be the next airbnb haha, clearly the company is far from that\r\n\r\nOthers\r\n- Lack of transparency within the company, title is over-emphasised in this company. It is painfully obvious that only certain ranks get access to information. Very Asian way of management.\r\n- Watch the employees backstab each other while fighting to keep their jobs."}, {"review_title": "Great company to work for!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "17 Jun 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- Strong innovation culture, able to pivot fast in the face of a challenging market\r\n- Genuinely supportive colleagues across multiple offices\r\n- Senior managers who are invested in your success, constantly providing opportunities to grow", "cons": "- The travel industry is in a difficult place right now, but I'm confident the company will ride out the storm."}, {"review_title": "Good culture , messy structure and low pay", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "22 Jan 2021", "job_title": "Account Success Executive in Singapore", "duration": "N/A", "pros": "Open and flexible working style", "cons": "Many restructuring and internal transitions, inexperienced leadership"}, {"review_title": "Fast paced work culture", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "10 Sept 2020", "job_title": "Manager", "duration": "N/A", "pros": "Motivated team, collaborative and friendly colleagues", "cons": "Too many layers for senior management and some of them don't get along, causing a sandwiched middle management and lost junior team members"}, {"review_title": "Great working culture", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "13 Aug 2020", "job_title": "Executive", "duration": "N/A", "pros": "Nice people and environment. Startup culture", "cons": "Hectic workloads, chasing deadlines over and over again."}, {"review_title": "Nothing exciting to share about", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "23 Sept 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Young, fun and dynamic culture", "cons": "I wish the company could appreciate the employees more."}, {"review_title": "Klook Travel", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "23 Sept 2020", "job_title": "Anonymous Employee in Singapore", "duration": "N/A", "pros": "have a dynamic and young culture and comrades are nice", "cons": "Top down approach, does not encourage sharing out ideas, managers are not supportive and no transparency in setting goals and objectives"}, {"review_title": "Working in Klook", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "18 Sept 2019", "job_title": "HRIS Manager in Singapore", "duration": "N/A", "pros": "A large population of the employees are young energetic people, so  there are a lot of fun and laughter in the office. Energy level is very high and good ideas are quickly implemented. Internal mobility is high as many positions are opened up all over the world. As per startup, you can dress smart casual for work. There are many scheduled quarterly team building activities with other departments.", "cons": "The workload/pace is blistering as we are aiming for very high growth. You need to manage your time well to get your work done."}], [{"review_title": "An energetic Start-up", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "A really young and energetic company. All colleguages are nice and thoughtful.", "cons": "A bit lack of management maybe because it just established for the first three years."}, {"review_title": "Manager", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "1 Nov 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- Flexible work culture\r\n- Autonomy as long as you get your work done\r\n- Fun culture and environment\r\n- Multiple ongoing initiatives and plans for growth", "cons": "- Ongoing changes - though good, it is usually implemented top down which people at the bottom might not agree\r\n- Lack of communication and transparency"}, {"review_title": "Dynamic Place for Great Learning", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "3 Oct 2018", "job_title": " in Singapore", "duration": "N/A", "pros": "Young, fun and vibrant culture \r\nPeople are open and outgoing \r\nGreat for learning all the ropes of a start up \r\nPlay multiple roles in the company that uses your different skillsets\r\nOffline events are fun to plan for!", "cons": "Be prepared to hustle or work long hours!"}, {"review_title": "Fast moving start-up", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "10 Oct 2019", "job_title": "Associate Manager", "duration": "N/A", "pros": "Open minded company, flexi working hours", "cons": "No structure, lack of proper management"}, {"review_title": "Not the best  organization to work with.", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "26 Feb 2020", "job_title": "Business Development Manager in Singapore", "duration": "N/A", "pros": "Good exposure to south APAC travel trends.", "cons": "Poor employee benefit programme. The leadership team doesn't have a clear goal nd objective."}, {"review_title": "Analyst", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "22 Aug 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Nice colleagues and vibrant environment", "cons": "Need to be fluid and willing to work beyond current scope"}, {"review_title": "Office Manager", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "10 Jun 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "I have no comments at all", "cons": "no comments at all for this company"}, {"review_title": "Best Start Up Company", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "15 Oct 2018", "job_title": " in Singapore", "duration": "N/A", "pros": "Good place to work", "cons": "Workload will be crazy"}, {"review_title": "Worst", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "6 Mar 2023", "job_title": "Manager in Hong Kong", "duration": "N/A", "pros": "Great location, colleagues are positive and young.", "cons": "If you used to look up and seek your direct manager/director as role model to learn from, here is not for you! Their mid level management is the worst - do not reflect real situation and cannot accept the team give feedback or challenge their decision. No respect to the team They ask for reference check of each candidates, but I doubt have they checked their mid level management as well LOL"}, {"review_title": "Executives are inexperienced. No Stock options for new joiners. Old employees sit and wait.", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "23 Feb 2023", "job_title": "Marketing Manager in Hong Kong", "duration": "N/A", "pros": "Office close to nice restaurants options. You can add to your CV", "cons": "No stock for new joiner Old employees left sitting and waiting on stock while new employees new to run to make them rich CEO and Executives seems to be doing what they want while there are strict rules for normal employees (working location)"}], [{"review_title": "healthy working culture", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "13 Feb 2023", "job_title": "Customer Experience Specialist in Kuala Lumpur", "duration": "N/A", "pros": "office culture is very healthy and they are serious about promoting growth. internal communication is systematic. seniors/managers are helpful when it comes to guidance", "cons": "too many people in the office for ceg"}, {"review_title": "Team Leader", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "16 Feb 2023", "job_title": "Customer Experiences Specialist in Kuala Lumpur", "duration": "N/A", "pros": "Related with my previous job scope", "cons": "all good information in this website"}, {"review_title": "Nice working environment", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "4 Feb 2023", "job_title": "Customer Experience Specialist in Taipei", "duration": "N/A", "pros": "Office has good location, cute office. Colleagues are nice and friendly. Pretty welcoming gift.", "cons": "The salary is not that high."}, {"review_title": "Great company to work and grow with", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "4 Jan 2023", "job_title": "Senior Manager in Dubai", "duration": "N/A", "pros": "- Startup setup - Room for innovation and new ideas to be explored - Perfect timing to be working for this company post-covid era - Great teamwork across different departments - Excellent leadership and guidance towards the vision and mission set for the company's future", "cons": "There's alot of work to be done post-covid era, but this is the same for any other company related to tours and activities."}, {"review_title": "Incompetent of Senior Management that works under Ethan and Eric", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "30 Nov 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Ethan and Eric are very good and they are the type of boss that notices the future vision but not the other senior management.", "cons": "If the success of any organization is co-owned by leaders and employees, then there should be transparent management where everyone can speak up and get feedbacks instead of getting comments from HR that \"this employee is very bad, please get rid of them\" !! Please wake up!! You will be just chasing away the good staff and people will move away from you. You might think that it is ok because people come and go, but always remember that the EMPLOYEE has been always the asset of a company."}, {"review_title": "Great environment and office", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "25 Jan 2023", "job_title": "Customer Specialist", "duration": "N/A", "pros": "Good office. Good colleagues and team leader. Encouraging environment. No overtime", "cons": "Shift time and leave or holiday arrangements"}, {"review_title": "CEG", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "27 Jan 2023", "job_title": "Customer Experience Specialist", "duration": "N/A", "pros": "best workplace and friendly environment", "cons": "stress workload . . ."}, {"review_title": "Worst company I ever worked", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "8 Feb 2023", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "I do not have any", "cons": "Poor management, lazy people. Literally the worst company I ever worked."}, {"review_title": "Nice & friendly colleagues", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "22 Jul 2022", "job_title": "Anonymous Employee in Kuala Lumpur", "duration": "N/A", "pros": "- Hybrid work arrangement (currently 2 days a week in office)\n- Nice & friendly colleagues\n- Working hours is 10am - 7pm\n- Easy access to office (opposite Abdullah Hukum LRT & linking bridge to The Gardens), daily parking at The Gardens is around RM10 from 9+ to 7+\n- Benefits are ok, could be better", "cons": "- Turnover is quite high, colleagues resigning is pretty common post covid, thus constantly need to take on new tasks from resigned colleagues until new joiner comes in \n- Very fast changing environment, need to be able to adapt to those changes\n- Promotion is not easy, will need to take on projects & do well in them for management to see your contribution, or else doing normal assigned tasks (even though you do really well in them) are not usually being considered\n- Work can get pretty hectic during busy period, need to OT during those times & even taking time off (AL) is difficult which is frustrating"}, {"review_title": "Klook Malaysia", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "3 Jan 2023", "job_title": "Marketing Associate", "duration": "N/A", "pros": "- Positive onboarding experience - Good colleague that care about your well being - supportive team that always help each other out to achieve target -fast pace", "cons": "- As it is a fast pace environment, everyone needs to be agile and quick"}], [{"review_title": "Fast company", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "22 Jan 2023", "job_title": "Associate Manager in Hong Kong", "duration": "N/A", "pros": "Work moves fast Lots to learn", "cons": "Can be overwhelming at times"}, {"review_title": "Company Review", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "20 Dec 2022", "job_title": "CEG Agent", "duration": "N/A", "pros": "Klook is my 2nd permanent company working here. Honestly, working in klook is really peaceful, no gossips, my team leader is awesome, annual dinner was awesome", "cons": "eventho benefits provided but it was less, there is no dental or optical claim"}, {"review_title": "Really depends on your team.", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "23 Oct 2022", "job_title": "Customer Support in Kuala Lumpur", "duration": "N/A", "pros": "- Good work culture and atmosphere, and they really try to make you feel at home and comfortable in the company. - Decent opportunities for internal advancement. - Decent pay. -", "cons": "- Depending on your manager, you may or may not receive any guidance or set direction on your work, and might not be able to support you in your role & projects. - Workload is constantly changing, so it’s hard to feel like you’re getting anything actually done. - Some office politics and people resistant to change. - Some deeply unprofessional and annoying coworkers."}, {"review_title": "Good workplace if you're up to the task", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "3 Jan 2023", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Flexible working environments, work from home or office up to you", "cons": "Tough targets to meet and often under tight deadlines"}, {"review_title": "A place to put your knowledge into use", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "10 Nov 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "I personally see this company as a place that got a whole lot of people with ideas. Not only that, all of them seems to put their knowledge and indeas into use; whether it's data related, tech related, budget related, campaign related, or even creative writing related.", "cons": "Somehow, those abundant ideas from the employee come to the point where the company having too many good ideas that it starts to find it difficult to choose which one needs to be prioritised."}, {"review_title": "Great company to work for", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "27 Dec 2022", "job_title": "Customer Service in Kuala Lumpur", "duration": "N/A", "pros": "Multicultural , friendly environment Company activities Good bonuses", "cons": "Shifts schedule Strict timing Not much of carreer opportunities for management"}, {"review_title": "Good culture and nice people", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "24 Oct 2022", "job_title": "Project Manager", "duration": "N/A", "pros": "You get to work alongside very bright yet nice people, working culture is pretty healthy, and there’s lots of opportunity for growth as long as you reach out for it.", "cons": "Expect tight deadlines and lack of clear direction (sometimes) in a fast-paced company like this, things change all the time so you have to be quick to adapt and good at managing your time + various priorities."}, {"review_title": "Review", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "8 Dec 2022", "job_title": "Finance Associate", "duration": "N/A", "pros": "Good local co-worker to work with Good benefit", "cons": "Bad manager Oversea coworker is not friendly, especially some China employee"}, {"review_title": "Crazy workload - Zero Work & Life Balance", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "15 Sept 2022", "job_title": "Head of Marketing", "duration": "N/A", "pros": "I was there before the pandemic, working for one of their subsidiary on one of the country in South East Asia. Cool perks, nice office and other benefits too.", "cons": "Basically the company wasn't the most easiest organization to navigate with. Loads of crazy work tasks and way too many unnecessary meetings, which created the unpleasant work-life balance experience. No persistence north star metrics to adopt, while the flow of work really tedious & would consume lots of time to execute."}, {"review_title": "Great people but poor management", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "10 Oct 2022", "job_title": "Business Development", "duration": "N/A", "pros": "Flexibility - manager don't care how you do your job or where you work from as long as your tasks meet deadline and standard\r\nGreat colleagues - got to work with so many talented people globally", "cons": "Salary - not competitive enough\r\nHR/Manager - don't feel like they take feedback seriously or try to make any improvement from employee mid/end reviews\r\nCulture - don't feel like management care about employee work-life balance or career growth"}], [{"review_title": "My experience in Klook so far.", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "17 Oct 2022", "job_title": "Customer Experience Specialist II in Kuala Lumpur", "duration": "N/A", "pros": "- Friendly environment. - Motivating workspace to help me focus and feel less stressed with my work. - Great opportunity to develop my skills.", "cons": "- Haven't encountered any so far - Maybe can provide a better guidance for the new comers."}, {"review_title": "Good", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "24 Nov 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Helpful people from all around the world", "cons": "Work process can get too complex"}, {"review_title": "Great Working Culture and Environment", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "15 Nov 2022", "job_title": "Customer Experience Specialist in Kuala Lumpur", "duration": "N/A", "pros": "- Competitive Salary - Great career opportunities", "cons": "- working space can be bigger"}, {"review_title": "Working Environment is GREAT", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "30 Oct 2022", "job_title": "Business Development Associate in Bangkok", "duration": "N/A", "pros": "- Workcation program is available - Cross-functional comuunication", "cons": "- Career growth wise is mostly in Singapore or Hong Kong offices to be promoted as regional director or director"}, {"review_title": "Employee Benefits", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "10 Nov 2022", "job_title": "Staff Accountant", "duration": "N/A", "pros": "Helps research and development process", "cons": "Too many information stated in the site"}, {"review_title": "Great Team", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "3 Nov 2022", "job_title": "Senior Manager in Mumbai", "duration": "N/A", "pros": "Great team to work with. Diverse culture", "cons": "Nothing as such I came across in 3yrs"}, {"review_title": "Global experience, great collaboration, average pay", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "22 Jun 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- Strong job satisfaction as there is a lot of empowerment in your role. If you are a go-getter, this is the right company for you as you'll have the freedom to drive a lot of initiatives.\n- Strong collaboration with colleagues. People are very willing to help and even reach out first because they caught wind that you need their help.\n- Great support by manager. Manager is a great supporter to career, received a lot of trust, empowerment and autonomy is driving my portfolio.", "cons": "- Pay and benefits are not as competitive as peers in the industry, company leverages career development opportunities instead and counts on the intrinsic job satisfaction of employees, which means it's hard to retain good talent (and good colleagues) for long."}, {"review_title": "Better than expected", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "18 Oct 2022", "job_title": "Anonymous Employee in Hong Kong", "duration": "N/A", "pros": "Nice colleague, flexible work time.", "cons": "confusing company structure. can get confused sometimes."}, {"review_title": "I Love Klook", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "4 Oct 2022", "job_title": "Customer Review Analyst in Taipei", "duration": "N/A", "pros": "The happiest workplace I have ever been working in.", "cons": "No cons for now I suppose."}, {"review_title": "So-so", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "14 Oct 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Funny workplace; work from home; good benefits", "cons": "Low salary; messy management; unreachable KPI"}], [{"review_title": "good company with nice people", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "12 Oct 2022", "job_title": "Business Analyst in Hong Kong", "duration": "N/A", "pros": "good company with nice people", "cons": "Lack of stable structure and routine"}, {"review_title": "culture", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "13 Sept 2022", "job_title": "Account Executive", "duration": "N/A", "pros": "flexible and allows alot of self initiative if willing to put yourself into it", "cons": "difficult to reach to management lvl and all communication is only usually with line manager"}, {"review_title": "Challenging yet satisfaction journey", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "28 Aug 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Klook is great for people who looks for fast career growth. The company encourages new ideas and move fast in reacting to the market.", "cons": "Communication has been improved a lot, but still have rooms of improvement in cascading company direction."}, {"review_title": "High turnover", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "13 May 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Good benefit and fast hiring process. A hiring manager was very responsive and it helped me to make a decision quickly. I was satisfied with my job responsibilities and office environment.", "cons": "Many people do not stay for a long time and you will have to be used to having many different reporting managers. And it was difficult to deal with sudden layoff notice. I wish the company/manager had taken different approach to notify layoff. I felt it was a bit unnecessary to talk to me about what to do with my life after Klook and why I should consider changing my career when they have no experience with my job. I hope they can be more considerate to their employees."}, {"review_title": "rd", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "20 Sept 2022", "job_title": "Software Engineer", "duration": "N/A", "pros": "balance of work and life", "cons": "low salary and low pressure"}, {"review_title": "Good environment", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "6 Sept 2022", "job_title": "Customer Experience Group in Kuala Lumpur", "duration": "N/A", "pros": "Nice working environment with nice colleagues", "cons": "High workload\nLack of manpower for certain team"}, {"review_title": "Young Fast-Paced", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "15 Aug 2022", "job_title": "Business Development", "duration": "N/A", "pros": "Team is young, always possiblities to put your idea into action. Great place to begin a career", "cons": "Due to the fast-paced market, the strategy from the company may adjust accordingly."}, {"review_title": "A playground where you are empowered to test things out", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "9 May 2022", "job_title": "Learning and Development Manager in Kuala Lumpur", "duration": "N/A", "pros": "- Really enjoyed the global exposure of this role \r\n- My immediate manager is not shy away from sharing context and background with me (although some of this information are beyond my job grade) and that makes my onboarding much smoother \r\n- The company really embrace a feedback culture and actively listen to what the employees want \r\n- Supportive colleagues who may not have all the answer, but willing to find out together with you", "cons": "- So far it has been a pleasant experience, no cons to be shared"}, {"review_title": "Good Environment", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "11 Aug 2022", "job_title": "Customer Experience Specialist", "duration": "N/A", "pros": "Lots of Annual leave days!", "cons": "Sometimes restricts too much not so important  things."}, {"review_title": "Becoming more organised", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "2 Mar 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "The past two years have made us stronger thanks to improvements to the organisation structure and decision making. We'll always move fast and learn as we execute, which can seem somewhat chaotic, but these days it is much easier to pull together.\r\n\r\nCareer opportunities are still ample because we are so flexible. At the beginning of the pandemic it was harder to feel that you're making an impact especially when still getting used to a changed role. Now it's easier to", "cons": "You can feel lost initially since you really need to take ownership: not just gain knowledge, but build connections. You may also not realise how much freedom you have to suggest business ideas and changes. Once you figure that out, it's less confusing."}], [{"review_title": "Generally fun", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "19 Aug 2022", "job_title": "User Experience Designer in Shanghai, Shanghai", "duration": "N/A", "pros": "Young joy interesting beneficial friendly", "cons": "Long working time, not real open"}, {"review_title": "Great company, not so great management (Malaysia only)", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "19 Feb 2022", "job_title": "BD Associate in Kuala Lumpur", "duration": "N/A", "pros": "Large work space, they provided a small room for resting as well. Ceo updates on the company situation during the pandemic often and does a town hall often as well.", "cons": "No commission.\nLack of training or keep having access issues here and there since system is messy. They keep on changing the director and what we were supposed to be supporting. Manager don't know how to fully do what the associates are doing so cannot guide or give feedback. Have to refer to senior and there is only one senior who is busy having to carry the manager's work load as well."}, {"review_title": "Cool company", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "22 Jul 2022", "job_title": "Account Manager in Hong Kong", "duration": "N/A", "pros": "Very dynamic - be ready to embrace change.\r\nFull of learning opportunities", "cons": "Salaries are not competitive.\r\nHigh turnover"}, {"review_title": "Is nice", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "26 Jul 2022", "job_title": "Customer Service Representative", "duration": "N/A", "pros": "People there are nice and such a young working environment, can learn quite many things.", "cons": "Hope the pay will be better!"}, {"review_title": "Three months of experience in the company", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "31 May 2022", "job_title": "Associate Manager", "duration": "N/A", "pros": "The work environment is very good and my colleagues are very good to get along with, and I have many opportunities to challenge myself in terms of work content.", "cons": "I hope I can have the opportunity to bring out my expertise to contribute to the company."}, {"review_title": "Think twice or more", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "2 Sept 2022", "job_title": "Customer Service Representative (CSR) in Taipei", "duration": "N/A", "pros": "Off duty on time and that’s all", "cons": "Toxic environment\r\nManagement level ppl are lack of management skill"}, {"review_title": "Customer service", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "21 Jul 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "A good company, can learn a lot of things", "cons": "Have to be very multitasking and fast reponses"}, {"review_title": "Working in a chill environment", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "6 Jun 2022", "job_title": "Business Development Associate", "duration": "N/A", "pros": "The colleagues and the working environment are both chill and energetic! It makes you get motivated every day!", "cons": "You need to be mentally prepared that a lot of challenging things will greet you, sometimes the deadlines are tight"}, {"review_title": "Dependable on what your working style is - Klook may exciting or frustrating", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "18 May 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Changes happen and it's occuring even more due to the COVID situations and waves. Luckily my BLM and team are very supportive and everyone voices their opinions whenever there's an issue. Your experience here is highly dependable on which team and BLM you are under. From day 1 till now, there are constant changes and shifts in priorities, you need to be prepared to lead your own project no matter what level you are - so personally this was a pro for me in that you gain so many new insights and get to practice different skills. Most teams that you work with are willing to help out and it's not hard to ping someone in a different department or level.", "cons": "Although people assume that Klook may be a high tech company, many of our works are very manual and tech resources are very limited. This means that there are alot of delays and projects stalled because it's dependent on tech. Also, since majority are still working from home and also there are local teams and central teams - expect alot of meetings to take up your schedule. Sadly, many of these meetings do not have a purpose or clear action."}, {"review_title": "Great place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "4 Jul 2022", "job_title": "Business Development Manager in Bangkok", "duration": "N/A", "pros": "- fast moving \n- non-hierarchical \n- global mindset\n- Hybrid office", "cons": "- could get overwhelmed sometimes \n- benefits package might not be as competitive as other local company"}], [{"review_title": "nice company", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "24 Jul 2022", "job_title": "Internship in New Delhi", "duration": "N/A", "pros": "positive work culture\r\nlearning environment\r\ngood hike", "cons": "work-life balance is not good"}, {"review_title": "Content", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "12 Jul 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Dynamic workplace for travel lovers to join", "cons": "Poor management and unclear plan"}, {"review_title": "GREAT", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "29 Jun 2022", "job_title": "Customer Experience Specialist", "duration": "N/A", "pros": "Nice environment, friendly coworkers, great benefits", "cons": "I don't really have any cons"}, {"review_title": "Assistant Marketing Manager", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "19 Jun 2022", "job_title": "Assistant Marketing Manager", "duration": "N/A", "pros": "- great culture\r\n- venture-backed \r\n- resilient team", "cons": "- team restructure /change of role was common during COVID"}, {"review_title": "Fast paced", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "28 Jun 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "diverse team, international exposure, interesting industry", "cons": "lack of work life balance"}, {"review_title": "nice vibe", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "11 Jun 2022", "job_title": "B2B Operations Manager", "duration": "N/A", "pros": "nice work people, great benefit like afternoon tea, holiday gifts and annual travel coupon", "cons": "bad luck if your leader is stupid"}, {"review_title": "Young and hype company", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "9 May 2022", "job_title": "Associate IT Manager in Kuala Lumpur", "duration": "N/A", "pros": "Fun and nice workplace. Will have a party and food on a certain day. Young and energetic people working together.", "cons": "Low salary and employee benefits. Can't expect much from the classroom training sponsorship. Health benefits are normal."}, {"review_title": "Difficult time during covid", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "14 Jun 2022", "job_title": "Senior Manager in Hong Kong", "duration": "N/A", "pros": "Move fast and flat organization", "cons": "Long hour , meeting overload"}, {"review_title": "Poor", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "14 Jun 2022", "job_title": "Customer Service Representative", "duration": "N/A", "pros": "High Salary, company benefits is ok", "cons": "Poor Management, training is uselss"}, {"review_title": "Worth it for the Journey!", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "31 May 2021", "job_title": "Anonymous Employee in Amsterdam", "duration": "N/A", "pros": "-Passionate and talented colleagues who genuinely care about the betterment of the company.\r\n\r\n-Constant improvement of internal tools and processes.\r\n\r\n-A good development opportunity to ease into scale-ups and tech, since this is a travel-tech scale-up, the learning curve isn't too steep. \r\n\r\n-Remuneration is good.", "cons": "-Dealing with the red tape inhibits Klookers from being effective at their job and making the most impact. \r\n\r\n-The company doesn't advocate for good work-life balance and this has unfortunately created space for widespread less-than-ideal practices and overworked staff.\r\n\r\n-Short to medium-term outlook is not great due to the pandemic.\r\n\r\n-The company will have to review its secondary benefits very soon in order to stay a competitive employer within the tech space."}], [{"review_title": "Great place for exposure but ...", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "1 May 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Opportunity for growth and have an open mindset to explore other areas of interest", "cons": "Running lean on resources - people are overworked and consistently under pressure"}, {"review_title": "Great working envilornment", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "11 Apr 2022", "job_title": "Anonymous Employee in Tokyo", "duration": "N/A", "pros": "- Very flex for working style and time\r\n- Energetic members to work with\r\n- Exciting and fun events are waiting for you!\r\n- Everyone has opportunities to try things", "cons": "- If you are someone who just want to follow orders, Klook is not for you"}, {"review_title": "Good management", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "14 May 2022", "job_title": "Content Creator in Los Angeles, CA", "duration": "N/A", "pros": "Serene working environment.\r\nTeamwork\r\nOn-time salaries\r\nPaid holidays", "cons": "None that I know of."}, {"review_title": "Management can do better in caring about their employees", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "22 Feb 2022", "job_title": "Anonymous Employee in Hong Kong", "duration": "N/A", "pros": "- Good vibes, young and fun environment\r\n- Great office environment\r\n- Easy to commute and good work location", "cons": "- Management did not care about employee growth\r\n- Unreasonable work timeline\r\n- Lack of management planning\r\n- A lot of foundation/root problems had not been solved before moving forward\r\n- Don't look for work-life balance in this job"}, {"review_title": "Positive employee experience", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "9 May 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "diversity work environment\r\nKlook activities sponsorship, wellness program in office", "cons": "Travel has been greatly undermined by Covid-19."}, {"review_title": "Good company with competitiveness but lack of culture", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "9 Mar 2022", "job_title": "BD Manager in Taipei", "duration": "N/A", "pros": "Good market reputation \r\nA lot of chance internally \r\nHigh efficiency of execution \r\nDare to try the new things", "cons": "Lack of company’s culture \r\nAlmost no training \r\nWork life is not balanced \r\nEveryone is workaholic and no fun in office"}, {"review_title": "Nice company", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "4 May 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Nice company, \r\nGood colleague\r\nstill building their culture", "cons": "Poor management\r\nLack of instruction from your superior"}, {"review_title": "Great team !", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "11 Apr 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Klook have lots of great leaders and people,the culture is very nice.Everyone really works as a team and willing to give help to others.", "cons": "Nothing to mention from my side"}, {"review_title": "Klook Travel Review", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "26 Mar 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Very good team culture\r\nEveryone is very supportive", "cons": "Workflow is fast and constant-changing\r\nEmployee may have to Muti-task with different works and projects"}, {"review_title": "Klook", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "10 May 2022", "job_title": "Operations Manager", "duration": "N/A", "pros": "Interesting business model and good product", "cons": "People management and employee salary"}], [{"review_title": "No better place to start than here", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "3 Jan 2022", "job_title": "Content Editor", "duration": "N/A", "pros": "The people are great. I've never felt alone ever since I started working here. They treat me as a long-time friend and that helps boost my confidence at work. They're also open to honest feedback and they give feedback to me as well whenever feedback is needed. Klook is a place where you can start and easily know that you'll grow.", "cons": "Changes are constant here so if you're someone who's looking for stability, then Klook is not for you."}, {"review_title": "Good values", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "22 Jan 2022", "job_title": "Localization Associate in Bangkok", "duration": "N/A", "pros": "- Good company values\r\n- Communicative, transparent management\r\n- Open-minded international community\r\n- Fun, exciting products and campaigns\r\n- Cares about employees' wellness", "cons": "- Cross-team communication is an issue sometimes\r\n- Internal politics on the local level"}, {"review_title": "Fast Changing Company", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "30 Mar 2022", "job_title": "Business Associate in Hong Kong", "duration": "N/A", "pros": "- Young Culture\r\n- WFH policy", "cons": "- Changes too rapid\r\n- Company communication not transparent enough between different teams\r\n- Long working hours"}, {"review_title": "Great place for first job", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "29 Mar 2022", "job_title": "Content Associate", "duration": "N/A", "pros": "Flexitime. Great manager. Fast paced.", "cons": "Low pay if your p level isnt competent"}, {"review_title": "Good company but", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "17 Mar 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Good company culture, co-workers are friendly and nice", "cons": "Managers bias and provoke workplace politic"}, {"review_title": "Technology driven company", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "21 Feb 2022", "job_title": "Senior Marketing Manager", "duration": "N/A", "pros": "Many internal tools can help you to drag out the data, campaign performance, reports for analysis and get insight", "cons": "Need to equip more skill sets to cater different challenges and work tasks"}, {"review_title": "Great company to work", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "13 Mar 2022", "job_title": "Human Resources Business Partner", "duration": "N/A", "pros": "So far, I am enjoying my life at Klook", "cons": "Covid-19 is a big risk for this company"}, {"review_title": "Good till the root is rotten", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "6 Oct 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- LGBT friendly \n- overall friendly", "cons": "- expanding badly, high turnover rate \n- family business as other said, too much politics \n- immature arrogant middle & high managements\n- easily got discriminated treatments if you are not friend of the team lead \n- influencer staffs using the brand name and working time to get personal paid ads work \n- big empty promises, always changing strategies \n- expect staffs to be working machines but not human beings desiring to grow \n- inequities of opportunities and promotions \n- laymen pretend to be super pro"}, {"review_title": "Environment", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "19 Mar 2022", "job_title": "Booking Agent", "duration": "N/A", "pros": "Good working environment, HR benefit, young and powerful", "cons": "Heavy workload, challenges from customer"}, {"review_title": "Great people", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "3 Jan 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Highlight of my stay were the people - passionate, driven and always helpful. The kind of people you sincerely hope to work and see again in the future.", "cons": "- Salary is low\r\n- There is expectation to work outside work hours. \r\n- Succession planning & career development opportunities are scarce to non-existent, sadly."}], [{"review_title": "Klooking your way", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "8 Mar 2022", "job_title": "Assistant Marketing Manager in Dubai", "duration": "N/A", "pros": "Amazing work culture leading to success", "cons": "I really can't think of anything"}, {"review_title": "Would definitely recommend it if you love challenging yourself!", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "17 Jan 2022", "job_title": "Customer Experience Specialist in Taipei", "duration": "N/A", "pros": "1. Company benefits & Annual leaves \r\n2. Working culture \r\n3. Making friends with colleagues from all over the world", "cons": "1. Challenging on day to day basis \r\n2. High pace and change industry"}, {"review_title": "Nice Workplace", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "20 Feb 2022", "job_title": "Customer Service Representative in Kuala Lumpur", "duration": "N/A", "pros": "Nice workplace, easy access as near LRT stations.", "cons": "Would be best if fewer office politics."}, {"review_title": "Good company to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "14 Feb 2022", "job_title": "Manager", "duration": "N/A", "pros": "Very good company to work with.", "cons": ". . . . ."}, {"review_title": "Very Disappointing. Huge Opportunity missed..", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "11 Jan 2021", "job_title": "Marketing", "duration": "N/A", "pros": "Good office perks (WeWork) \r\nBright young and hungry workforce \r\nExciting product and business opportunity in EU\r\nHad huge potential to be a real success story in Travel", "cons": "Far too Political (be ⚠️) and lack of integrity and trust\r\nMistrust of HR and sometimes lack of professionalism\r\nPoor  inexperienced Senior Management in key positions within EU. \r\nPoor communication at key times during Covid 19, forgetting that at the end of the day this is people and their careers not just payroll numbers..\r\nLack of visibility of strategy (EU as opposed to company wide)\r\nLack of understanding how EU is different to APAC..."}, {"review_title": "Great team!", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "16 Feb 2022", "job_title": "Marketing Associate", "duration": "N/A", "pros": "flexible working hours/wfh, great team", "cons": "limited budgets because of the pandemic"}, {"review_title": "Company Review", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "5 Feb 2022", "job_title": "Customer Experience Specialist", "duration": "N/A", "pros": "- Active Management \r\n- Talent and friendly collaegues", "cons": "- Workflows are no that clear while handling cases"}, {"review_title": "young company", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "2 Feb 2022", "job_title": "PhD Student in East Khasi Hills", "duration": "N/A", "pros": "fun company. junior level staff are cool", "cons": "pay not high compare to other industry"}, {"review_title": "Excellent", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "10 Jan 2022", "job_title": "Customer Experience Specialist in Mandaue City", "duration": "N/A", "pros": "The company did an exemplary job in treating their employees from recruitment to working environment, competitive salary, bonuses and freebies.", "cons": "I don't have any cons for this company."}, {"review_title": "toxic environment led by senior management….", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "18 Jan 2021", "job_title": "Biz Development in London, England", "duration": "N/A", "pros": "-\tGood insight to how the industry works very quickly\r\n-\tCan experience some of the activites and tours on the platform cheaply\r\n-\tGood for CV to jump to next job", "cons": "-\tIf u want to succeed in the company, then you need to be a ruthless politican\r\n-\tNo tech for a tech company: expect thousands of googles sheets and other manual or pathetic softwares to take up 90% of your day. So end up doing overtime so you can do “real work” to hit your KPIs.\r\n-\tOrg or strategy changes every month depending on the latest initiatives that Snr politicans like to roll out to show they are doing something.\r\n-\tVery bias Snr management: expect to be promoted only if you know how to appease the iron fist industry veteran. (ie roll out big initiatives that lights up a like firecracker and fizzle even quicker)\r\n-\tVery high turnover rate: most staff stay for 1yr ( they start looking for new job after 6mths). \r\n-\tHR loves to roll out feedback and manager training – kind of useless when honest feedback results in some sort of indirect punishment and its not the mid managers that need the training, the negativity starts from the top.\r\n-\tDon’t expect even a small simple thank you if you’re (over) achieved your KPI, you will only be told “OK could be done better and quicker so will increase the KPI next time”."}], [{"review_title": "things changing fast", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "2 Feb 2022", "job_title": "Senior Product Manager in Hong Kong", "duration": "N/A", "pros": "good team with smart ppl", "cons": "teams and direction changing fast"}, {"review_title": "Should have better package", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "15 Nov 2021", "job_title": "CEG in Taipei", "duration": "N/A", "pros": "-freestyle on having working outfit", "cons": "- bad management as they turned us like a machine not a human."}, {"review_title": "I get PTSD every time I see Klook's name now", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "7 May 2021", "job_title": "Business Development in Rotterdam", "duration": "N/A", "pros": "Gave me good start-up experience and how not to run a company", "cons": "So so many. They handled the pandemic so badly. There was a creeping axe lay-off [lack of] plan that never made sense nor was it strategic. Europe was the worst hit and everybody wondered who was next. The strategy changed so often because one would be decided, it would be backed at the top, then the owners would change their minds. Every decision is on a short-term basis. There is no trust - everybody is a number. Everybody in Europe blames HR but I realised after I left that it wasn't their fault at all and they were a pawn in all of this. HR in Asia seems very reactive to the owners' requests so there's no strategy there at all. Unless they change and adapt to the culture differences they won't be able to run in Europe in the future."}, {"review_title": "Nothing interesting just normal bpo", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "19 Jan 2022", "job_title": "Customer Service Representative in Kuala Lumpur", "duration": "N/A", "pros": "Nothing interesting just normal BPO", "cons": "Not enough training sending soldiers without guns"}, {"review_title": "Such a waste of an opportunity", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "10 May 2021", "job_title": "Business Development Manager", "duration": "N/A", "pros": "It started off great. We built something incredible. Something we could all be proud of. The culture was amazing. The colleague were incredible. So many very talented people.", "cons": "Then we got a new commercial management and it went spiraling to the bottom. Complete lack of awareness to how a business should actually be run. Management surrounded by people who immediately answer 'Yes Sir'. They have sucked the life out of the company that used to be amazing. CEO and COO don't take responsibility over the weak commercial management. Let them get away with whatever they want, even if its to the massive detriment of the company. Whats left is a massively over valued company with no assets."}, {"review_title": "Love the company culture & the people. Management is not good.", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "12 Aug 2020", "job_title": "Anonymous Employee in Manila, Manila", "duration": "N/A", "pros": "- Very friendly and fun people to work with\r\n- Many opportunities to learn\r\n- Very instagrammable offices. have great lighting and overall vibe\r\n- Many employee engagement programs", "cons": "- No clear process on how to get promotion - no formal application whatsoever, the manager decides who gets promoted , not giving other people a chance to apply for a new position\r\n\r\n- Seems like business units are not very aligned, there's always miscommunication or lacking of information dissemination from top to rank and file\r\n\r\n- Different members of the upper management have very different directives which cause projects and plans to be continuously changed without any clear direction. It's confusing who to listen to\r\n- Changes are made abruptly without consideration of the consequences to its employees\r\n- Too many google sheets and 'primitive' tech tools that cause many delays in various processes"}, {"review_title": "My manager was not sure what she is even doing", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "21 Nov 2021", "job_title": "Business Development in Tokyo", "duration": "N/A", "pros": "One of the big tech established in Hongkong. You get to learn the industry.", "cons": "The recruiter just hires anyone and places them the position the candidates apply for. My manager had no experience of working as a manager and she was really bad at her job. She did not even know how things work on the Merchant's portal so she just advised me to ask someone else."}, {"review_title": "Poor Management", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "19 Jun 2020", "job_title": "Manager", "duration": "N/A", "pros": "Medical Plan \nAnnual leave \nFew good and make sense managers (very few)\nNice and helpful junior level staff", "cons": "Office Politics - prepare yourself to get stabbed from day one of your employment, you maybe human but working with all kinds of beasts in Rome Colosseum , turn yourself into beast is one of many ways to survive\n\nNonsense and immature management - Inexperienced director grade staff  ‘pretend” understand different biz/ vertical very well and make laughable decisions/ suggestions \n\nNo technology in a so called travel technology company\n\nHiding information and non transparent management- this ve been appeared in other reviews , not hard to understand the company might not want all level staffs to realize the company doesn’t make profit all along with very limited  margin and huge amount of overhead ...ipo seems to be the only exit and satisfy few’s greed\n\nShare Option is never an option on 99.9% of hiring for the Unicorn company"}, {"review_title": "Quick changes to adapt to pandemic", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "8 Dec 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Nice colleagues which are easy to work with. Young and vibrant environment.", "cons": "It could be tough some times and some managers don’t take care of their team well"}, {"review_title": "Good until it’s not", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "6 Sept 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- good colleagues and teammates \n- young vibes company", "cons": "- low salary \n- micro managing manager(s)\n- unstable higher level management \n- unable to place a competent head of department \n- unnecessary meetings (gosh! And most of them are unnecessary and lengthy)\n- some higher level managers are highly manipulative \n- your hard work won’t be appreciated\n- all town hall meetings just another empty promises\n\nBasically, the only reason i stayed was because my co workers and team members. But I know I gotta move on as I gain nothing from this company."}], [{"review_title": "Na", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "23 Feb 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Was good company in terms of benefits", "cons": "Micro management at most of the levels"}, {"review_title": "Company with great culture", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "17 Dec 2021", "job_title": "Project Manager in Hong Kong", "duration": "N/A", "pros": "Staff are nice and smart.", "cons": "Change and restructure happens very often that may not be easy to adapt."}, {"review_title": "nice people", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "17 Dec 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "nice people, young culture, lots of team building events", "cons": "long hours, can get messy sometimes"}, {"review_title": "good company", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "18 Nov 2021", "job_title": "Customer Service Representative in Kuala Lumpur", "duration": "N/A", "pros": "A good colleague\nGood environment.\nA good colleague\nGood environment.\nA good colleague\nGood environment.", "cons": "Strict apprenticeship period\nIt's not that bad\nStrict apprenticeship period\nIt's not that bad\nStrict apprenticeship period\nIt's not that bad"}, {"review_title": "Great company to work with", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "19 Dec 2021", "job_title": "Vice President", "duration": "N/A", "pros": "International team, fun, open and flexible", "cons": "covid, travel restriction, global coordination"}, {"review_title": "Great Place To Work", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "13 Dec 2021", "job_title": "Business Development Manager in Mumbai", "duration": "N/A", "pros": "- Work Culture\n- Decent Pay Structure\n- Flexibility", "cons": "- High Pressure\n- Low Support From Top Level Management"}, {"review_title": "A nice place to learn, give your all, and get appreciated", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "14 Oct 2021", "job_title": "Senior CRM Specialist in Jakarta", "duration": "N/A", "pros": "- Mobile working conditions (even before covid-19 time)\r\n- Internal mentorship and training available\r\n- Yearly salary adjustments\r\n- Bonus\r\n- Great coleagues", "cons": "- Competitive work environment\r\n- Not a good place to work in pandemic (as it is in other travel industry)"}, {"review_title": "Career Path", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "6 Dec 2021", "job_title": "Project Manager in Ho Chi Minh City", "duration": "N/A", "pros": "Good salary and benefits. Nice co-workers", "cons": "No development plan \nCurrent SOW will be 100% different compared to Job Descriptions"}, {"review_title": "I need psychotherapy to get through the toxic public shaming culture/ manager here", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "17 Aug 2021", "job_title": "Sales Team", "duration": "N/A", "pros": "Hardworking non-managerial employees, who are the only treasure in this company", "cons": "I've never seen such high turn over in a company, that's the first impression I had after 1 month working in Klook. I wish I had read glassdoor reviews before joining the team. This company has a good name but only till I was part of them to know it's rotten to its core.\n\n-Poor management style and public shaming culture\nThe worst is its vertical managers, micromanagement everywhere. Not only my department but I noticed it's a cross-department culture, managers would use bully language in public, in meetings, through Slack as their \"communication\" method, oh, and don't forget the threatening messages. Mine would constantly spit out four letter words!\n\n-Work over time is the norm\nThere is no extra hour pay, and since the business decisions are poor and the strategies are all over the place, commercial teams often times need to work over time. Extra hours is a norm for account managers. Since there is no customer support number for merchants, sales team need to be the customer support, meaning after working hour and over the weekends the AMs need to take the calls. \n\n-Wasting manpower operation\nFrom the outside it's a travel tech company but it operates in a traditional manual way. Another thing is tons of repetitive google sheets is the style of this company, but maybe it's the norm for start-ups. Also, be ready to try to find answers through decks of power points as no one is sure how the systems run.\n\nTo be honest I was thrilled to join this company but after my experience I could say everyone deserves better."}, {"review_title": "Company", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "13 Dec 2021", "job_title": "Associate Director", "duration": "N/A", "pros": "Open minded, fast pace company", "cons": "Long working hours, need improvement in people management"}], [{"review_title": "...", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "22 Nov 2021", "job_title": "Content Reviewer", "duration": "N/A", "pros": "Nice working environment, young dynamic coworkers", "cons": "it’s not easy to keep a work and life balance.\r\nsome teams should be more professional"}, {"review_title": "Low Pay Salary", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "8 Sept 2021", "job_title": "CEG in Kuala Lumpur", "duration": "N/A", "pros": "- Young and energetic managers\r\n- easy to communicate with other co-workers", "cons": "- excessive working hours\r\n- too much task with too little headcount\r\n- constantly ask for new intiative, but only money talks\r\n- not attractive pay with super massive workload\r\n- no bonus for 2021, lets see for 2022. :(\r\n- P level is the same if you jump to a different department."}, {"review_title": "Finding its feet in the ANZ market", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "21 Apr 2021", "job_title": "Business Development Manager in Sydney", "duration": "N/A", "pros": "Worked with a small, motivated team in Australia who truly believed in their mission. \r\nGood work/life balance and competitive salary.\r\nStartup growth environment, but with the stability of a well-funded company.\r\nRole would normally include travel perks and experiences (although this wasn't the case in 2020/21 due to COVID)", "cons": "Constant and rapid changes to business goals and team priorities may not suit someone who prefers consistency in their role. \r\nBackend systems are outdated.\r\nWorking in the travel industry during a pandemic can be emotionally draining (although this will not always be the case)\r\nOffice culture & team activities were lacking (again, mainly due to COVID/WFH)"}, {"review_title": "Good company", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "5 Dec 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "young colleagues Good company culture", "cons": "unclear future especially the travel industry"}, {"review_title": "Good culture with bad management", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "26 Sept 2021", "job_title": "Senior Associate in Kuala Lumpur", "duration": "N/A", "pros": "-People is friendly\n-Young culture\n-Average benefits", "cons": "-Paycut\n-Under pay salary\n-No bonus\n-Bad increment\n-No equal opportunity\n-Empty promises\n-Owner business mentality\n-Terminate employees without notice"}, {"review_title": "Be yourself", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "1 Aug 2020", "job_title": "Manager", "duration": "N/A", "pros": "-Most people are friendly\r\n-Nice working environment\r\n-Founders are very down to earth", "cons": "-Growing too fast and lost its own culture\r\n-Tons of google sheet and various platforms across different teams, wondering why they don't pay or build a centralized system to manage all the budgets\r\n-Heard that they are using Oracle, but we were still sending email for payment request\r\n-Unpractical approval flow and often take years for them to process a simple USD $1000 payment\r\n-Teams in China really need to improve their English, some of the manager level or above can't even communicate efficiently in English"}, {"review_title": "Don't get fooled by the company's scale", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "16 Mar 2021", "job_title": "Business Development", "duration": "N/A", "pros": "Talented and friendly colleagues (The only good thing I could say)", "cons": "Salary - much below than market price for all roles \r\n\r\nCommission - n/a (no commission for a business development role wth). Promised to implement commission scheme years ago but never happened.\r\n\r\nPromotion - Maintaining a good relationship with your manager is the only way. No one would care about your performance\r\n\r\nCulture - No work-life balance, working overtime and in weekends is a normal situation. No one would appreciate your efforts and success for the company as they only treat employees as a tool to finish their task and revenue."}, {"review_title": "Unprofessional Managers", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "19 Jan 2021", "job_title": "Supply Team in Hong Kong", "duration": "N/A", "pros": "Make no mistake start-ups are tough, BUT it used be decent, respectful, collaborative and motivating 2-3 years ago. But grew too big quickly and poor senior hires. Hope is can return to some of its glory.", "cons": "A lot of the (senior) manager are real bullys, its not uncommon to hear them publicly humiliate their staff. Some of the languages used are despicable & you often see junior staff crying in toilets and rooms after. It comes down to hiring staff who only cares about furthering their career than the company or coaching their team. HR and Management turns blind eye to this as they also only care who brings the revenue in, no matter how its done. Those managers are usually the ones to get promoted as well. Don’t expect any sort of “thank you/good work” for anything – if you do get one, its very fake and forced (feel like they were told by HR they must say those words only). There is management training but its basically a box for HR and the managers to tick."}, {"review_title": "Good company but bad employees", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "5 Nov 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great perks and benefits for employees", "cons": "Bad and terrible management (attitude)"}, {"review_title": "Move fast", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "17 Sept 2021", "job_title": "Senior Manager in Hong Kong", "duration": "N/A", "pros": "Flexible working location\r\nDiversity of colleagues", "cons": "Limited Tech resources \r\nTop-down and less empower people \r\nWeird structure on mkt vs supply"}], [{"review_title": "Good company", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "29 Oct 2021", "job_title": "Senior Engineer", "duration": "N/A", "pros": "Flexible work environment\nStrong team\nNice office", "cons": "Projects timeline can be too tight"}, {"review_title": "Still a place to flourish", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "10 Jun 2021", "job_title": "Strategy & Planning", "duration": "N/A", "pros": "If you’re looking for ownership and room to flex your talent, here’s still a good platform to flourish. Requires much patience, persistence and timed effort to build trust and traction.", "cons": "The travel market is volatile amidst COVID, so morale might be at record low. Yet I still believe we are on the same boat with the potential and ability to navigate the storm and gain traction in the global market."}, {"review_title": "The best!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "30 Jul 2021", "job_title": "Customer Experience Specialist", "duration": "N/A", "pros": "There are many benefits and new challenges along the way. In my journey, there were many helpful people who comes and give me guidance without hesitation", "cons": "Too many task and lesser headcount. With lesser headcount, the task is getting more but it's okay..we learn to push boundaries"}, {"review_title": "friendly", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "13 Aug 2021", "job_title": "Customer Support in Taipei", "duration": "N/A", "pros": "Klook has a lot of activities, team buildings, some bonuses if you reach the KPI, good team members, and leads.", "cons": "I honestly don't have cons to say cause this is a good company that I've stayed in before and I had a good time there."}, {"review_title": "Good experience but still too hectic", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "13 Oct 2021", "job_title": "Business Development Manager", "duration": "N/A", "pros": "Energetic people, lots of opportunities, young colleagues", "cons": "Too hectic, management, not much compensation"}, {"review_title": "Worst experience", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "29 Nov 2021", "job_title": "Marketer in Seoul", "duration": "N/A", "pros": "Rare travelling related IT company in Korea, only a few competitors exist", "cons": "Strongly disrecommend Korea branch, non-professional manager, non-experienced worker"}, {"review_title": "Child's play", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "12 Jul 2020", "job_title": "Marketing", "duration": "N/A", "pros": "- Flexible work style\r\n- Colleagues are nice and helpful", "cons": "- Poor management.\r\nInexperienced people are doing management so lots of confusion.\r\n\r\n- Poor business structure.\r\nThe structure of profit generation is poor. Try to acquire tons of product with a small profit from each. I do not know how to make profit from this business.\r\n\r\n- Disorganized organization\r\nExpansion is too fast and the productivity from each employee is extremely low due to unnecessary hiring.\r\n\r\n- Marketing is focusing on performance marketing\r\nMarketing is all about ROAS in this company. Not wrong but some people probably have another opinion.\r\n\r\n- Low compensation\r\nThe company's recruiter told us before we joined that 3-4 months salary equivalent bonus was provided in 2017 & 2018 so you can expect same level .\r\nBut it did not happen in 2019. Some people were obviously disappointed on this.\r\n\r\nThey provide only something over 1 month salary for people who has got A score. Yes, the bonus is based on business performance but it is impossible for me to expect a big bonus in the near future. \r\n\r\n- Sudden change of the role\r\nYour role and position might be changed even just after joining.\r\nThis happened to me and some people.\r\n\r\n- Culture is poor\r\nTheir core values are just copies of mixed of some other IT start-ups’ ones. \r\nThey are very plain like Customer obsessions, Act Fast, Transparent, Friendly… (Sorry I do not remember but you can imagine)"}, {"review_title": "Handles IT needs", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "28 Jul 2021", "job_title": "IT Officer", "duration": "N/A", "pros": "Klook has the best working culture. I am very impressed with the fact that the organization really cares for the employee.", "cons": "During the pandemic, most of the allowance has been revoked. It is very tricky and risky to apply during this time because lay off can happen any time"}, {"review_title": "Great Environment and Fun!", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "23 Apr 2021", "job_title": "Customer Service Representative in Kuala Lumpur", "duration": "N/A", "pros": "A very great cooperation between team leaders and agent. Klook always prepare something good for their workers to always motivate and inspire to do better in our daily working day. Team leaders will care for their agent whenever there is n issues occurs. Hence, you wil learn new things everyday and enjoy every bit of moment at Klook.", "cons": "Language barrier with our customer from another foreign country. Learning everyday to keep update globally. Due to pandemic the company are really affected , it is quite tough for the company as well, however their good leaders knows best."}, {"review_title": "Your experience is what you make of it", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "12 Oct 2020", "job_title": "Project Manager", "duration": "N/A", "pros": "- Bright and hardworking colleagues that are great to work with\r\n- Flexible work hours and location, managements trusts staff and focuses on results\r\n- Upper management really cares about staff wellbeing\r\n- If you can deliver the results, you'll be given many opportunities \r\n- You can craft your career here, they're flexible with internal mobility", "cons": "- Not perfect, things are still manual, communication can be better within and across teams, improvement is slow but at least it's constant\r\n- The company is still finding an identity that all can get on board with\r\n- Work is sometimes overwhelming, you can be pulled in all directions if you don't set boundaries"}], [{"review_title": "Company with the WORST management", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "3 Aug 2021", "job_title": "Booking Fulfillment Specialist in Kuala Lumpur", "duration": "N/A", "pros": "Working environment is fantastic, strategic office location, nothing much good about.", "cons": "Stupid HR and management. WORST team ever. The payroll of the night shift allowance had been delayed for 4 months."}, {"review_title": "Comments for Klook", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "2 Oct 2021", "job_title": "Business Development in Central", "duration": "N/A", "pros": "Fun working environment with good colleagues", "cons": "Fast paced environment, long working hours"}, {"review_title": "employees are somewhat disposable", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "8 Sept 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "flexible work environment (only certain departments)", "cons": "lots of conflict internally, employees' voices often unheard by the management"}, {"review_title": "Some serious issues", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "2 Apr 2021", "job_title": "Business Development Manager", "duration": "N/A", "pros": "+Getting your hands dirty, every day brings new and interesting challenges due to the state of the company and industry developments \r\n+Colleagues", "cons": "-Lack of experienced leaders, including the founding members\r\n-No clear vision/ business strategy. Employees feel lost overtime \r\n-No clear product proposition nor differentiation"}, {"review_title": "Fast growing company that needs experienced middle management", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "3 Jan 2021", "job_title": "Business Developer in Seoul", "duration": "N/A", "pros": "Enjoy working at a global startup. Different opportunities are available depending on the individual's competence. A fast-growing organization, creating company culture together. Recommend to someone who wants a career in the travel industry.", "cons": "There are too many inexperienced recruits. It may not be right for someone who is used to having corporate management much like in a large company. Needs to improve cross-division collaboration. The employees seem to work overtime frequently. Corporate welfare can be much improved."}, {"review_title": "Lots of things need to be improved", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "25 Feb 2021", "job_title": "Business Development in Xinyi", "duration": "N/A", "pros": "-Some great talents \n-Well-known brand in APAC\n-Better salary than their competitor (kkday)", "cons": "-Political culture in Taiwan office with no GM can help\n-Bad morale during pandemic \n-everyone is looking out \n-unreasonable target which you probably can’t reach even work 24/7, therefore everyone just want to get things done quickly and go off work \n-It’s difficult to give the bonus during COVID"}, {"review_title": "Great place to grow", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "3 Sept 2021", "job_title": "Content Specialist", "duration": "N/A", "pros": "It's a fast-paced environment where you can learn a lot", "cons": "Sometimes it's confusing over ownership of certain tasks"}, {"review_title": "GOOD BENEFITS", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "6 Sept 2021", "job_title": "Customer Experience Specialist", "duration": "N/A", "pros": "good benefits, friendly superior, good environment", "cons": "Retrenchment due to pandemic (covid-19）"}, {"review_title": "Work-life balance at the moment", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "11 Jun 2021", "job_title": "Senior Engineer in Shenzhen, Guangdong", "duration": "N/A", "pros": "The workload is not high due to the pandemic.\r\nTech leader is great, helpful for everything.\r\nColleagues are nice here.", "cons": "Salaries might not be the highest.\r\nTravel industry is not promising now, so if you desire to be very competitive, it is not a good choice."}, {"review_title": "Broken success story", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "20 Jan 2021", "job_title": "Marketing in London, England", "duration": "N/A", "pros": "- The team (not including senior management): You will find some of the brightest colleagues in the industry.\r\n- Opportunity to learn about the travel industry.\r\n- Good office benefits thanks to WeWork.", "cons": "- Senior Management: Lack of understanding of the travel industry (and they don’t listen to their employees to expand that understanding), aggressive communication style, no transparency.\r\n- Not a safe and open space. HR runs yearly surveys to ask about the employees’ happiness in the company but, if you are honest and express something they don’t want to hear, you will be punished (for example, they’ll put you on a probation plan for disagreeing). \r\n- HR. HR team only supports the senior management team, they are not interested in hearing their employees’ opinions. If your employees express shared complaints / issues in the company, please make something about it. \r\n- Aggressive manager. I have never seen so many people crying because of the manager’s communication skills. HR is aware of it and have never done anything about it. \r\n- Long hours. Be ready to work long hours every day, wake up at 2AM to take a call from Hong Kong or even work during weekends because you have to deliver a huge presentation in 24 hours.\r\n- Strategy keeps changing every day. I understand that the current COVID pandemic has affected (and is affecting) Klook’s strategy, but the Senior Management team keeps changing it one day to the other, without looking at proper data points to do it. \r\n- Lack of trust. Micro-managing style. If you want to succeed in the company, you will need to be your manager’s favourite and never disagree with him. \r\n- Lack of EU understanding: If you think that the UK is the only country that matters in EU, how do you want Klook to become a global company?\r\n- Manual business. Klook is a tech company, but it has the most traditional way of working. Expect to work a lot of hours in drafting presentations instead of really executing work.\r\n- Cheap company. They will try to retain as much money from their employees as they can.\r\n- Laying off lots of people and proceeding to post job openings on LinkedIn in the following week.\r\n- Could have been a great success story in Europe."}], [{"review_title": "It was alright", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "8 Feb 2021", "job_title": "Customer Experience Specialist in Kuala Lumpur", "duration": "N/A", "pros": "- Welfare\r\n- Nice office environment\r\n- Reasonable transport allowance\r\n- Very nice colleagues\r\n- Most of the leaders in my department were great", "cons": "- Extremely biased HR team\r\n- Overall an upper management that isn't very transparent\r\n- Our trainers did great, but overall not enough emphasis on actual quality. There were many agents who did not know how to solve extremely simple, straightforward and basic cases, and KLOOK did absolutely nothing to try to solve that. QA system isn't effective either, too rigid.\r\n- Selfish, overabusing leaders (not gonna specify who and from which department)\r\n- Unorganized SOPs\r\n- A lot of bad decisions made in regards to the CS department"}, {"review_title": "Great workplace", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "16 Aug 2021", "job_title": "Manager in Manila, Manila", "duration": "N/A", "pros": "Young, dynamic team, opportunities, growth", "cons": "Overworked, hustle culture, self learning"}, {"review_title": "Challenging time during Covid", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "23 Jul 2021", "job_title": "Business Development", "duration": "N/A", "pros": "New opportunities emerging as a result of Covid", "cons": "Also things are a bit chaotic during Covid"}, {"review_title": "Oversell and underdeliver in terms of work culture. Results in high turnover rate", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "28 Feb 2021", "job_title": "Booking Fulfillment Specialist in Kuala Lumpur", "duration": "N/A", "pros": "A company with great system and vision. They dont hold back on money to enable their workers to work efficiently.", "cons": "Top-down management, Accuse you of your mistakes in public chat group. Always outsource professionals to take up higher-up positions so don't expect to be promoted anytime soon."}, {"review_title": "Suitable for 20s if you’re hungry for challenges", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "13 Jan 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Good environment - nice office in city center, and flexible working hours.\r\nCool and friendly colleagues.\r\nGood name value (only in SEA/ HK).\r\nFast-moving company where you can actually learn new things everyday.", "cons": "Lack of organized training - basically 0.\r\n Lack of structure despite the growth in company size.\r\nPoor job design / Task variation.\r\nLack of transparency.\r\nNo clear goal of your KPI, neither career development plan.\r\nVery little recognition, Hard work will not get rewarded - depending on the team.\r\nThings are still manual, a lot of Google sheets and administrative work, although they identify themselves as travel “tech”."}, {"review_title": "Autonomy, Fast-paced", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "14 Jun 2021", "job_title": "Manager in Hong Kong", "duration": "N/A", "pros": "Lots of autonomy. Expected to lead initiatives from day one! Fast-paced and adapting to post-COVID world very well", "cons": "Sometimes need to work extra hours to get things done, but that comes with accomplishments and growth opportunities too"}, {"review_title": "Fast-moving company but lack of people management skills", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "17 Dec 2020", "job_title": "Manager", "duration": "N/A", "pros": "- Fast-moving company where you can actually learn new things everyday. Unfortunately, the company was hit by the COVID19 and that impacted a lot of people who were just hired and got laid off. You can also make a lot of friends here but some of them you probably can only count them as a colleague.\n- HR tries so hard to get feedback from you whether you are doing ok or not, however, whatever feedback you give them, it's just a feedback. I don’t really see any improvement after all. HR will ask you to speak honestly but I have no idea if my feedback has been taken into account. \n- There are Klookies where you can enjoy the company benefit and reimburse by year end. You can also enjoy Friday snacks and drinks from OX.\n- Flexible working hours, you can also work from anywhere, or even work from home as long as you can deliver the results.", "cons": "- Lack of people management skills, the hiring manager had problems with leadership and communication skills, did not know how to coach, but rather telling the team what to do. Without asking if this person is overloaded or comfortable in working for a special project.  Throwing people into some task that they are not expertise and with no direction, it’s really discouraging. \n- Your hiring manager may ask to catch up, you can express what you’re struggling with, but at the end, everything remains the same. So, don’t be surprised by this.\n- Issue with management strategy, tried to build a new business unit without doing proper research, some countries may show success, but that cannot apply to other countries, they should be aware of this. Hearing the top management saying ‘rather disappointing’ most of the time in the meeting, makes the staff who work in the project demotivated. They can say it, but at the end, I did not hear any solution or the new plan for improvement. Whatever you did good, they will never compliment or ask for best practice, but once you fail it, a lot of questions and complaints come. By the time you hear this every week, you will really get used to it and you won’t have any words to counter back because you have had enough. \n- There is no clear goal of your KPI or OKRs, the management always aims high but the target can be changed at least twice a month from what I saw. \n- There is no proper career development goal, you can write it down on year end review but after that, nothing happens. Hiring manager will never talk or communicate about this, if you would like to step up or promote, I cannot tell you as well what you should do."}, {"review_title": "Klook tried to destroy my career", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "23 Nov 2020", "job_title": "Manager in Hong Kong", "duration": "N/A", "pros": "Initial note:\r\nI've tried to give a fair review based my own experience and others as I observed during my time at Klook. Yes, my experience may not reflect everyone's, but I've done by best to describe both the good and bad as things are not usually all one or the other. Covid has seriously upended Klook's industry and almost their survival, and this has definitely created problems that don't have easy solutions. However, when times are good, problems are frequently brushed under the rug and overlooked. When times are bad, you have to face those problems, and ineffective leaders get exposed. Hopefully some of these issues will be addressed for future employees, as my experience was the worst of my career - I'm lucky to still have a career at all after what happened at Klook.\r\n\r\n- Good office location\r\n\r\n- Most coworkers are great to work with, and try hard. I really made a lot of great connections here.\r\n\r\n- Fresh fruit every week, and some other benefits that got canceled due to Covid\r\n\r\n- Probably some travel opportunities if no Covid\r\n\r\n- Some career advancement opportunity if you are on the right team (but on the wrong one, you will suffer and possibly be going the opposite way)", "cons": "- Below market salary\r\n\r\n- No equity (would expect at least a token amount given the salary level and startup stage)\r\n\r\n- Extremely long hours - most managers will expect you to work past midnight and on weekends. This is true across the business. You looking for a work/life balance? LOL.\r\n\r\n- Very little recognition - this has started to be addressed just recently, as people have made their feelings known that they don't feel recognized for their work. There are some token recognitions available now, but they mean little. The company culture is one that does not recognize effort and some simply take credit for other's efforts.\r\n\r\n- Extreme hierarchical structure - Oh, were you looking for a flat organization tech startup where your opinions are considered? Look elsewhere. This is not true of all teams, but from my experience (and hearing others'), you may be punished for taking initiative or having original ideas.  It was disappointing to observe the [position(s) redacted] remain unlikely to listen to others, simply giving orders and frequently wasting time as everyone waits their turn to speak with them. I had the opportunity to be managed by one of them, and would wait up to a week before messages were replied to. Emails and messages are missed on a weekly basis, so this would be a typical back-and-forth (I can't count how many times):\r\n\r\n[Position(s) redacted]: \"Why haven't you sent me the _______ about _______? I asked for this on Monday\"\r\n\r\nPeon: \"Sorry, I sent this to you on Monday, via email\"\r\n\r\n[Position(s) redacted]: \"Oh. Right. [frantically checks email for this message, among 2,000 unchecked emails] ..... [doesn't find it] ....... Well, I'll follow up with you after this meeting then\"\r\n\r\nSo, did you have a good idea to share? Forget it - Klook is not the place for that. You will sit down, listen to what you're told to do, and keep quiet. And this brings me to my next point,\r\n\r\n- Negative reinforcement, blame culture, public shaming - In at least 3 cases I personally witnessed the [position(s) redacted] mentioned above insulting, screaming, and embarrassing me or my coworkers in front of many others - I'm sure it was not limited to these 3 cases, and I frequently heard screaming in other meetings I was not present in. This was having a noticeable impact on people's mental health, to which I unexpectedly became a mentor/guide/listener to try and support people who were quietly suffering in silence. Before Klook, I had never experienced something like this. It is a total failure of leadership to shame someone in front of the entire team - it has no positive benefit, and simply lowers morale of everyone on the call. It was a real shock to see this, and we were powerless to do anything about it - not when the organization is heavily influenced by a stubborn industry veteran who is not open to new information. This leads me to my next point,\r\n\r\n- No people development or importance placed on people management - do you think you're a good manager of people? Would you like to develop your team to become better? Are you looking to develop yourself professionally? Again, this is not the place for you. In my evaluation, there was a 0% weight on people management and team development - it is simply not considered as a priority for Klook. With this kind of organizational reinforcement, managers reduce their efforts in this area (why would you spend time on something that gets you nothing), and eventually everyone suffers. Klook as an organization has very few effective managers, mostly because people are told this is a waste of time. \r\n\r\n- Wasted time and effort - the business is surprisingly manual, and you will find yourself still working on a lot of Google sheets and administrative work - this organization LOVES a presentation deck with a bunch of words on it. I can't tell you how many wasted hours I spent in meetings or drafting presentations to simply show the upper management we're doing things, rather than actually DOING THEM. If you love this kind of 'busy work', then this is the right spot for you. The underlying issue here is that some upper management do not trust their people to actually do things, and needs this kind of hand-holding rather than just allowing people the freedom to do it.\r\n\r\nI've tried to avoid the temporary Covid-related problems, because it wouldn't be fair to judge an organization on something that they can't control. All the things I've mentioned above are very controllable and will hold Klook back in the future. I can see they are just beginning to listen and change, but it's changing at a snail's pace - and a fraction of the speed of what a startup should be doing. \r\n\r\nEven the best performers were running for the exit and looking for other jobs, because their efforts simply weren't recognized - not a Covid problem. \r\n\r\nSo many great coworkers were given token promotions (change or addition in title, no change in compensation) and bided their time until they could find something better - sometimes jumping sideways, not up as they deserved - not a Covid problem.\r\n\r\nVery little positive reinforcement anywhere - simply an attitude of 'oh, you finished? here's the next thing'. It's a thankless approach that makes everyone feel worse, and like no one cares about the effort you put in - which engenders even less effort and creativity down the line - not a Covid problem.\r\n\r\nKlook is an extremely young organization (average age 28?) and needs guidance and leadership to be effective. Juniors and interns would be thrown to the wolves with no direction, because Klook doesn't place any importance on people development, and then they would be blamed for not performing up to expectation. Who's expectation? How can they improve if developing them is not a measurable goal or even mentioned in performance reviews? - not a Covid problem.\r\n\r\nI won't get into the ever-changing priorities of the business, unclear direction, and confusing business strategy, because this could be considered a Covid problem. I don't envy the people at the top during 2020, because it's been a difficult road. It was not easy to let people go twice, but necessary for the business to survive. Frankly I was lucky to keep my job at all, when so many others around me fell on their sword (well, they were pushed onto it). The sad thing is, there are so many great people at Klook who could be contributing so much more if they were doing meaningful work. If business leaders asked questions, or had any trust in the people below them, the whole organization could be exponentially more productive. I witnessed so many wasted days from poor communication where the [position(s) redacted] ruled with an iron fist, the people below them were simply trying to please them and couldn't understand their objectively poor directions. Now we're starting to get into 'not a Covid problem'.\r\n\r\nOne final note: I had the worst experience of my career here - I received positive feedback from everyone I worked with, worked long hours to try to impress (I had not failed at any position before this), and even raised the flag to HR when I thought something might be wrong. Unfortunately I ran into one of the people I referenced above, who demoted me, cut my salary permanently, and removed my direct reports - all based on no written guidelines or goals or anything. I had no recourse and was powerless to do anything but accept the judgment of someone who observed me for no more than a few minutes. For sure this experience did not happen to everyone, or else their Glassdoor rating would be much closer to 1 overall.  And, it may not happen to you.  BUT - are you willing to roll the dice? Klook offers a few different paths:\r\n\r\n- career progression with a below average salary and no equity\r\n- career stagnation, do a lot of busy work, work long hours, just do enough to get by and not get fired\r\n- career destruction where you will be forced to leave and take a lesser role somewhere else just to escape\r\n\r\nI hope people read this. Klook has a lot of great people that are quietly suffering. I would say flip a coin - heads, you'll have a good experience. tails, you'll regret it for the rest of your life."}, {"review_title": "its ok", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "12 Jul 2021", "job_title": "G M Knitting in Kilkenny", "duration": "N/A", "pros": "its really really really good", "cons": "its not reall that bad"}, {"review_title": "The company is better when there is no COVID-19", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "8 Jul 2021", "job_title": "Business Development Associate in Shenzhen, Guangdong", "duration": "N/A", "pros": "There is not much overtime work.", "cons": "The pay is not very high."}], [{"review_title": "Poor Salary", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "24 Jun 2021", "job_title": "Associate", "duration": "N/A", "pros": "- people, really nice colleagues who want to get the work done \r\n- project\r\n- exposure", "cons": "- salary\r\n- no career prospect"}, {"review_title": "terrible treatment of layoff/furlough staff", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "5 Jul 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "was good a few years ago.", "cons": "-terrible treatment of layoff and furlough staff: were told within a few hours to handover, leave, cut all communications, not allowed to let your partners know and return all equipment immediately. (its like you were getting punished..)\r\n-very bias: staff from OTAs in particular Agoda who joined 1-2 weeks before layoff were all happily kept while staff who didnt fit the senior management profile were let go.\r\n -no update from company since apr & zero support for layoff/furlough staff – (please dont reply to say you have followed the \"BARE min.\" local government regulations). should learn from similar companies on how to treat staff with respect and dignity.\r\n-hiring now is VERY disrespectful"}, {"review_title": "Onboarding during a pandemic", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "4 May 2021", "job_title": "Senior Business Development Manager in London, England", "duration": "N/A", "pros": "Such a welcome, despite everything being carried out remotely I've been made to feel part of the family and been given all the necessary tools to succeed in my role.", "cons": "I've not found any yet!"}, {"review_title": "Overall good time", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "31 Jan 2021", "job_title": "Frontend Developer in Shenzhen, Guangdong", "duration": "N/A", "pros": "Team is nice, less overtime, comfy office, can bring pet, medium stress, enough vacation, open environment.\r\nPeople care about technically aspects and set up tech sharing meetings.", "cons": "Not enough growth as a developer, not enough mentoring from team leaders or above. No solid career path and growth plan for the teammates from company. Business is heavily market centered, products don't usually get polished hence R&D team needs to fill up holes every now and then.\r\nSalary is below average."}, {"review_title": "Overall ok", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "27 Jun 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Benefits quite ok and good culture.", "cons": "hard to explore in different field."}, {"review_title": "Swift changes in management direction and approach while lacking in planning", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "22 Apr 2021", "job_title": "Finance Executive in Kuala Lumpur", "duration": "N/A", "pros": "Young and dynamic working environment", "cons": "Management direction is implemented whilst lack of planning"}, {"review_title": "Klook is going down the hill due to a weak Senior management", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "27 Jul 2020", "job_title": "Business Development Associate in London, England", "duration": "N/A", "pros": "- opportunities to know more about the travel industry and meet professionals/merchants\r\n- located in Paddington", "cons": "- too much power given to HR in Europe who doesn't necessarily think of the best for their employees\r\n- dramatical changes that oblige employees to constantly need to adapt to it. This is acceptable on the first growing stage but once you want to become stable so should be the processes\r\n- Decisions in terms of Business are only made by the senior management team based in Asia. No openness to let employees to express their ideas to improve our business\r\n- poor salary raise"}, {"review_title": "No bad experience, all good for now", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "1 Jun 2021", "job_title": "Business Analyst in Istanbul", "duration": "N/A", "pros": "I've never experienced rigid management issues", "cons": "The HQ do not communicate well with the employees"}, {"review_title": "No work life balance, low salary, no direction", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "4 May 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Coworkers are great and nice. Lots of people are really helpful.", "cons": "No work life balance, low salary, no direction"}, {"review_title": "Best work place", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "28 May 2021", "job_title": "Social Media Specialist", "duration": "N/A", "pros": "High salary\r\nGood environment\r\nNice team\r\nSmart oversea boss", "cons": "Nothing yet to complain about."}], [{"review_title": "-", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "28 May 2021", "job_title": "Customer Service Representative in Kuala Lumpur", "duration": "N/A", "pros": "Nice people, make friend there", "cons": "Upper management need to improve on the people management."}, {"review_title": "Young, constantly evolving, fast forward", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "13 Apr 2021", "job_title": "Customer Experience Specialist", "duration": "N/A", "pros": "Great local OX team that showers the team with good food and care even during the pandemic.", "cons": "High stress and tension due to constantly evolving business needs."}, {"review_title": "No clear business direction. Constant changes.", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "21 Jan 2021", "job_title": "Business Development", "duration": "N/A", "pros": "Fun offices, good and supportive colleagues.", "cons": "Continuous changes on the strategy. No transparency in the decisions."}, {"review_title": "KLOOK Taiwan", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "8 Apr 2021", "job_title": "Customer Experience Specialist in Taipei", "duration": "N/A", "pros": "Good environment among peers and colleagues", "cons": "Unexistent promotion opportunities, low salary and no bonuses. Management will hide firings until last day without prior notice."}, {"review_title": "review of an intenship", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "23 Apr 2021", "job_title": "Anonymous Employee in Seoul", "duration": "N/A", "pros": "good people and lot of opportunities to learn", "cons": "covid-19, the industry was negatively impacted"}, {"review_title": "Still a good place to work after-all", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "8 Sept 2020", "job_title": "Senior Manager in Hong Kong", "duration": "N/A", "pros": "- Good people - colleagues are smart and supportive\r\n- Good team - take the ownership, always work together to get things done\r\n- Lots of opportunities available\r\n- Leaders have clear vision and direction\r\n- Care for employees’ well-being", "cons": "- Lots of changes going on to keep up with market change, if you don’t like it\r\n- The company is still pretty young and still growing, so most of the things are still not quite structured"}, {"review_title": "CS in Klook", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "24 Apr 2021", "job_title": "Customer Experience Specialist in Taipei", "duration": "N/A", "pros": "good environment to work\r\nNice colleagues\r\nTeamwork", "cons": "No year end bonus in 2021"}, {"review_title": "Not really a start-up anymore....", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "27 Jun 2020", "job_title": "Assistant Manager in Taipei", "duration": "N/A", "pros": "What I really love about this company is those creative and brilliant minds! Most people (entry and middle level) that I work with are generally young and talented. Very supportive and professional at what they are doing.", "cons": "1. Top-down management style. Not really welcome or encourage new ideas \r\n2. Very political. Where is the entrepreneurship?!\r\n3. Poor cross- team communication \r\n4. Micro-management\r\n5. Lack of orientation and training. You need to be smart and agile enough to pick up with your work and the speed"}, {"review_title": "Adjfifk", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "6 Apr 2021", "job_title": "Customer Service Representative", "duration": "N/A", "pros": "Neat and tidy workplace. High salary.", "cons": "Lower chance you going to get permanent."}, {"review_title": "Startup", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "8 Apr 2021", "job_title": "Senior Manager in Kuala Lumpur", "duration": "N/A", "pros": "Flexibility in ideas, execution, working style", "cons": "Non competitive compensation, Long working hours"}], [{"review_title": "Great company in Travel Tech industry", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "25 Mar 2021", "job_title": "Business Analyst", "duration": "N/A", "pros": "Rocket speed growth environment to work", "cons": "lots of tiny tasks to do"}, {"review_title": "Good startup to join before the Corona Virus", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "9 Feb 2021", "job_title": "Business Development Manager", "duration": "N/A", "pros": "Klook is an ambitious company, offering a lot of autonomy and trust to its employees.", "cons": "APAC-centric company - could be harder to work for them from EU or US."}, {"review_title": "Great working environment", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "5 Mar 2021", "job_title": "Customer Experience Specialist", "duration": "N/A", "pros": "it is super nice to work with KLOOK due the it's environment", "cons": "the salary isn't that great but depends on your position"}, {"review_title": "good", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "21 Mar 2021", "job_title": "Business Development in Milan", "duration": "N/A", "pros": "team work team mates salary professionality experience", "cons": "career remote work benefits stability"}, {"review_title": "Stresssss", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "25 Feb 2021", "job_title": "Booking Fulfillment Specialist in Kuala Lumpur", "duration": "N/A", "pros": "Overall was good, colleagues is friendly with good culture", "cons": "Just that a bit cruel when they decide to downsizing the company by cutting staff"}, {"review_title": "Good place to work and grow in your career", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "26 Jan 2021", "job_title": "Manager in Mumbai", "duration": "N/A", "pros": "Technology first,\r\nData Drive\r\nInnovation first and leadership listened to many solutions on offer", "cons": "Nothing much at this point"}, {"review_title": "A great journey so far", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "12 Oct 2020", "job_title": "Manager in Hong Kong", "duration": "N/A", "pros": "- Colleagues are nice and smart. not much politics.\n- lots of possibilities and opportunities as the company is keep growing and still young.", "cons": "- travel industry is still strongly affected by Covid-19 and the impact continues so may not be the most promising industry."}, {"review_title": "Management", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "12 Jan 2021", "job_title": "Associate", "duration": "N/A", "pros": "Founders are very good, focused, trying to give best to the employees", "cons": "HR and Office experience team is worst, office experience team is dominating whole company, other team members are less important to the company, micro management,"}, {"review_title": "Great.", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "4 Mar 2021", "job_title": "Senior Web Designer in Hong Kong", "duration": "N/A", "pros": "Great environment to work at.", "cons": "It is sometimes too busy."}, {"review_title": "Rapid business evolvement without constructive fundaments", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "15 Jan 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Business sensitivity is pretty good with outstanding business negotiation ability and creativity.", "cons": "Lack of technical support, execution teams are not supported cross-functionally, maximizing the gap between reality and prospection."}], [{"review_title": "Best Place to Work", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "1 Feb 2021", "job_title": "Business Development Manager in Mumbai", "duration": "N/A", "pros": "- Great Team, Awesome talented minds, Career growth", "cons": "- Ideally, no cons that I have faced"}, {"review_title": "Just don't", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "15 Apr 2021", "job_title": "Anonymous Employee in Taipei", "duration": "N/A", "pros": "Nothing, everything is a mess", "cons": "Worst company I ever worked for, management has no idea what they are doing"}, {"review_title": ".", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "3 Feb 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Casual and flexible work environment", "cons": "Sometimes participants in meetings don’t have decision making power, which spent extra time in discussing"}, {"review_title": "Nice company with good culture", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "5 Feb 2021", "job_title": "Project Manager in Hong Kong", "duration": "N/A", "pros": "A lot of freedom. Flat hierarchy", "cons": "The business model is questionable"}, {"review_title": "Humbling opportunity", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "26 Aug 2020", "job_title": "Content Editor", "duration": "N/A", "pros": "Great team culture, supportive environment, weekly employee engagement programs, there's not a day that you won't be productive because results can be easily grasped", "cons": "Benefits could have been better, timezones can be a real pain when trying to reach out to other Klook offices"}, {"review_title": "Quite good", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "23 Feb 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Good Benefits, Active environments, Friendly Colleagues", "cons": "Unable to tell in details"}, {"review_title": "Good workplace for a travel tech start-up", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "20 Oct 2020", "job_title": "Product Content Editor in Manila, Manila", "duration": "N/A", "pros": "- Competitive entry-level salary\r\n- Young and fun work environment, occasional free food and events\r\n- Relatively small but nice office located in BGC, less than 100 employees in Manila", "cons": "- Not much room for career growth as an editor\r\n- Lack of organized training\r\n- Long work hours"}, {"review_title": "Narcissistic Management", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "2 Aug 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "-Before Covid, we have weekly workout class in the office\r\n- Most non-management staff are respectful and friendly", "cons": "Office Bullying\r\n- Managenent leads by fear. Public shaming, name calling, and personal insults can often be obeserved in the office. Managers would make up bizzare subjective reasons for extending staff's probation period. Even after we passed probation, they would go as far as threatening to put us back in probation, demote us, or reduce our bonus, just to make us work more. Some of us, despite working more, still got punished just because we didnt meet their unrealistic expectations.\r\n\r\nUnrealistic expectation on staff \r\n- It's common to see the company hiring junior staff and pay them low salary to have them handle the work of a manager with no support. Training is often provided months after the staff joins because either no one is fit to train or the trainer is unavailable.\r\n\r\nHorrible layoff and hiring practice\r\n- Hiring agressively during social unrest and covid. Sent out announment to staff that the company is doing fine, only to suspend and lay off lots of staff a month after. In some regions, staff are forced to take unpaid leave for 4.5 months.\r\nThe day they announced the layoff, they deactived those staff emails to cut communications. Because of this, they couldn't handover their tasks to fellow teammates. Those stayed with the company greatly suffered because they couldn't contact their teammates and lack suffucient information to perform the tasks done by previous colleagues.\r\n\r\n- Klook has a strong favor towards consultants but they didnt hire the best ones. Many of them have only 1-2 years of experience in consulting with no knowledge of the travel industry, yet serves a managerial role in the company. They have no clue what they are doing and are just faking it until they make it. When the underqualified has so much control over the company, it causes lots of chaos in our day-to-day work.\r\n\r\nLack work-life balance\r\nMost staff work 10-12 hours a day and sometimes weekends too. Expect Managers to send you meeting invite for monday morning at midnight. Lots of meetings are just for discuss ideas and hardly ever come up with solid plan of execution."}, {"review_title": "Best company to work with", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "12 Jan 2021", "job_title": "Business Development Manager in Hong Kong", "duration": "N/A", "pros": "Caring company and nice working environment with people around", "cons": "Long working hours from day to night"}, {"review_title": "Good and bad", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "25 Jan 2021", "job_title": "Anonymous", "duration": "N/A", "pros": "Always have new initiatives and supports from colleagues", "cons": "Poor management and hr. Also too many internal meetings."}], [{"review_title": "Good culture but 2020not a good year for travel comp", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "1 Jan 2021", "job_title": "Customer Experience Specialist in Kuala Lumpur", "duration": "N/A", "pros": "Friendly Culture, supportive teammates and awesome office", "cons": "Retrench due to the pandemic. Hope klook alright"}, {"review_title": "Nice working place but poor in people management skills", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "3 Jan 2021", "job_title": "Customer Service Specialist in Taipei", "duration": "N/A", "pros": "Friendly people, nice working environment", "cons": "Poor management system, not clear procedure, always changing"}, {"review_title": "Start up style", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "2 Feb 2021", "job_title": "Senior Associate in Hong Kong", "duration": "N/A", "pros": "Grow very fast, learn a lot", "cons": "Sacrifice yourself for company's fast development"}, {"review_title": "Global Start up in Travel industry.", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "4 Oct 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- Decent brand awareness in HK, TW &SEA\r\n- Global offices and fast expansions (Pre-COVID) \r\n- Young & Enthusiastic group of people", "cons": "- Lack of structure despite the growth in company size \r\n- Little to no benefit compared to other companies in the industry \r\n- Low talent retention & lack of experienced staff"}, {"review_title": "nice working environment", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "10 Aug 2020", "job_title": "Customer Experience Specialist in Kuala Lumpur", "duration": "N/A", "pros": "you can claimed up to RM600 a year when you purchase product on the platform itself.", "cons": "SOP always changing and will launch the new product daily so you have to kept update yourself to avoid giving wrong info and solution to customer"}, {"review_title": "Work environment", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "25 Nov 2020", "job_title": "Associate in Kuala Lumpur", "duration": "N/A", "pros": "Great place to learn, helpful peers", "cons": "Extremely fast paced, too much changes within the team"}, {"review_title": "Needs better organization and management", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "22 Sept 2020", "job_title": "Editor", "duration": "N/A", "pros": "Young, laid-back company culture; sufficient opportunity to learn different parts of the role and collaborate with others", "cons": "Management strategies are still confined to a start-up mindset despite the company's growth and pressing challenges; internal communications lack heart for employees"}, {"review_title": "Ummmm", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "6 Dec 2020", "job_title": "Associate in Taipei", "duration": "N/A", "pros": "Nice colleagues and comfortable working environment", "cons": "Salary is not that competitive."}, {"review_title": "A great tech  start-up company to work for", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "3 Sept 2020", "job_title": "Manager", "duration": "N/A", "pros": "Great vision and high energy colleagues", "cons": "Moving too fast and sometimes not able to keep up"}, {"review_title": "im sorry you are interested", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "20 Dec 2020", "job_title": "Business Development in Taipei", "duration": "N/A", "pros": "good product period nothing else. Super sad right?", "cons": "super bad management with a hierarchy management style throughout the entire company."}], [{"review_title": "For better or worse, it's a start-up", "rating": "2.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "1 Jul 2020", "job_title": "Business Development Associate in Ho Chi Minh City", "duration": "N/A", "pros": "- Flexible work style ( working from home)\r\n- The quota is not too tight.\r\n- People are friendly\r\n- The office is located in the convenient area", "cons": "- poor salary/bonus\r\n- The evaluation system is unclear\r\n- The criteria for promotion are unclear\r\n- KPIs quickly change\r\n- People quit quickly"}, {"review_title": "Endless growth opportunities", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "14 Sept 2020", "job_title": "Manager in Ho Chi Minh City", "duration": "N/A", "pros": "Lots of opportunities to learn and grow beyond your role and job scope.", "cons": "Quite fast pace with constant structural changes."}, {"review_title": "had strong growth prospects", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "18 Oct 2020", "job_title": "Business Development in Tokyo", "duration": "N/A", "pros": "strong growth prospect, competitive compensation", "cons": "culture and diversity is very poor"}, {"review_title": "Fast paced and lots of learning opportunities", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "29 Sept 2020", "job_title": "Marketing Associate in Kuala Lumpur", "duration": "N/A", "pros": "Steep learning curve with hands-on projects", "cons": "Lack of proper guidance and transparency"}, {"review_title": "Nice working experience", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "3 Sept 2020", "job_title": "Director, HRBP in Shenzhen, Guangdong", "duration": "N/A", "pros": "People caring, professional leadership and always hustling", "cons": "cross function cooperation\r\nAllocate global strategy in local"}, {"review_title": "Working environment", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "4 Oct 2020", "job_title": "Customer Service Specialist", "duration": "N/A", "pros": "Work-life balance, no politics, good environment", "cons": "Low salary, transparency, less benefits"}, {"review_title": "A good company for learning", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "21 Jul 2020", "job_title": "Manager", "duration": "N/A", "pros": "-Good employee benefit\r\n-Lots of chances for developing\r\n-Always have new things to learn", "cons": "-The constant change in company policy\r\n-Heavy workload"}, {"review_title": "International vibe, competitive pay, needs structure", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "6 Jul 2020", "job_title": "Business Development Associate in Taguig", "duration": "N/A", "pros": "If you are young and looking to challenge yourself through a startup company, this is the company to work for.", "cons": "lacks career opportunities for growth, travel isn't a necessity for now."}, {"review_title": "N/A", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "11 Sept 2020", "job_title": "Sales Development Representative in Amsterdam", "duration": "N/A", "pros": "Good colleagues, multicultural, everyone is able to make his voice heard", "cons": "Lot of changement every week"}, {"review_title": "Good", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "25 Sept 2020", "job_title": "Senior Executive Assistant in Mumbai", "duration": "N/A", "pros": "Multinational, travel, flexible, young, tech", "cons": "No Organised way of doing things"}], [{"review_title": "The best place I've worked at but also the most challenging!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "2 Nov 2019", "job_title": "Marketing in Kuala Lumpur", "duration": "N/A", "pros": "- Management, especially our founders, are approachable, down-to-earth and  always open to listen to feedback from the ground.\r\n\r\n- Generally a positively challenging environment where meritocracy and competence is rewarded. \r\n\r\n- You'll be fully empowered in your role... but that also means that you'll need to have a self-starter attitude to achieve your (and the company's) goals\r\n\r\n- Being apart of the growing + exciting tours and activities space where there isn't a clear leader (yet) is an amazing feeling and a great motivator to know that you get to make an impact!", "cons": "-There is still a long way to go to ensure benefits are on par with global tech companies but our amazing Office Experience team has been beefing things up around each office - free Monday breakfast spread, yoga / fitness classes, get-together activities... you just have to make sure you carve out time to join in. \r\n\r\n- I have heard that the recruitment process is a little long drawn (my experience is okay), but that came with its own reasons from the new joiners that I have met in the company - Klook is extremely selective in who they hire. That said, it's no excuse that the recruitment process leaves a negative impression on candidates when it should be the other way around. Definitely room to improve on this."}, {"review_title": "Good for Learning", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "6 Aug 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Good place to learn and honing your skill", "cons": "Poor management, too complicated SOPs"}, {"review_title": "good to work in KLOOK", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "23 Jul 2020", "job_title": "Clerk", "duration": "N/A", "pros": "the staffs are nice and good", "cons": "the working environment is really poor"}, {"review_title": "Great experience", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "4 Aug 2020", "job_title": "Marketing Manager in Mumbai", "duration": "N/A", "pros": "Best company to work for", "cons": "Lean structure which is normal in a start up"}, {"review_title": "Poor management, Don't expect work-life balance if you work here", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "28 May 2020", "job_title": "Manager", "duration": "N/A", "pros": "Nice colleagues (young and friendly)\r\nPeople here are super hardworking (stay till 9/10 pm is common)\r\nFlexible working hours", "cons": "- Poor senior management, don't treat employees as valuable asset to the company(force them to have no paid leave during COVID and after the no paid leave doesn't guarantee can back to work again. It said depends on the economic situation) \r\n- Some team are quite meaningless such as vertical planning (In order to survive keep suggesting unfeasible projects and keep overlapping other teams projects)\r\n- Keep recruiting lots of staff from the same OTAs to make Klook lack of its unique culture\r\n- lots of meeting to attend everyday (around 4 hours in total per day which makes you don't have time to focus on your own task --> to compensate you need to work overtime ) but the good thing is that you can get foodpanda as benefit"}, {"review_title": "Could have been great - shame about the leadership", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "21 May 2020", "job_title": "Anonymous Employee in Hong Kong", "duration": "N/A", "pros": "The base team are amazing. Some really fantastic colleagues. The company was going in the right direction for a long time, and then took a sharp change which is why it's left in so much trouble now.", "cons": "Sadly the \"commercial\" leadership is a joke. Complete lack of vision and strategy. Covid hit Klook in December, about 3 months before the rest of the world (because we're in Asia) but that should have given Klook the competitive advantage to get out ahead of it, build a strategy around how to engage with merchants and come out the other side. Instead the leadership has hidden under the carpet, occasionally coming out to tell us that we should negotiate harder with the merchants as they're now at a major disadvantage rather than work with them. \r\n\r\nAs a couple of other reviews have mentioned, there is a very tight bubble of people that sit around the commercial leadership (mostly from the same ex-company) which mean's there is a protective bubble around this incompetence."}, {"review_title": "Exciting Travel Startup", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "14 Jun 2019", "job_title": "Business Development", "duration": "N/A", "pros": "- A world class travel product\r\n\r\n- The tours and activities industry is fun and growing industry\r\n\r\n- A well funded startup  - $520 in fundraising\r\n\r\n- Partners are eager to work with Klook\r\n\r\n- Supportive and responsive teams based in China offices\r\n\r\n- Opportunity to be in on the ground floor and make an impact at a the travel industry startup", "cons": "- Some employee benefits and business travel-related benefits are not on par with most companies in the travel industry, but the Klook HR team is continuously working to improve them\r\n\r\n- Not a con, but we work with several international groups across multiple time zones, which may be challenging for some new hires."}, {"review_title": "Fantastic Place to Grow", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "25 May 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "My experience at Klook has been overwhelmingly positive thanks to:\r\n- a supportive manager who has been an incredible mentor \r\n- frequent collaborations with other teams and employees in various locations, truly feels like a global company\r\n- a fast-paced role \r\n- room to grow and get involved in projects that are not directly related to my role but allow me to explore my interests\r\n- really driven and ambitious colleagues", "cons": "Not necessarily a con but something to consider before joining Klook: it is not a cliche that this is a fast-paced environment and things change fast. You need to be comfortable with change and ambiguity. Also, not all processes are there yet so this company is best if you're a self-starter."}, {"review_title": "Exciting and dynamic travel tech company", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "14 Jun 2019", "job_title": "Business Development Manager in London, England", "duration": "N/A", "pros": "Fantastic colleagues and team spirit within each office; and also globally throughout the entire company. We all want Klook to be a success and there is a real sense of working together to achieve this. Everyone at Klook has a huge range of skills and experiences to learn from\r\n\r\nKlook is expanding rapidly, meaning lots of room for development and career growth if you are willing to work hard and show commitment. There is lots to learn in all aspects of the company as we continue to grow. \r\n\r\nSuggestions and concerns are always listened to and taken seriously, meaning continuous improvement in the way we do things \r\n\r\nGreat work benefits and team socials/trips", "cons": "The rapid global expansion means workload is high, but if you are well organised and  not afraid of a challenge it is manageable\r\n\r\nProcesses are continually being changed in order to improve efficiency, adapting to this can be challenging at times"}, {"review_title": "There were better days but still the best company I worked for so far.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "7 Jun 2020", "job_title": "Manager", "duration": "N/A", "pros": "People are still friendly, helpful. Despite the COVID situation, the company still trying to keep up the morale, this is difficult though in this macro environment", "cons": "There are lots of process, structure to be built, they are painful to scale but let's stay hopeful and contribute to this. People are right that initiatives take longer to execute and more barriers to work on in terms of cross functional projects/ communication\r\nAlso hoping to see better communication/ transparency in terms of promotion and development"}], [{"review_title": "Good start-up, but....", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "* nice colleagues\n* nice office \n* drink and snacks", "cons": "* no communication between managers and the lower level employees. They will only give orders, but no flexibility to listen any feedbacks from the subordinates.\n* poor management skills, most of time not even sure if they actually know what they are doing. And it seems like that they are more interested on the appearance rather than be concentrate on the quality. \n* no transparency between departments and with the informations.\n* Salary based on your race. If you are a foreign from Europe or America then be sure that you will have a higher salary even if you do not have any work experiences. \n* Will give you a promotion but with no salary increase.\n* always telling lies. It's really difficult to trust this company after all the lies they have told to their employees. Especially in this moment when they are laying off a lot of people after saying that we are a family and a lot of un-said words."}, {"review_title": "KLOOK needs company transparency", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "16 Mar 2020", "job_title": "Business Development", "duration": "N/A", "pros": "- Fast moving company which we can give ideas to work with flexibility\r\n- World leading company and expands the business to Europe/US not only in APAC\r\n- Flexible work place as long as we do our jobs to achieve targets", "cons": "- Not sure the company really has money to run operations because we do not know profits and management income/expenditure\r\n- Too many manual operations and various approval process, and very poor internal system\r\n- Company benefit is just to be given 150USD per year for purchasing products at KLOOK website\r\n- Very rare opportunity to have career advancement, there's only one chance at yearly review to know if persons are qualified\r\n- No women on executive job positions"}, {"review_title": "Great people but Poor Management. Work-life Balance is basically a myth!", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "5 May 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great and like-minded colleagues who are willing to help each other out, and play hard after office hours.", "cons": "Poor management who does not value talents in the company. People come and go easily inside Klook, and the situation could be totally different within few months only. The management/HR tends to exploit staffs, while benefits are only granted for the sake of building a nice company image on LinkedIn or media. While most of the staffs inside Klook are working till late nights and the only benefits that are beneficial to staffs are probably overnight transportation or foodpanda takeaway service."}, {"review_title": "Hyper Localization", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "18 Sept 2019", "job_title": "Anonymous Employee in Tokyo", "duration": "N/A", "pros": "At Klook we are entitled to grow business with full delegation for localization. Usually at Gaisi Kei companies headquarter demands to follow the ways they believe correct although they say they appreciate localization. But at Klook as we say Hyper Localization  we set objective, strategy, tactics, and even headcount planning once we align overall goals, which is very unique.", "cons": "For those who are seeking the places where key business frames are all set and want to focus on execution, it might be tough to work at Klook because we need to grow our business by ourselves defining the areas to grow and how to achieve goals."}, {"review_title": "\"Energetic vibes, poor management though\"", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "24 Apr 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- nice colleagues, most of them are young and fun \r\n- great office with deco", "cons": "- poor management\r\n- raising bureaucracy \r\n- underpaid salary \r\n- lack of company culture"}, {"review_title": "Great company with a very welcoming team!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "22 Dec 2019", "job_title": "Business Development in Sydney", "duration": "N/A", "pros": "- Team is very supportive and happy to help where needed. I find this particularly important whilst you're just starting out and trying to wrap your head around a new company and it's processes\r\n- The company is fast paced and growing quickly which means it's a great time to join\r\n- Very positive response from the industry around the company and it's growth in the market - merchants are eager to work with us\r\n- The company is willing to listen to suggestions and take on feedback on how to improve processes", "cons": "- It's constantly evolving and changing very quickly. If you don't like constant change and a company that is still developing streamlined processes this company may not be a good fit"}, {"review_title": "Poor culture", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "4 Nov 2019", "job_title": "Business Development Manager", "duration": "N/A", "pros": "- Good salary\r\n- Good insurance polity", "cons": "- Hierarchy: Managers like to give orders, not to listen to staff\r\n- No work-life balance: You are expected to work from 9Am to midnight, receive calls at anytime, and work over the weekend\r\n- Poor communication: People avoid calls and face to face meeting. Everyone likes to send emails and chat via slacks\r\n- Poor technology: The company is growing too quickly for technology to keep up with\r\n- No proper training and coaching programs for employees\r\n- There is nothing called \"punctuality\" in this organization"}, {"review_title": "Very good atmosphere", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "22 Apr 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- Everyone committed to make things better\r\n- Colleagues are always willing to go extra mile to support each out\r\n- Inspiring leaders\r\n- Challenging and truly impactful tasks to work on", "cons": "- Get prepared to work overtime when needed (but you'll have enough flexibility on your schedule and place to work)\r\n- KPI might be stressful to meet\r\n- Company is transitioning from startup to a large enterprise. A bit painful to establish new workflows / procedures. Might be counter-productive sometimes"}, {"review_title": "Fast paced, exciting work but lack of transparency and long term incentive to stay", "rating": "3.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "28 May 2020", "job_title": "Marketing", "duration": "N/A", "pros": "Fast paced work with high focus on execution with the opportunity to work on a variety of interesting projects", "cons": "-Lack of transparency for career progression and evaluation processes\r\n-Evaluation only takes place once a year, even though its a fast paced environment with initiatives evolving regularly and people coming in and out\r\n-No stock option program"}, {"review_title": "Not a Startup Anymore, It's a Corporation", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "12 May 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- Nice, proactive but humble, especially 3 of Klook founders. They are willing to listen to everyone's feedback, as always.", "cons": "Everything has been changed since the last funding(series D+) in 2019. \r\n- Overall growth and speed are slowing down.\r\n- Employees are getting lost in ownership and passion.\r\n- A lot of new joiners come from the same global company but all of them have not been affected by laid off. \r\n- Start seeing a rigid hierarchy among the teams, even colleagues."}], [{"review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "13 Jun 2019", "job_title": "European Coordinator", "duration": "N/A", "pros": "It's an exciting time to be at Klook with the growth they are experiencing in Europe and there's plenty of different tasks and projects to get involved with. It's enjoyable being part of a very multi-cultural multi-cultural team and everyone is fun, social and supportive. The company has a very start-up feel to it here in Europe and everyone is focused on achieving company goals. The recruitment process was very straight forward, an initial HR phone call followed by a face-to-face and finally a chat with the European Director.", "cons": "As the company is in its infancy here in Europe processes change quite often and new processes are being implemented, this may not be to everyone's preference"}, {"review_title": "Great at first, but uncessary hiring", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "14 May 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Very friendly coworkers\r\nMany intelligent people", "cons": "Growing too fast, that everyone tried to prove their worth, increase uncessary procedures and inputs\r\n\r\nResource wrongly allocated"}, {"review_title": "Fast Growing Company", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "18 Oct 2019", "job_title": "Anonymous Employee in Tokyo", "duration": "N/A", "pros": "- Company is growing fast globally \r\n- One of the Unicorn tech companies funded by Softbank Vision Fund\r\n- A lot of opportunities to work with global team \r\n- Mature coworkers with various background", "cons": "- Compensation is not competitive and employee benefits are below market standard \r\n- Need to be flexible as changes consistently happen\r\n- Need to be self starter as everyone is quite busy\r\n- May not feel that you are working at a startup company as it depends on the local office culture"}, {"review_title": "Awe at first but gradually turned bad and confusing.", "rating": "3.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "11 Jun 2020", "job_title": "Customer Service Specialist in Taipei", "duration": "N/A", "pros": "The immediate team is great and helpful. Team Leaders know how to listen and respond. The environment is great and bright.", "cons": "Management is very bad and seem to never one to give a clear answer to future endeavors when situation turn for worse. Kept employees on edge and confusion."}, {"review_title": "A fast-growing e-Travel company with strong ambition", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "18 Sept 2019", "job_title": "Anonymous Employee in Hong Kong", "duration": "N/A", "pros": "The company believes in their people and allow autonomy to have everyone as mini project manager to take the business to a higher level. In here you can see results very fast and it is a very good platform for people who like to build/create things. It is a company at a good size with global presence and the management allow employees to fail and learn then take it to the next level.", "cons": "Sometimes you might be too focus on getting the work done and so work outside the office hours"}, {"review_title": "A spectacular career journey!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "6 Nov 2019", "job_title": "Head of Culture & Office Experience in Hong Kong", "duration": "N/A", "pros": "- Proactive but humble senior management team\r\n- Collaborative culture that allow initiatives and projects to move forward constructively\r\n- Play hard, work harder! It not just about start up fun, the challenges everyday just keep your adrenaline level high and keep exploring.", "cons": "- Hyper growth, leads to lots of changes, have to be open mind, adapting while disrupting"}, {"review_title": "An amazing work place", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "10 May 2020", "job_title": "Customer Service Representative in Kuala Lumpur", "duration": "N/A", "pros": "- Detailed rigorous training\r\n- Humain & decent staff\r\n- nice perks : travel allowances & other benefits\r\n- non hierarchy \r\n- cool work place", "cons": "Can't think of any, the only unfortunate fact is that COVID-19 situation happened and none can blame the management for their decisions."}, {"review_title": "Great opportunity to be part of fresh  new team!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "13 Jun 2019", "job_title": "Linguist in Amsterdam", "duration": "N/A", "pros": "Being part of a new, growing team from the start. Opportunity to have input on setting up processes and ideas and opinion are very much appreciated by team members. Great team work! Very friendly, helpful and fun colleagues, great office space, lots of flexibility", "cons": "Since the team has only recently been set up, some processes are not in place yet which makes things a bit confusing sometimes when you are a new starter. But everybody is dealing really well with it, so this is actually not really a con"}, {"review_title": "Brilliant place to work with so many opportunities!!!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "10 Feb 2020", "job_title": "Talent Acquisition Manager in London, England", "duration": "N/A", "pros": "* The company culture is excellent and for me, this has always been super important! \r\n* Exciting times for the company\r\n* It's a brilliant time to be joining Klook with our global expansion \r\n* Huge amounts of learnings and exposure to really express yourself \r\n* Excellent career development/progression \r\n* Lots of opportunities to get involved in some very exciting projects which have a huge impact \r\n* Supportive managers", "cons": "I don't have anything negative to say about the company"}, {"review_title": "Fast-growing company, empowered to drive projects", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "28 Oct 2019", "job_title": "Anonymous Employee in Kuala Lumpur", "duration": "N/A", "pros": "- Management listens to feedback and advice\r\n- Empowered to drive projects\r\n- Quick and informed decision making without much red tapes", "cons": "Not so much a con, but Klook has a culture that is more suitable for certain types of people:\r\n- Fast paced and agile culture, requires employees who are comfortable with making mistakes and changing direction depending on results\r\n- Requires employees to take ownership of their own development and progression"}], [{"review_title": "Fun environment, great colleagues and a good place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "10 Feb 2020", "job_title": "Marketing Executive in London, England", "duration": "N/A", "pros": "Very talented people with a friendly team, even across departments and regional offices, and a great atmosphere in the office.", "cons": "Lots of very quick changes (a natural part of start-up development) mean you have to adapt quickly in response, and such a new company means some processes and procedures aren't fully established yet and there's some lack of clarity around this as things get put into place, but it's all part of the fun!"}, {"review_title": "Think before joining", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "24 May 2020", "job_title": "Manager", "duration": "N/A", "pros": "- Except for the senior team, the colleagues you work with are generally friendly and helpful.\r\n\r\n- Setting aside that the work may not make sense, the company for the most part move quite quickly.", "cons": "- As a tech company our tech team is very weak. A minor enhancement often takes months. Everyone often wonders what PM and Tech team are busy with.\r\n\r\n- The lack of data or automation is shocking. Getting basic data from the company is worse than pulling teeth. The amount of manual work in Klook is eye opening.\r\n\r\n- The \"People and Culture\" team is neither treating the team as people, or is creating a healthy culture. In fact, they tend to see people as numbers or statistics.\r\n\r\n- Structure changes are made without consultations or reasons. Many have left because they are put in a position where it differs from their skills or aspirations. (Perhaps that was done with an aim to save cost)\r\n\r\n- Promotion in this company is neither transparent or merit based. Most promotions announced are not recognised as merited by most of the peers. For example, the 3 senior directors that got promoted in the \"People and Culture\" team:\r\n> one is more like a glorified administrator and manages the boss well\r\n> one is a nice guy who defers all decisions until it snowballs into problem\r\n> one is a consultant who gives training without content or understanding of audience.\r\nIt is indicative of what the company sees in their senior leadership.\r\n\r\n- The founders are increasingly failing to offer a good vision for the team. They are showing signs of inability to handle the latest development, and is chewing on every opportunities when they see any slight mistakes by the team. Of course, excusing or blaming on others for all their past mistakes at the same time.\r\n\r\n- The company has a culture of avoiding bad news. Conducting a pulse survey after laying off 20% of the company is a curious choice of time. The likely excusing of poor results is already expected, and the team no longer expects any changes in this. The fact that Klook ONLY responds to 5 stars review here is a case in point.\r\n\r\n- The company only moves when the founders lends their weight or voice. Unfortunately, they are also not as receptive to alternative view, because they are so certain of their own intellect. They hire people in, who ends up just executing their will, without any understanding of where the company is heading."}, {"review_title": "Definitely not worth your time", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "31 May 2020", "job_title": "Manager", "duration": "N/A", "pros": "Nice and friendly colleagues\r\nFast-paced environment", "cons": "Everything is completely opaque; internal system, hiring, promotion, performance review, re-org, lay-off, PR, even company's vision. Klook has a culture that tries to hide everything and employees don't need to get to know where the company is headed / heading.\r\n\r\nEverything you've gone through Klook is meaningless. Company doesn't care about the employees' talents, career goal or growth and doesn't treat employees as valuable assets. Regardless of your talents or work performance, if you just don't agree with your BLM or ask HRBP for any help, you will probably be included in the list of layoff.\r\n\r\nKlook likes employees who have certain background and you can see that most managers/directors are from the same company which is another global OTA. (are you curious? go and search for linkedin)\r\n\r\nNo communication across business units especially supply and demand. No communication among the team members. There are a lot of internal meetings everyday but most of them are meaningless and the seniors are not willing to listen to the bottom line.\r\n\r\nEverything is a flash in the pan. All of projects went up as a rocket but came down as a stick."}, {"review_title": "I feel honored to work at a transcendental company like klook", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "5 May 2020", "job_title": "Business Development", "duration": "N/A", "pros": "- industry leaders, but extremely humble\n- successful, but so much more more room for improvement\n- extremely fast moving, no chance to get bored\n- senior leadership truly do care about all staff", "cons": "Extremely decentralized organization, video calls are normal. Would be good to see more face to face."}, {"review_title": "A company with unlimited opportunities", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "6 Nov 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Friendly and collaborative teams who are always aim high and with can do spirit no matter how challenging the tasks/projects are. Supportive leaders who always encourage ideas and feedbacks on how to improve the workflows and current processes.", "cons": "A very fast growing company whereby everyone are expected to be fast and go the extra miles to cope with the growth which some may feel that they could not have good work life balance."}, {"review_title": "Heartbreaking to see the company get to this stage", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "16 May 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- Non senior colleagues are happy to help and assist if they can (everyone just wants the work to quickly be done)\r\n- Co Founders are engaged and helpful, easy to approach and down to earth\r\n- Use to be a fun office environment with plenty of activities and perks. If you work overtime, they made sure that you can get transport and food covered.", "cons": "- Lots of reorg and changes (comes with being a startup, but this place tops how they inform staff)\r\n- Some teams are very corrupt. Majority of BD survivors are from the same OTA, newly onboarded ones are also from that same OTA. There is no fairness or transparency on how decisions are made, but if you have connection with the lead then you're safe. \r\n- Innovation, creativity, flexibility is a myth. If they promote something or create an initiative for the staff well being it's usually for media (eg. work from home during covid19 was only temporarily, making staff go back to the office in work shifts)\r\n- HR is unable to do anything if it involves senior management - lots of politics"}, {"review_title": "Best working environment I've ever experienced", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "13 Jun 2019", "job_title": "Senior Spanish Linguist in Amsterdam", "duration": "N/A", "pros": "I have started working for Klook recently and I am really enjoying the experience. The team is super supportive, everyone has time to listen to your ideas and are happy to make you a part of the creation process.  The working space is also great.", "cons": "There really are no cons so far!"}, {"review_title": "Dynamic, Fast-Paced & Fun", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "10 Feb 2020", "job_title": "People Operations", "duration": "N/A", "pros": "Klook is a fast-paced and exciting place to work for. In Europe, it feels very much like a start-up where you're able to make a meaningful impact on the growth of the business in this region.", "cons": "Nothing major. Be prepared for constant changes to operational processes as the business continues to grow at a rapid pace and find its feet. But this is to be expected in a start-up environment."}, {"review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "14 Jan 2019", "job_title": "Anonymous Employee in Hong Kong", "duration": "N/A", "pros": "the environment is amicable and creative, colleagues from the different region also help to think matters more thoroughly", "cons": "the company is growing extremely fast and pressure working with many talents, need to work hard and learn fast to keep it up"}, {"review_title": "Dynamic fast-growing company with great work culture", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "10 Feb 2020", "job_title": "Digital Campaign Manager in London, England", "duration": "N/A", "pros": "Opportunity to collaborate with other teams across the company.\r\nPositive working environment - team spirit is a big plus\r\nOpportunity to open up new partnerships with exciting brands.\r\nOffice dog!", "cons": "Growth targets are very aggressive so there is a need to be flexible to achieve them.\r\nAs the company is growing quick, there are a lot of restructures so again there is a need to be adept to change."}], [{"review_title": "Growing fast doing what tourists love the most", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "21 Sept 2019", "job_title": "Anonymous Employee in Tokyo", "duration": "N/A", "pros": "Think creatively and execute fast with the tourist-mindset\r\nNot afraid to try and fail, great place to learn how to work efficiently\r\nFlexible working hours with beautiful offices\r\nGreat colleagues joining every week, everyone loves traveling\r\nGlobal company, constantly talking with colleagues overseas\r\nMany companies willing to sell their products on Klook", "cons": "Growing at such a fast speed, need a better overview on what each team does"}, {"review_title": "Great fast-growing company with amazing culture fit.", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "13 Jun 2019", "job_title": "Europe Coordinator in London, England", "duration": "N/A", "pros": "Awesome people to work with\r\nGreat company culture (a lot of team building, pro-work from home policy, dog at work, fruit snacks provided!)\r\nPrivate healthcare provided", "cons": "The fact that we are growing so fast globally might scare some people. But if you like challenges, it is the right place!"}, {"review_title": "Global Scale-Up", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "18 Sept 2019", "job_title": "Project Director in Hong Kong", "duration": "N/A", "pros": "It really provides a global stage / platform for the people to dance and shine here, as long as you are ambitious and brave enough to take up the challenges, there is no boundaries.", "cons": "People here are working hard and you might feel a bit stressed to catch up."}, {"review_title": "Great Company Culture", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "18 Nov 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- Good benefits and care about the employees (I had an experience that company & managers have supported to my colleague when her family met with difficulties) \r\n- Nice colleagues and collaborative teams who willing to support and respect each other.\r\n- Hires well, trains well, and develops employees well.\r\n\r\nOverall this is good place to work and develop.", "cons": "I have no comment at all"}, {"review_title": "A working place filled with challenges!", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "1 Nov 2019", "job_title": "Marketing Campaign Management in Jakarta", "duration": "N/A", "pros": "- Fun working environment \r\n- Colleagues are nice and helpful \r\n- Fast growing company which provides a lot of challenges \r\n- Provide a steep learning curve which is a valuable experience for everyone", "cons": "- Need improvement on employee benefits and business travel-related benefits. However, Klook HR Team is working hard to bring improvement!\r\n-Work Life balance is a challenge since it is a start up company"}, {"review_title": "Great place to learn and develop oneself.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "28 May 2019", "job_title": "Sales in Hong Kong", "duration": "N/A", "pros": "Good employee perks, global presence, approachable colleagues, things get done faster internally.", "cons": "Grew too fast, processes and policies still under fine tuning."}, {"review_title": "A place with countless opportunities - suitable for ambitious talent", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "18 Sept 2019", "job_title": "Anonymous Employee in Hong Kong", "duration": "N/A", "pros": "Global Exposure\r\nFast Pace Environment\r\nLots of Learning Opportunities\r\nEncourage talent mobility", "cons": "Need to find a way to prioritize as too many things happening at the same time\r\nToo many new joiners - not easy to integrate"}, {"review_title": "Great startup", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "24 May 2020", "job_title": "Specialist", "duration": "N/A", "pros": "A lot to learn here, good for those who want to learn or kick start career", "cons": "Startup, a lot of SOP and policies missing. Also, cannot establish vision properly"}, {"review_title": "Great company, steady growth", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "13 Jun 2019", "job_title": "Business Development Manager in Amsterdam", "duration": "N/A", "pros": "Company vision and culture, colleagues willing to do the extra mile and share best practises.", "cons": "Nothing negative during my first month, everything seems to go smooth."}, {"review_title": "Good people, bad management. (Applies to tech departments only)", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "14 Jul 2019", "job_title": "Senior Software Engineer", "duration": "N/A", "pros": "Most engineers here are good person and easy to work with.", "cons": "1. No company culture, not a deal breaker, but a company without a core culture is not going anywhere.\r\n2. No training, not even onboarding training. Only a very dry tech sharing every other month.\r\n3. Bad management, CTO is a relatively young guy (~35yrs) who micro manages a lot. Personally, I think he qualifies for an engineering manager but no more."}], [{"review_title": "Great place to grow for your career", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "9 Mar 2020", "job_title": "Human Resources", "duration": "N/A", "pros": "-Treating people as a top priority\r\n-Recognizing the efforts and achievements. \r\n-Smart and passionate colleagues", "cons": "-Stil sees a room to grow for benefits but I think we are changing little by little."}, {"review_title": "Promising Start-Up Company", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "11 Jun 2020", "job_title": "Senior Business Development Associate", "duration": "N/A", "pros": "- Diverse teams\r\n- Flexible work arrangements\r\n- Challenging yet fulfilling work\r\n- Active management\r\n- Career advancement tied to personal performance and company performance", "cons": "- Some benefits promised were never given\r\n- No trainings/development programs for employees\r\n- Office politics; culture can either be inclusive or exclusive depending on your personality"}, {"review_title": "People and Culture", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "18 Sept 2019", "job_title": "Anonymous Employee in Hong Kong", "duration": "N/A", "pros": "Provides a real global stage for you to dance and shine, as long as you are ambitious and competent", "cons": "Colleagues are nice but seldom have chit chat with each other"}, {"review_title": "Disrupting the travel activities space", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "19 May 2020", "job_title": "Marketing in Kuala Lumpur", "duration": "N/A", "pros": "Dare to dream, go above the ordinary", "cons": "Need to be strong self starter"}, {"review_title": "Really love this company", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "12 Jan 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "I've been at other established blue chip places, and this is by far the best company I've worked for!", "cons": "Be prepared to adapt and change. Execute!"}, {"review_title": "Challenging but worth it!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "27 May 2020", "job_title": "BDM in Shenzhen, Guangdong", "duration": "N/A", "pros": "Challenging place to work but it's totally worth it!", "cons": "Can't think of anything in particular"}, {"review_title": "atmosphere is very different depending on which office you work at", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "3 Jun 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "lots of investment. new employees are smart.", "cons": "Some GM (country manager)s and department Heads are not qualified at all. Young and lack of experience, not knowing anything about people management."}, {"review_title": "Working Culture", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "30 Oct 2019", "job_title": "Senior Marketing Executive in Mumbai", "duration": "N/A", "pros": "- Exposure like no other company\r\n- A growing firm that allows your growth as well\r\n- You meet and talk to different teams around the globe\r\n- Truly recognized for your work\r\n- Pure work hard play hard.", "cons": "- If you're not a party person, you might become one."}, {"review_title": "Fun and great growing place", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "29 Oct 2019", "job_title": "Anonymous Employee in Kuala Lumpur", "duration": "N/A", "pros": "The culture and environment in the company are great and amazing. Lots of things to learn and people appreciate you for good work.", "cons": "It is not cons but people are very hardworking in Klook"}, {"review_title": "Poor Management", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "28 May 2020", "job_title": "Intern in Aberdeen", "duration": "N/A", "pros": "Nice colleagues average 28 years old", "cons": "Poor senior management and colleagues too afraid to be laid off under COVID"}], [{"review_title": "Looks fancy but not good in local", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "15 Sept 2019", "job_title": "Business Development in Seoul", "duration": "N/A", "pros": "Unicorn company and try to expand business globally.", "cons": "Local culture was really bad and some people had bad hierarchy and make rumors behind people' back"}, {"review_title": "Great place to work in fun environment", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "13 Jun 2019", "job_title": "Europe Coordinator in London, England", "duration": "N/A", "pros": "Team spirit, lots to learn with the company expanding rapidly and opportunities to develop internally", "cons": "Not sure if that's a downside, but if joining for a start up, be ready for constant change of operational processes"}, {"review_title": "Growing company, still building structure", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "26 Jun 2019", "job_title": "Assistant Account Manager in Bangkok", "duration": "N/A", "pros": "The company itself grow very fast, many things to learn", "cons": "Still building team structure, high turn-over rate (Depends on teams), not so good at work-life balance (especially for those who wants to respect non-working/resting hours)"}, {"review_title": "Great place to work in a startup environment", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "14 Jun 2019", "job_title": "Business Development Manager in Amsterdam", "duration": "N/A", "pros": "Hypergrowth company with a lot of opportunities, great team spirit, a lot of events and advantages for the employees", "cons": "Nothing special to mention so far"}, {"review_title": "Fast-paced environment that could use some more transparency", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "9 May 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- Very talented workforce\r\n- Ambitious and fast-paced", "cons": "- Lack of transparency\r\n- Lack of ownership"}, {"review_title": "Great place to work for self motivated person", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "18 Sept 2019", "job_title": "Marketing Manager in Tokyo", "duration": "N/A", "pros": "- Having a lot of opportunities to try new ideas\r\n- Supportive and smart colleagues\r\n- Great product", "cons": "- As for career development, there's room for improvement \r\n- Performance tracking is ambiguous sometime"}, {"review_title": "Great place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "2 Jun 2020", "job_title": "Associate Director in Hong Kong", "duration": "N/A", "pros": "Smart people and good culture", "cons": "Changing priorities and long work hours"}, {"review_title": "Klook is a place for all challenge seekers", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "31 Oct 2019", "job_title": "Localization Editor in Bangkok", "duration": "N/A", "pros": "You will be surrounded by nice and smart people and there's always something new to learn.", "cons": "The company grows really fast that sometimes  it's hard to keep up."}, {"review_title": "Great place to work at", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "23 Jan 2020", "job_title": "Paid Social Planner in Amsterdam", "duration": "N/A", "pros": "Very good recruitment process, talented people, best colleagues and advancement possibilities. Great company to work for, they really care about their employees.", "cons": "Nothing bad to about the company!"}, {"review_title": "Python", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "25 May 2019", "job_title": "Python in Shenzhen, Guangdong", "duration": "N/A", "pros": "Very nice Env, we can code at anywhere", "cons": "Not for now, but I guess that's why I am here"}], [{"review_title": "Working in Klook", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "19 Feb 2020", "job_title": "Customer Service Representative", "duration": "N/A", "pros": "Good salary. Great ambience. Good training.", "cons": "Racism, no progress for non-Chinese agent, biased Managers."}, {"review_title": "Assistant Account Manager", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "20 Jul 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Energetic and fast-paced company - able to learn lots of things", "cons": "People are very hard-working and sometimes you need to OT to finish all the tasks"}, {"review_title": "Fantastic Place to work!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "29 Oct 2019", "job_title": "Anonymous Employee in Kuala Lumpur", "duration": "N/A", "pros": "Young and fun culture with good bosses and open to feedback", "cons": "a fast-growing company with limited time to learn"}, {"review_title": "Good but no transparency as told", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "14 May 2020", "job_title": "Customer Experience Supervisor in Taipei", "duration": "N/A", "pros": "Work-life balance, Good environment, No office politics", "cons": "Average Salary, Bad cross-department communication"}, {"review_title": "Average Pay", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "24 May 2020", "job_title": "Business Development in Kuala Lumpur", "duration": "N/A", "pros": "Good colleagues and lots of opportunity on career advancement", "cons": "Do no expect work-life balance if you're applying for it"}, {"review_title": "Enjoyable company!", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "19 Sept 2019", "job_title": "BD Associate", "duration": "N/A", "pros": "Good environment to work with talented colleagues and new things are rapidly coming up.", "cons": "Still start up company and system tools are not established well."}, {"review_title": "Great place to work!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "18 Sept 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- Steep learning curve\r\n- Your voice is being heard by senior management", "cons": "- Can't really think of any for the moment"}, {"review_title": "Customer Experience Operations Manager", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "30 Dec 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Very challenge but you will gain more your wants", "cons": "There's a long hiring process"}, {"review_title": "Overall company is good", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "5 May 2020", "job_title": "Operations Associate", "duration": "N/A", "pros": "Good environment , Good benefit", "cons": "NO standard SOP system , system changing time to time make staff feel dizzy"}, {"review_title": "Overall was a good working experience", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "13 Nov 2019", "job_title": "Temporary Customer Executive", "duration": "N/A", "pros": "Colleagues, leader and manager are friendly", "cons": "so far there was no cons"}], [{"review_title": "Start-up companies", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "8 Jun 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Nice office；\r\nYoung colleague；\r\nFlexible working hours；", "cons": "Poor management；\r\nLess communication in different regions；"}, {"review_title": "Good", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "20 May 2019", "job_title": "AAM", "duration": "N/A", "pros": "Smart people, good company culture", "cons": "not much, the work life balance is good"}, {"review_title": "Manager", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "18 Sept 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Lots of potentials, Fast Growing", "cons": "Need to set up the process, Changes"}, {"review_title": "Assistant account manager", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "11 Jan 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Pros are Learning, Exposure, Benefits", "cons": "Cons are Work overload, Communication"}, {"review_title": "BD Senior Associate", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "10 Sept 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "International OTA focusing on TTDS.", "cons": "Low salary and raising bureaucratism."}, {"review_title": "Good", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "19 Nov 2019", "job_title": "Marketing Specialist in Kuala Lumpur", "duration": "N/A", "pros": "Good well, nice place to work", "cons": "Nothing bad, too good for work"}]]