[[{"review_title": "Good place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "18 Feb 2023", "job_title": "Assistant Professor in Singapore", "duration": "N/A", "pros": "Very Good research grant support", "cons": "Very high tenure standard and promotion"}, {"review_title": "Good depending on type of role", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "23 Mar 2023", "job_title": "Research Assistant", "duration": "N/A", "pros": "good work life balance. Good environment", "cons": "low salary for the qualification and years of experience"}, {"review_title": "Good welfare", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "6 Mar 2023", "job_title": "Executive in Outram Park,", "duration": "N/A", "pros": "- Staff benefits are very good, especially for individuals with children - Get to knock off work early occasionally - Value mental health and family time", "cons": "- Very hierarchical. Everything have to ask for permission before you do"}, {"review_title": "Good work-life balance and employee support", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "25 Feb 2023", "job_title": "PhD Candidate", "duration": "N/A", "pros": "Healthy working culture and ample learning opportunities.", "cons": "The exact work-life balance and job culture vary among different laboratories. Advisable to talk to lab members of the lab group before joining."}, {"review_title": "Work Life Balance", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "4 Mar 2023", "job_title": "Purchaser in Singapore", "duration": "N/A", "pros": "Manageable stress and clean office environment", "cons": "Slow movement in going up through the management."}, {"review_title": "Experience highly dependent on research group", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "11 Feb 2023", "job_title": "Doctoral Research Assistant in Singapore", "duration": "N/A", "pros": "Flexible working hours and low stress", "cons": "Overall research quality less than average"}, {"review_title": "Not recommended for a research career", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "20 Dec 2022", "job_title": "Research Fellow in Singapore", "duration": "N/A", "pros": "Flexible working hours for me, although this is similar in the UK/Aus as well. This is also highly dependent on the PI. If you have a Singaporean PI, be prepared to work like a slave. People are mostly friendly and are helpful, but some people (PIs) have their nose up the sky when they walk and don’t say thanks when someone else opens the door on the way in/out.", "cons": "Career There is no career progression in place and they mostly hire from outside to fill their “faculty PI position”, which is really outdated US system that promotes toxic competition. Research fellows are not allowed to apply for their own funding again becuz they are not “PI”. So what’s the point of doing a PhD or a research fellow at DukeNUS then if you are not allowed to get your own funding, co-supervise or supervise your own students at official capacity, and contribute to the uni and society, all of which are what research fellows should be exposed to as soon as they finish their PhD. Research environment Not very collaborative compared to some of other research centres I have worked in the UK/Aus. Common lab equipment not maintained very well, lab spaces are not maintained very well. Paints coming off the wall, mould spots on the ceiling tiles, no air pressure gauge on the wall, damaged spots everywhere on the lab vinyl floor. This is not that bad on Level 7 but shockingly bad on level 9 Emerging infectious diseases program. The building has dodgy and slow good lifts, and there are not enough (and badly designed) office spaces), which means some people are sitting/drinking in the lab with flip-flops. This is due to the fact that there is a giant hole in the middle of the building, silly/lazy design really. Not enough conference rooms and quiet rooms, and really bad AV infrastructure in these rooms with projectors and HDMI working less than half of the times, and are not ZOOM-capable thus screen sharing on half-ass HDMI-projectors. I find that the program retreat that I went (apparently this is compulsory) was a giant waste of a day. I saw PIs stroking each others ego all day long, food provided was ok, coffee served was horrendous. I instead went to Coffee Academic for a real cup of espresso. HR Slow as turtles. found a RAs through interview but this RA found an another job whilst waiting for DukeNUS HR and contract, UNBELIEVABLE. Others DukeNUS is located in SGH and is too far away from everything else. MRT/bus is on the outskirt of SGH, and no underground pass/shops from MRT into SGH either, what a planning eh. There is no decent cafeteria and food places around. Walking under the SG sun and humidity mid-day for lunch is just not pleasant at all. Claiming expenses (ie for conferences and travelling) and the process involved is just unnecessarily silly and protracted."}, {"review_title": "Education", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "19 Jan 2023", "job_title": "Senior Executive in Outram Park,", "duration": "N/A", "pros": "Good structure of management. Good middle training ground for education and healthcare administration", "cons": "Healthcare partners are difficult to deal with."}, {"review_title": "Good place to start your care", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "16 Jan 2023", "job_title": "Research Assistant", "duration": "N/A", "pros": "Friendly environment. Nice supervisor. Research", "cons": "A bit boring after 2-3 years. Less opportunity to grow"}, {"review_title": "Good place to hone research skills", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "9 Jan 2023", "job_title": "Research Fellow", "duration": "N/A", "pros": "Good staff benefits and nice colleagues", "cons": "Perhaps salary increment can be higher"}], [{"review_title": "NIL", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "26 Dec 2022", "job_title": "Research Assistant in Outram Park,", "duration": "N/A", "pros": "Flexible timing and professional working environment. Friendly staff", "cons": "Salary scale can be higher."}, {"review_title": "Good benefits, stable environment, slow progression", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "16 Sept 2022", "job_title": "Executive", "duration": "N/A", "pros": "It really depends on the department or team but the same goes for all workplaces, generally speaking the pay is decent, the learning curve isn’t steep and you can get work life balance in this environment", "cons": "If you like challenges or you’re looking for speedy career progression, you’re gonna be looking for a way out quite soon, but if you like routine and stability, this could be a really good workplace for you"}, {"review_title": "Great company, no-long term career growth", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "30 Nov 2022", "job_title": "Research Assistant in Outram Park,", "duration": "N/A", "pros": "Lots of learning to do Inspiring leadership Colleagues are very accomplished Work feels very impactful Compensation felt very fair Great work life balance", "cons": "No room for career growth unless you leave to pursue higher education"}, {"review_title": "Good place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "12 Nov 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Flexibility and a Friendly environment", "cons": "Some posts are not entitled to get AWS."}, {"review_title": "Good Learning Ground", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "7 Nov 2022", "job_title": "Executive", "duration": "N/A", "pros": "Friendly environment and growth opportunities.", "cons": "Can't think of anything at the moment."}, {"review_title": "Satisfied", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "21 Oct 2022", "job_title": "Associate Professor", "duration": "N/A", "pros": "Competitive salary, good leadership, opportunity for growth, high trust in employees.", "cons": "HR is not responsive to needs of the expats, slow."}, {"review_title": "Supportive environment for graduate students to succeed", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "12 Sept 2022", "job_title": "PhD Graduate Student in Singapore", "duration": "N/A", "pros": "1. Supportive faculty, particularly from PhD office\r\n2. Cutting edge research at the university\r\n3. Competitive stipends for students\r\n4. Regular workshops for students to develop vocational skills for those who want to move out of academia", "cons": "1. No housing allowance or subsidisation for students. Nearby housing is very expensive\r\n2. No CPF contribution for Permanent residents and foreigners"}, {"review_title": "Your experience vary depending on which lab you are in", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "20 Oct 2022", "job_title": "Postdoctoral Research Fellow in Singapore", "duration": "N/A", "pros": "Exceptional place to do cutting-edge research.", "cons": "Some management policies make very little sense."}, {"review_title": "Not the best", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "11 Feb 2022", "job_title": "Research Fellow", "duration": "N/A", "pros": "There are lots of resources for scientific research in terms of equipments, people are generally quiet nice to talk to.", "cons": "Not recommended if you are looking to progress your career here. In contrast to commonwealth system where people with a PhD degree can apply for research grants, at Duke-NUS (as well as NUS) you have to hold a principal investigator STATUS or assistant professor or above to apply, which is just plain silly. \r\n\r\nIf you are a mid-career researcher from commonwealth countries looking to apply here, i would not recommend it as it is difficult to move up the rank to assistant professor, even if you already are at lecturer or senior lecture position in your current institute. \r\n\r\nThe status of the lab is generally quiet massy, and definitely not purpose built for research. Office space is very limited as there is a giant hole in the middle of the building used for nothing."}, {"review_title": "Great research environment", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "18 Aug 2022", "job_title": "Research Fellow", "duration": "N/A", "pros": "good salary and research enviornment", "cons": "facilities can be more, such as gym, indoor sports..etc."}], [{"review_title": "Research Assistant", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "22 Aug 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Nice working environment.\r\n21 days annual leave.", "cons": "Laboratory is an open space."}, {"review_title": "Experience", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "27 Jul 2022", "job_title": "Senior Administrative Specialist", "duration": "N/A", "pros": "Generally a flexible organisation that looks after welfare of staff.", "cons": "Depending on reporting head, can be hard to get things done smoothly"}, {"review_title": "Purposefully disruptive", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "12 Apr 2022", "job_title": "Research Associate", "duration": "N/A", "pros": "Air conditioning. Wifi. Close to MRT station.", "cons": "Despite being a research institution, Duke-NUS is completely run by non-research administration departments (HR, Procurement, Finance) which have not only no research experience, but also an insistence that you must explain your research to them in terms they're able to understand in order to be able to purchase consumables or equipment, hire staff, or claim benefits.\r\n\r\nDoing any of these requires going through a maze of paperwork that is never the same twice, is redundant, and tedious. Now that so many of them work from home, and documentation is increasingly moved online, there is also the added frustration of having to do all of this 'paperwork' over buggy and clumsy computer interfaces."}, {"review_title": "Research Assistant", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "15 Jul 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Flexi working hours with opportunities to learn", "cons": "Too much politics in the work place to deal with"}, {"review_title": "Decent Workplace", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "17 May 2022", "job_title": "Research Associate in Outram Park,", "duration": "N/A", "pros": "Helpful colleagues, you learn a lot about how advanced medical research is conducted", "cons": "Very limited career progression, a lot of skills you have to pick up on your own"}, {"review_title": "Overall a decent workplace", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "30 May 2022", "job_title": "Research Assistant", "duration": "N/A", "pros": "Good working environment, decent annual leave", "cons": "There are not many employee benefits"}, {"review_title": "A great opportunity", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "2 Apr 2022", "job_title": "Senior Executive", "duration": "N/A", "pros": "Great working environment with very supportive leadership and colleagues. Renumeration and other benefits such as health insurance, paid leaves are very comprehensive and generous! Overall a great place to work!", "cons": "I have no negative feedback from my experience."}, {"review_title": "Good management", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "9 May 2022", "job_title": "Executive in Singapore", "duration": "N/A", "pros": "Management is good and thinks for employees", "cons": "Cant think of any cons so far"}, {"review_title": "Good work life balance", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "16 Apr 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "1. Good work life balance\r\n2. Emphasis on growth\r\n3. Supportive management", "cons": "May not command the highest pay in the industry"}, {"review_title": "Great working environment", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "12 Apr 2022", "job_title": "Communications Specialist in Singapore", "duration": "N/A", "pros": "Good location, good compensation and benefits, great colleagues", "cons": "Can't think of anything right now"}], [{"review_title": "Average overall.", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "14 Oct 2021", "job_title": "Executive", "duration": "N/A", "pros": "It really depends on the Prof or PI and dept you are working for. Recently, they have become more slave drivers during pandemic because of lack of trust in work from home situations. Some become very insecure with employees working from home. \n\nSalary is average among the industry. Not the best, but not the worst either.\nColleagues are friendly and helpful, but it depends on your dept. \nOffice location is central and accessible to MRT.\n\nGood if you like medical research because organization had received good publicity in the news media recently.", "cons": "Profs do not care about the wellbeing of staff. Maybe lip service only. \nHR staff in charge seems to change frequently.\nSalary is average."}, {"review_title": "Awesome work environment", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "2 Apr 2022", "job_title": "Ph D Student in Singapore", "duration": "N/A", "pros": "State of the art technology and research equipment", "cons": "small campus with not much to food options around."}, {"review_title": "Duke-NUS is a dynamic workplace for academic research", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "11 Mar 2022", "job_title": "Senior Research Fellow in Singapore", "duration": "N/A", "pros": "Cutting-edge, Innovative, collaborative, prolific in publishing", "cons": "Not as well paid as other institutes."}, {"review_title": "Postdoc", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "15 Mar 2022", "job_title": "Postdoctoral Research Fellow in Outram Park,", "duration": "N/A", "pros": "open, supportive and friendly environment\r\ngood academic atmosphere", "cons": "same as all postdoc cons"}, {"review_title": "Stagnant career, poor HR management", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "6 Oct 2021", "job_title": "Research Fellow in Singapore", "duration": "N/A", "pros": "Seminars used to be conducted frequently, if you're interested in keeping up to date with research or keep an eye out for potential collaborators, these are excellent opportunities. \r\n\r\n21 days of annual leave seem to be generous, as compared to the industry. Working hours are generally flexible, if your boss doesn't require you to be glued to your desk. \r\n\r\nLab manager was very efficient, but this obviously varies among labs.", "cons": "HR is a huge problem. Ironically, the department is unprofessional to say the least, other than not being productive or responsive. Whistle blowers within Duke-NUS don't get protected, information gets leaked to the miscreant, and the bullying gets worse. Under a professional setting, all the highly unacceptable behaviours are getting brushed under the rug as \"lab mismanagement\", unless you are being physically or sexually assaulted. Anything leading up to, but short of that, will be filed under mismanagement, and you may very well lose your employment because you stood up for yourself. \r\n\r\nGifting is not a common practice, but as there are no strict rules regarding this, it has been observed that people who frequently provide gifts seem to escape any form of repercussion from being unprofessional. \r\n\r\nThere are no guidelines on promotion, you could be in the same lab for 10 years and remain as an ordinary RA or RF, or your direct supervisor could be your friend outside of work, and you'll get promoted within a year. \r\n\r\nPublication is an issue as well, whoever gets the PI's ear will get dips on half completed work, just to finish off some tail end bits to acheieve a first author paper. Your RAs get hijacked by the very same people. It's a dog eat dog environment.\r\n\r\nLab safetey is an issue, with this much neglegience going on, people leaving mice carcess in the fume hood, liquid nitrogen tanks not shut properly, 4 degree room door getting jammed (users having difficulty getting out of the room). Unless you have a stringent floor manager, your life in the lab will be very trying."}, {"review_title": "Nil", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "10 Feb 2022", "job_title": "Web Designer", "duration": "N/A", "pros": "Good environment to work at.", "cons": "Not much to say for this"}, {"review_title": "Admin", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "24 Jan 2022", "job_title": "Assistant Manager in Singapore", "duration": "N/A", "pros": "Working environment is acceptable and do not have to OT", "cons": "Work not being recognised. Management bias. Slow career progression."}, {"review_title": "Great place to work at", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "25 Jan 2022", "job_title": "Postdoctoral Research Fellow in Singapore", "duration": "N/A", "pros": "Vibrant environment\r\nNice people to work with", "cons": "Many red tapes\r\nLack of storage space"}, {"review_title": "Working culture", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "29 Oct 2021", "job_title": "Research Assistant", "duration": "N/A", "pros": "Company SOP structure is ok", "cons": "Toxic working culture seems to be accepted if you can produce results. People who behave badly are let go off just because they can still work satisfactorily while bullying others.\n\nOvert favoritism. Some staff are quite obvious \"the pet\" of the managers."}, {"review_title": "Worst department", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "9 Dec 2021", "job_title": "Executive", "duration": "N/A", "pros": "Lots of leave days (21 days)", "cons": "- bad management\r\n- subtle racism\r\n- not enough guidance for newbies"}], [{"review_title": "-", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "8 Dec 2021", "job_title": "Grad Student in Singapore", "duration": "N/A", "pros": "Friendly culture, active collaborations, nice central location in Singapore", "cons": "Not much, just far away from good lunch places"}, {"review_title": "Salary", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "21 Feb 2022", "job_title": "Postdoctoral Research Fellow in Singapore", "duration": "N/A", "pros": "Education, quiet, slow pace, academic", "cons": "Lack of professional growth, poor salary"}, {"review_title": "Ok salary", "rating": "3.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "7 Dec 2021", "job_title": "Research Assistant in Singapore", "duration": "N/A", "pros": "Random university holidays given before public holidays", "cons": "No 13 month bonus for employees"}, {"review_title": "Great Environment, a bit overly administrated", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "30 Nov 2021", "job_title": "Research Officer in Singapore", "duration": "N/A", "pros": "Generally the Academic there are very helpful with ideas and technique.", "cons": "You will need help to navigate the admin site"}, {"review_title": "Good", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "6 Dec 2021", "job_title": "Research Fellow in Singapore", "duration": "N/A", "pros": "Respect the people and good", "cons": "Have no more comments for here."}, {"review_title": "Working for almost 4 years", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "8 Nov 2021", "job_title": "Senior Executive in Singapore", "duration": "N/A", "pros": "I’ve learned a lot and gained a worthy experience from my reporting manager", "cons": "Salary is not comparable to other international private education institution"}, {"review_title": "Good place to learn new things", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "30 Sept 2021", "job_title": "Research Fellow in Singapore", "duration": "N/A", "pros": "Diverse community and passionate colleagues to work with.", "cons": "Working hours can be really long."}, {"review_title": "Nice culture", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "3 Oct 2021", "job_title": "Researcher", "duration": "N/A", "pros": "Good colleagues good boss good food", "cons": "Far from mrt, pay not so high, bonus depends"}, {"review_title": "nA", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "4 Oct 2021", "job_title": "Senior Research Assistant in Singapore", "duration": "N/A", "pros": "Suitable common lab equipment is regularly updated by the Research operations.", "cons": "NA NA NA NA NA"}, {"review_title": "Cutting edge science, poor HR management, hostile lab environment", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "27 Nov 2020", "job_title": "Senior Research Assistant", "duration": "N/A", "pros": "The school frequently host seminars covering a wide range of topics. Working hours are rather flexible. The facilities in terms of scientific equipments are satisfactory. Research operations do a great job in maintaining safetey regulations and upkeeping of the equipments. There are fun extracirriculum activities organised a few times annually.", "cons": "Unequal distribution of bench and office space was a huge issue, many departments are overcrowded, yet some smaller departments are running at 40-50% space capacity.\r\n\r\nIt is rather common for labs to have bullies. Victims of bullying remain silent in fear of retribution from perpetrators as they are friends with HR.\r\nThere is a huge hierachy system, and the PIs are often unaware of the inappropriate behaviours going on in their own lab. There are staffs who clearly require anger management therapy. Some frequently show hostile emotional outbursts or often misconstrue situations to PI, some choose to physically slam objects in the lab. Extreme favouritism was observed, so was ostracism with abuse of power."}], [{"review_title": "Research fellow", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "26 Sept 2021", "job_title": "Research Fellow in Singapore", "duration": "N/A", "pros": "Challenging projects, learnt a lot of skills", "cons": "Salary is low and progression opportunities little"}, {"review_title": "Good place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "29 Jul 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Nice place to work, good environment", "cons": "none none none none none"}, {"review_title": "Na", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "20 Jul 2021", "job_title": "Management Assistant Officer in Singapore", "duration": "N/A", "pros": "Flexibility \r\nTrust between staff and teams", "cons": "Too far from MRT\r\nSlow promotion"}, {"review_title": "Great for learning", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "8 Jul 2021", "job_title": "Research Assistant in Singapore", "duration": "N/A", "pros": "Helpful reporting managers, great teams", "cons": "Salary could be slightly higher"}, {"review_title": "Good place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "17 Jun 2021", "job_title": "Senior Research Fellow in Singapore", "duration": "N/A", "pros": "Enjoyable and useful research work done", "cons": "Nothing much of a con for me"}, {"review_title": "Nice working environment", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "12 Jun 2021", "job_title": "Manager in Outram Park,", "duration": "N/A", "pros": "Open, Diverse group of colleagues", "cons": "trainings outside what is given by NUS are\r\nrare"}, {"review_title": "Excellent multicultural environment", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "1 May 2021", "job_title": "Full Time Faculty in Singapore", "duration": "N/A", "pros": "co-operative, English used, excellent support from admin and other faculty", "cons": "No obvious problems. Could have closer interaction with hospital which is trying to reinvent itself as an academic clinical centre."}, {"review_title": "Senior Executive", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "22 Apr 2021", "job_title": "Senior Executive in Singapore", "duration": "N/A", "pros": "Fun colleagues, lots of food choices around, good location, understanding bosses, management provide learning and self-development opportunities", "cons": "Work can get repetitive some times, the development courses take away work time and have to work OT to complete tasks"}, {"review_title": "Great place with good facilities", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "11 May 2021", "job_title": "Post Doctoral Research Fellow", "duration": "N/A", "pros": "Clean and new building. Friendly staff", "cons": "There are not really any cons."}, {"review_title": "Very Good", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "1 May 2021", "job_title": "Senior Associate in Singapore", "duration": "N/A", "pros": "Good work environment.\r\nProvide all the support facilities.", "cons": "Too much pressure for meeting deadline"}], [{"review_title": "Collaborative atmosphere", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "17 Mar 2021", "job_title": "Senior Business Development Manager in Singapore", "duration": "N/A", "pros": "work life balance , great colleagues and the opportunity to stay in touch with cutting-edge medical research", "cons": "Poor leaders ( at least in my office )"}, {"review_title": "Above Average Workplace, Great School", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "12 Apr 2021", "job_title": "Research Associate in Singapore", "duration": "N/A", "pros": "Flexible working environment, ample leave, open-minded research culture.", "cons": "Endless stream of work, little career progression."}, {"review_title": "Enjoyed my time working here", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "4 Mar 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Comfortable, lots of learning opportunities, good company activities and a peaceful work environment", "cons": "Low to average pay, but considerably higher than most local research jobs. No/slow growth, as with most research jobs."}, {"review_title": "Work-Life Balance", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "21 Mar 2021", "job_title": "Accountant in Singapore", "duration": "N/A", "pros": "Bosses are flexible and do not micro-manage staffs\r\nJob rotation between departments are possible", "cons": "Slow pay increment\r\nLow chance of job rotation within department"}, {"review_title": "Good environment", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "12 Apr 2021", "job_title": "Senior Executive", "duration": "N/A", "pros": "Compensation is above market rate", "cons": "Nothing much to complain, overall good"}, {"review_title": "Lab", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "6 Apr 2021", "job_title": "Research Assistant", "duration": "N/A", "pros": "Flexible working hours, supposedly less stressful environment", "cons": "Difficult claim system, low bonus and pay raise."}, {"review_title": "Feel great to be part of such an ecosystem!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "24 Nov 2020", "job_title": "Postdoctoral Research Fellow in Singapore", "duration": "N/A", "pros": "A conducive environment that promotes interactions between different research programmes filled with many brilliant scientists. \r\nExcellent faculty members to nurture early career scientists.\r\nGreat early career scientist ecosystem.\r\nMany opportunities to interact with different scientists from different research programmes to gain different perspectives/insights, all with the common goal of finding therapeutic solutions to complex diseases.", "cons": "Long walking distance from train station but can't be helped."}, {"review_title": "Great facility, good science, toxic lab environment,  poor HR management", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "27 Nov 2020", "job_title": "Research Assistant in Singapore", "duration": "N/A", "pros": "Safety regulations are strict, lab equipments are mostly well maintained. The building is maintained very well, always in tip top cleanliness even before covid.\r\nThere appears to be good staff interest activities from time to time. Working hours are flexible. There is a good opportunity for learning if your schedule allows for attendance in seminars. (This is based only on one lab which I'd worked in) Despite the hierarchy, most postdocs encourage RAs to participate in project discussions and generally value our skillset. RAs are generally get the opportunity to work independently. The in-house supply store is rather well stocked. There is a good culture of helping one another out among labs, irregardless of being in different departments.", "cons": "(This is based only on one lab which I'd worked in) There are quite a handful of members who really require anger management therapy or psychiatric help. \r\n Postdoc with aggressive behaviour and temper outbursts often malign others, often misconstrue ongoings in the lab to the PI. The lab had lost several outstanding postdocs and RAs because of these malicious sabotages, and project stealing. PI had failed to protect lab members and made a poor judgement call to promote someone who clearly lacks maturity, leadership qualities, and emotional/mental stability. \r\n\r\nLab members generally remain silent after verbal and emotional abuse, in fear of retribution from the perpetrator who will worsen the bullying. \r\nA lot of inappropriate and highly unprofessional behaviours had been observed over the years. Most common observation throughout the past years are ostracism, temper tantrums, extreme favouritism, emotional manipulation through gifting, and poaching RAs they have befriended from other labs. HR's mismanagement in overlooking repeated offence could partly be due to personal friendship with perpetrator. There is no safe channel for staff to express their distress. There are also members who smash objects in the lab or slam doors or objects around the building (though to clarify, never at people). \u2028\u2028Whistle-blowing policy covers a wide range of unacceptable misconducts, including mismanagement of funds, falsifying data, and physical abuse. Unless you are ready to record all of your time spent in the lab to gather evidence of abuse, you won’t be taken seriously. \r\n\r\nThe salary is not enticing, and the finance department is not efficient in reimbursing claims."}, {"review_title": "Overall good working environment", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "4 Mar 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "People are nice in general and generally pretty good work life balance.", "cons": "Equipment are starting to become slightly outdated, some poorly maintained."}, {"review_title": "Decent workplace", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "26 Oct 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- Senior management are very understanding and friendly, colleagues from HR are helpful. PAs of senior management are one of the nicest people you will meet\r\n- Health benefits & vacation leave \r\n- Recognition of effort/work\r\n- People are generally pretty nice\r\n- Staff Townhall conducted twice per year to keep staff informed about the organisation", "cons": "- High turnover rate in dept resulted in unbalanced workload which then affected your promotion as well as achieving your original KPIs \r\n- Unclear job direction"}], [{"review_title": "Great work-life balance", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "4 Jan 2021", "job_title": "Executive in Singapore", "duration": "N/A", "pros": "Very good employee benefits, doesn't have to OT a lot", "cons": "Not a challenging, fast-paced workplace if that is up your alley, HR can be very slow and the same goes for career progression"}, {"review_title": "Coordial culture and great colleagues", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "17 Jan 2021", "job_title": "Administrative Assistant in Singapore", "duration": "N/A", "pros": "Management is good and they provide proper training. Culture is cordial and friendly.", "cons": "typical politics at the management level, but doesn't concern me"}, {"review_title": "Good research environment, state of the art technology", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "16 Jan 2021", "job_title": "Postdoctoral Research Fellow in Singapore", "duration": "N/A", "pros": "good work culture and collection of scientists", "cons": "hard to get pay raise"}, {"review_title": "Good working environment to grow", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "11 Jan 2021", "job_title": "Senior Research Assistant", "duration": "N/A", "pros": "Good work life balance and environment", "cons": "Not much progression unless you further study"}, {"review_title": "great school", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "8 Jan 2021", "job_title": "Senior Research Fellow in Singapore", "duration": "N/A", "pros": "good support staff and interesting seminars", "cons": "none so far. can no comment"}, {"review_title": "quite nice research institute", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "4 Dec 2020", "job_title": "Graduate Student in Singapore", "duration": "N/A", "pros": "good research opportunity\r\nnice environment\r\nnice colleagues", "cons": "peer pressure\r\na little bit higher work load"}, {"review_title": "Good scientific environment for young scientists", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "21 Oct 2020", "job_title": "Postdoctoral Research Fellow in Singapore", "duration": "N/A", "pros": "The environment is open, and encouraging for new ideas", "cons": "not much I can complain about"}, {"review_title": "so so", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "22 Jan 2021", "job_title": "Research Fellow in Bedok New Town,", "duration": "N/A", "pros": "housing subsidy for foreigners available", "cons": "no career advancement for PhD holder"}, {"review_title": "Amazing place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "2 Oct 2020", "job_title": "Research Associate", "duration": "N/A", "pros": "Promotes growth of staff. It's a good place to learn.", "cons": "No downsides. It's a good place to work."}, {"review_title": "Unfortunate", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "14 Oct 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Decent salary and medical benefits", "cons": "Terrible supervisors and human resource management. Employee turnover rate is incredibly high. Employers do not care about the wellbeing of the employees and the work environment is unfortunate. Your workload is piled high because people keep leaving for a reason."}], [{"review_title": "Okay", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "27 Sept 2020", "job_title": "Research Assistant II in Singapore", "duration": "N/A", "pros": "School environment\r\nNice food around this area", "cons": "No campus library\r\nHigh workload\r\nUnequal opportunities"}, {"review_title": "Not much scope for growth", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "11 Sept 2020", "job_title": "Research Assistant in Singapore", "duration": "N/A", "pros": "Generally friendly atmosphere and managers", "cons": "Lack of career prospects, micro-managing style."}, {"review_title": "Nice", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "10 Aug 2020", "job_title": "Senior Executive in Singapore", "duration": "N/A", "pros": "Great working environment, flexible bosses and great work-life balance.", "cons": "Salary a bit on the low end"}, {"review_title": "Great Experience", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "16 Aug 2020", "job_title": "Research Fellow II in Singapore", "duration": "N/A", "pros": "Excellent Professionalism and good working environment", "cons": "no downside, overall very satisfied"}, {"review_title": "Great Atmosphere", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "3 Aug 2020", "job_title": "Senior Executive in Singapore", "duration": "N/A", "pros": "Great place to work in.", "cons": "No downsides to working in Duke-NUS"}, {"review_title": "Pros and Cons", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "15 Jul 2020", "job_title": "Manager", "duration": "N/A", "pros": "Work Life Balance. Overall a pleasent place to work", "cons": "Limited progression and career growth"}, {"review_title": "Very Meaningful Research, but Poor Internal Processes and Procedural Thinking", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "15 Jan 2020", "job_title": "Research Associate in Singapore", "duration": "N/A", "pros": "- Many research project of good standards, with substantial international exposure\r\n-Relatively decent work-life balance, depending on your project type and supervisor overseeing the project\r\n- Good leave benefits\r\n- Opportunities to learn from practitioners, experienced academics, and overseas expert visitors\r\n- Culture is generally friendly, cordial and respectful. Relatively egalitarian academic work culture\r\n- Nice and youthful students around to learn and build some rapport with", "cons": "- Many internal procedures to navigate, with little attempt to make it easy for newcomers or insiders to understand\r\n- Processes are full of jargon, convoluted language, and intricate rules\r\n- Multiple layers of processes are needed to get simple tasks complete, such as paying vendors and processing claims\r\n- Some incompetent Principal Investigators are prone to overt as well as subtle bullying behaviour\r\n- If unrestrained, research projects are potentially unlimited for each individual to take on and handle\r\n- Uneven and unclear workload among different staff members\r\n- Job is on a contract basis, putting research employees constantly on edge. Not clear why research employees should be more invested than some research investigators"}, {"review_title": "Being a research assistant at Duke-NUS", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "22 Oct 2018", "job_title": "Research Assistant in Singapore", "duration": "N/A", "pros": "Flexible environment (Depends on the lab you join)\r\n-Working hours are fixed on paper but as long as you clock your required amount of hours and do your work well no one ever bothers you\r\n\r\nVery friendly work environment (Depending on which signature programme)\r\n-I happen to have worked in 2 separate signature programmes and both showed quite vastly different interlab relations. Depending on what you like do ask around how the environment is like.\r\n\r\nMany talks on current research\r\n-Every week or 2 there will be a presentation/talk about current research in the respective fields attendance is completely optional so you can attend which ever talk interest you. Helps to give motivation when doing research as well as to provide an avenue for networking.", "cons": "Due to the difference in lab culture some environment is much harsher than others, so it would have been good if there were people to ask prior to joining a particular lab."}, {"review_title": "Researcher", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "7 Jun 2015", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "The facilities they have are pretty good. I would say the research at Duke-NUS is of good standard. There are always seminars to encourage people working in different labs but the same field to share their findings. This helps to promote communication and interaction.", "cons": "I guess every workplace has its own politics and it is no difference there. Stay focus and maintain the enthusiasm at work are important."}, {"review_title": "Varies vastly between labs and centres -  do your research, speak to people", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "3 Oct 2016", "job_title": " in Singapore", "duration": "N/A", "pros": "Great facilities - good amount of workspace, cheerful bright building, new compound , plenty of social and recreational activities organised", "cons": "Depends largely on the specific lab/centre you are joining. Overall the school is a good place to work - but each centre/lab varies vastly ; my advice is - do your research by talking to people who already work at that specific place -"}], [{"review_title": "Good work environment", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "18 Dec 2018", "job_title": "Research Associate in Singapore", "duration": "N/A", "pros": "Very well-funded laboratories, provide good access to equipment and clean glassware in the labs. High Profile speakers are invited to give talks very frequently. In general a good environment for networking and collaborating with other teams.", "cons": "At times it can feel like you have to deal with a lot of bureaucracy. Little attention was applied to turning off lights and equipment in the labs after use and in the evenings."}, {"review_title": "Great Place for Work-Life Balance", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "3 Nov 2019", "job_title": "Associate Director in Singapore", "duration": "N/A", "pros": "Great bosses and encourage a work-life balance culture. Supportive  & helpful colleagues. A good range of staff benefits and staff recreation activities that engaged staff all year round.", "cons": "Nothing I can think of :)"}, {"review_title": "Admin position", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "21 Aug 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "cant really think of much.... probably the location is good?", "cons": "- Most terrible workplace and management I've ever since (pertaining to my own dept)\r\n- company supposed to have flexible working hours but my boss didnt approve all our requests\r\n- company allowed working from home once a week, however, all our dept staff were issued a desktop, so how to work from home?\r\n- paper work all the way, very environmental unfriendly\r\n- very very manual work, no system for databases\r\n- super micromanagement style\r\n- very inefficient"}, {"review_title": "Good place to be at", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "10 Feb 2014", "job_title": "Research Associate in Singapore", "duration": "N/A", "pros": "good place to work at if you have the right boss, flexible working hours, great central location", "cons": "compensation might be quite low in some groups, very important is the group you work in; finance / hr departments are not great or helpful enough"}, {"review_title": "Highly collaborative, entrepreneurial, learning atmosphere", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "11 Mar 2015", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Best for PhD students and Medical Students\r\nOpportunity to learn more than just textbook science, learning by doing being the motto\r\nGreat work-life balance mostly", "cons": "Not enough training and career growth opportunity for postdocs"}, {"review_title": "Research Fellow at Duke-NUS", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "18 Jul 2017", "job_title": "Postdoctoral Research Fellow in Singapore", "duration": "N/A", "pros": "Duke-NUS provides intellectual freedom, a competitive salary and good facilities. Of-course much of it depends on your lab PI and colleagues.", "cons": "Just like any government institution, there is a lot of red tape. The functional rules and structures are rigid which generally results in wasted time."}, {"review_title": "Good life and work balance", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "4 Dec 2014", "job_title": "Post Doc in Singapore", "duration": "N/A", "pros": "Flexible working hours - be discpline yourself\r\nSupportive environment of collegues\r\nExposure to various types of research\r\nGood work and life balance", "cons": "No fire exit in the lab area. \r\nA 2-year contract of post-doc position does not give a good career perspective in the future."}, {"review_title": "Good and Fair workplace", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "13 Apr 2017", "job_title": "Research Fellow in Singapore", "duration": "N/A", "pros": "Enjoy working in Research. Fair employer, good salary and benefits, good vacation leave. No discrimination. Opportunity for professional development and learning, courses for staff.", "cons": "Working hours are long and we expected to work weekends frequently. No overtime compensation, no leave encashment. Difficult work-family life balance."}, {"review_title": "Great environment with great benefits", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "3 Sept 2017", "job_title": "Research Fellow", "duration": "N/A", "pros": "Highly stimulated environment with various science discipline spread over various floors. \r\nGreat staffs benefits such as medical and leave.", "cons": "Highly competitive environment. Lack of any career progression for academia other than through fundings and publications. Focus on publications and grants more than individual talents."}, {"review_title": "Comfortable work environment and great work culture", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "12 Feb 2015", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great work environment and work culture. Work-life balance. Emphasis on continuous improvement. No micromanagement.", "cons": "Promotion is very competitive and limited. Bonus and pay increment low."}], [{"review_title": "senior research assistant", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "15 Nov 2016", "job_title": "Anonymous Employee in Bukit Merah Estate,", "duration": "N/A", "pros": "Good work life balance, Good environment, Multi cultural people to work with, excellent infrastructure, good principal investigators, nice place for networking", "cons": "Not enough options for progress, small institute (has to collaborate with others for high end equipment use), lack of community activities"}, {"review_title": "Work life balance can be better", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "14 Sept 2015", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Salary is competitive, and the environment is great. However, can be required to work very late quite often at times.", "cons": "Work life balance is not really there, which is definitely the most important consideration ppl will have"}, {"review_title": "Good education, poor mentoring", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "12 Jun 2018", "job_title": "PhD Student in Singapore", "duration": "N/A", "pros": "Small, personal, international, good location", "cons": "Poor mentoring, good mentors are often not available due to restriction on number of student already there"}, {"review_title": "Interesting and challenging work. Love the work nature", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "19 Oct 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Love the work nature. Challenging and interesting.", "cons": "Poor working environment. Staff are not responsive to emails and phone calls. Working attitude has to be improved."}, {"review_title": "A good place to work", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "6 Aug 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Duke-NUS has a diverse pool of principal investigators, research associates, students and administrative staff. Its building is modern and centrally located.", "cons": "Advancement is based primarily on the academic ladder."}, {"review_title": "good place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "21 Mar 2013", "job_title": "Research Assistant in Singapore", "duration": "N/A", "pros": "good, nice building, love it. and nice people there. many conferences and collaborations. Canteen is nice with tasteful food and good price", "cons": "not close to MRT. no shuttle from MRT"}, {"review_title": "Good research organisation", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Overall very good experience, strong research environment. Lots of young researchers and students, good facilities. Also good salary and benefits, 13th month bonus", "cons": "No real cons that I can think of"}, {"review_title": "Work-Life balance", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "7 Nov 2019", "job_title": "Manager in Outram Park,", "duration": "N/A", "pros": "Open door management style. Caring employer who looks beyond work performance, cares for your well-being. Promotes cohesive bonding amongst colleagues.", "cons": "Can't think of anything yet."}, {"review_title": "Research Assistant at Duke-NUS Med Sch", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "8 Jul 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "-Good benefits\r\n-Standard hours\r\n-As its own HR and Finance department\r\n-You get both Singhealth and NUS benefits", "cons": "-Not much cons, very standard job\r\n-The food around Duke-NUS sucks"}, {"review_title": "Good research", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "26 Feb 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Diverse team of researchers to work with", "cons": "Administration is slow and not all groups are culturally inclusive"}], [{"review_title": "Great research environment", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Great environment to start career. Positive encouragement and knowledge sharing among colleagues. Dedicated PIs in research.", "cons": "Term contract based opportunity. Job stability is something to consider."}, {"review_title": "Great experience", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "19 Aug 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "The colleagues are friendly and the research environment is stimulating.", "cons": "The hiring process for foreigners is slow. It may be due to work visa application."}, {"review_title": "Friend atmosphere and smart colleagues", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Working environment is friendly and Duke-NUS recruit quite a lot of PIs from overseas", "cons": "A bit far from A-star and NUS/NTU"}, {"review_title": "Very nice workplace, love the friend atmosphere", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "21 May 2014", "job_title": "Post-doctor in Singapore", "duration": "N/A", "pros": "Nice office culture, everyone nice", "cons": "Very good, compensation enough, personal growth many"}, {"review_title": "One of the leading research labs in Asia.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "6 Aug 2017", "job_title": "Research Assistant in Outram Park,", "duration": "N/A", "pros": "Ideal environment for research.", "cons": "Depending on which lab you are in there may be lot of politics."}, {"review_title": "Great place for postdoctoral research", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "23 Sept 2019", "job_title": "Postdoctoral Research Fellow", "duration": "N/A", "pros": "Great collaborative environment.  Good research infrastructure.  Great diversity in research  areas", "cons": "Low scope for salary upgrade or repraisal"}, {"review_title": "Friendly environment", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "21 Dec 2019", "job_title": "Non-acad Staff in Singapore", "duration": "N/A", "pros": "Friendly work environment, slower pace compared to outside.", "cons": "Slow career progression.\r\nLess competitive annual pay package. \r\nTolerant of incompetent staff."}, {"review_title": "Cool and independent worklife", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "8 Sept 2014", "job_title": "IT Analyst in Singapore", "duration": "N/A", "pros": "independent work \r\nflexible hours\r\ndecent pay", "cons": "the culture, work life balance is pretty good and not much to say as a disadvantage"}, {"review_title": "Good work but less salary", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Good quality research environment; international standards of infrastructure and facilities", "cons": "Non competitive salary and not structured for quick growth; flat hierarchy"}, {"review_title": "Research Assistant", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "22 Apr 2019", "job_title": "Research Assistant in Outram Park,", "duration": "N/A", "pros": "Being in the company of scientific minds", "cons": "low flexi benefits, $10 co payment for medical insurance, little/no aws nor performance bonus"}], [{"review_title": "Excellent institution", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "27 Aug 2019", "job_title": "IP Manager", "duration": "N/A", "pros": "Collegiate atmosphere, high research quality and good benefits", "cons": "Nothing comes to mind, maybe the way salaries at certain departments is benchmarked is faulty"}, {"review_title": "good environment", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "23 Jan 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "focused on various research areas. Good mentorship and grants", "cons": "can't really think anything too bad about it."}, {"review_title": "The department", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "26 Sept 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Colleagues are ok to work with. Flexible timing", "cons": "No proper guidance. Unfairly treated. Professors are always right."}, {"review_title": "Work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "2 Jul 2018", "job_title": "Senior Research Fellow in Singapore", "duration": "N/A", "pros": "Great scientific learning and training environment", "cons": "Not consistent Housing rental allowances and no programme to become an independent PI"}, {"review_title": "Good research and collaborative atmosphere", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "19 Nov 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Friendly workplace, researchers and clinicians are happy to collaborate. Good and interesting research.", "cons": "Small opportunity for career advancement (research)"}, {"review_title": "Work life balance", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "26 Mar 2020", "job_title": "Executive", "duration": "N/A", "pros": "Company has work life balance, events and talks to attend. Slower pace and good place to learn.", "cons": "Annual pay package not competitive."}, {"review_title": "Postdoc/research fellow", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Good lab environment, but PI dependent.", "cons": "Promotions are not merit based. Salary scales are not available and extremely variable."}, {"review_title": "Great environment", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "3 Jun 2020", "job_title": "Research Assistant in Singapore", "duration": "N/A", "pros": "Great cosy atmosphere, very fancy building. Very reasonable benefits!", "cons": "Experience will vary with lab culture - specially in terms of language/culture"}, {"review_title": "Eye-opening experience", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "28 Jun 2016", "job_title": "Research Assistant in Singapore", "duration": "N/A", "pros": "Duke-NUS fosters creativity and critical thinking in problem solving", "cons": "Not aware of the downsides due to short term part-time employment"}, {"review_title": "Very High Turnover", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "11 Jul 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Good benefits, they give an allowance for healthy habits.", "cons": "High turnover. It’s insane. People last maybe 2 months max before quitting."}], [{"review_title": "Good place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "7 May 2020", "job_title": "Senior Bioinformatics Specialist in Outram Park,", "duration": "N/A", "pros": "Lot of things can be learned in short time", "cons": "Less papers would be published"}, {"review_title": "How it is here", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "22 Aug 2012", "job_title": "Clerk in Singapore", "duration": "N/A", "pros": "Very interesting work done here.", "cons": "Not too many papers out."}, {"review_title": "Management Assistant Officer", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "2 Sept 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Friendly Environment at my level.", "cons": "Workload super a lot and more time need to my invests in an employee."}, {"review_title": "Duke-NUS", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "23 Jan 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great evironment and friendly management", "cons": "Low salary, human resource rate your increment"}, {"review_title": "Mgmt", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "15 Jan 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Good worklife balance with good benefits", "cons": "Salary not as high as compared to other industry."}, {"review_title": "Finance Executive", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "22 Apr 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Good vacation leave days\r\nManagement was good.\r\nBosses back you up.", "cons": "Salary not competitive compared to market."}, {"review_title": "Research assistant", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "8 Jun 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Competitive salary, some colleagues are nice", "cons": "No work life balance. Very common to see people working overtime and on weekends"}, {"review_title": "Senior research fellow", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "11 Jul 2019", "job_title": "Senior Res Fellow in Singapore", "duration": "N/A", "pros": "A very friendly good place to work", "cons": "none that I can think of"}, {"review_title": "Good academic institute", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Great colleagues, talented and hardworking. Funding is ample and readily available", "cons": "Management can be hierarchical at times."}, {"review_title": "great working environment", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "28 Dec 2015", "job_title": " in Outram Park,", "duration": "N/A", "pros": "friendly colleagues and great place to work", "cons": "i have nor cons for this place"}], [{"review_title": "Employee opinion", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "7 May 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Family oriented and diverse community", "cons": "Promotion and advancement very limited chance"}, {"review_title": "Research Assistant", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Really conducive environment with lots of opportunities to learn.", "cons": "It depends on the lab you are in."}, {"review_title": "Research Fellow", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "16 May 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great stepping stone for young graduates", "cons": "Pay hike is slow and be stressful from time to time."}, {"review_title": "Good place to do research", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "17 Apr 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Friendly and passion driven environment.", "cons": "No AWS (13th month bonus). Salary increments are small."}, {"review_title": "Professional", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "29 Sept 2019", "job_title": "Research Assistant in Hyderābād", "duration": "N/A", "pros": "Multidisciplinary and multicultural working environment. Flexibility in work hours.", "cons": "Not much opportunity to advance in the research setting"}, {"review_title": "Duke-nus", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "14 Mar 2013", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "People are generally friendly and the working envt is generally healthy.", "cons": "The finance department is rather inefficient."}, {"review_title": "Student Internship", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Awesome facilities and equipment with strong research direction", "cons": "A little inaccessible from the train station"}, {"review_title": "Executives", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "14 Sept 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "great colleagues and good leave benefits", "cons": "the travel distance from home to office (not truly a cons though)"}, {"review_title": "Just to share", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "17 Jan 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Work life balance, training provided", "cons": "Bureaucracy, more focus on superficial/aesthetics instead of substance,"}, {"review_title": "good lab environment", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "friendly colleagues, good training opportunities, mixed cultures", "cons": "depends on the group you are working..."}], [{"review_title": "Executive", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Good work life balance especially for working mums", "cons": "slow to progress up the ladder"}, {"review_title": "Great", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "19 Sept 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Excellent work atmosphere with world class facilities", "cons": "Work life balance is not up to the mark"}, {"review_title": "Good learning", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "15 Jul 2014", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Trainings valuable discussion imaging and microscopy, leaves", "cons": "Low salary, management, time off"}, {"review_title": "Research Assistant", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "7 Jul 2018", "job_title": "Research Assistant in Singapore", "duration": "N/A", "pros": "good benefits and compensations. conducive working environment", "cons": "very hard to achieve work life balance!"}, {"review_title": "Balanced environment", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "17 Jun 2019", "job_title": "Research Assistant in Singapore", "duration": "N/A", "pros": "Good work-life balance.  Great learning experience", "cons": "Slightly conservative, but amazingly productive nonetheless."}, {"review_title": "comfortable environment but low pay", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "23 Oct 2019", "job_title": "IT Analyst", "duration": "N/A", "pros": "number of leaves offered and comfortable environment", "cons": "very slow career growth ..."}, {"review_title": "HR - Learning and development", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "11 Nov 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Good structure and clarity on processes", "cons": "Location is quite inaccessible"}, {"review_title": "Enjoyable place to work with", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "11 Nov 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Pleasant working environment and friendly co-workers", "cons": "Complicated and messy structure, confusing"}, {"review_title": "Nice environment", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "5 Feb 2020", "job_title": "Construction Administrator", "duration": "N/A", "pros": "Friendly community and people are generally helpful", "cons": "Good equipment but some are really old."}, {"review_title": "Position Pros and Cons and experience", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "25 Feb 2020", "job_title": "Management Assistant Officer", "duration": "N/A", "pros": "Great working environment and colleagues", "cons": "Boring work, monotonous and repetitive"}], [{"review_title": "Good", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "-live and work in the place", "cons": "-handle students 24/7 and may lack work life balance"}, {"review_title": "RA duke", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Learn new skills\r\nGood colleagues\r\nHugh quality research", "cons": "Currently there are no cons"}, {"review_title": "good place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "21 Jan 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Excellent funding and equipment and good science", "cons": "high turnover of PI's"}, {"review_title": "Research work and hard work", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "28 Jan 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Simple life, hard work, writing papers", "cons": "No clear career path here"}, {"review_title": "Good", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "30 Dec 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "the environmental is very good. We like it.", "cons": "no any reasons. It is good."}, {"review_title": "not too bad", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "nice environment, pretty place and nice people", "cons": "mostly a good environment for research"}, {"review_title": "Great working environment", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "20 Jul 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Good working environment, wonderful PI", "cons": "Not close to public transport"}, {"review_title": "research assitant", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "28 Feb 2014", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "good working attomasphere and nice coworkers", "cons": "low salary and long working time."}, {"review_title": "phd salary", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "30 Aug 2014", "job_title": "PhD Student in Singapore", "duration": "N/A", "pros": "good  stipend. nice curricullum.excellent oppurtunity", "cons": "no hike for 4 years"}, {"review_title": "MAO", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "27 Feb 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Lots of learning opportunities", "cons": "low salary and no growth at all"}], [{"review_title": "Research assistant", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "1 Sept 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Good salary and benefits.", "cons": "It's hard to coordinate between departments."}, {"review_title": "Intern", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "15 Sept 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Flexible work, cheap canteen food", "cons": "Contract based positions like all other research positions"}, {"review_title": "Researcher", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "4 Sept 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "The professors are very nice", "cons": "Payment for part time is low"}, {"review_title": "Nice", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "24 Oct 2019", "job_title": "Process Engineer", "duration": "N/A", "pros": "Good stuff Nice and not bad", "cons": "None that I can think of"}, {"review_title": "associate", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "26 Aug 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "good environment, colleagues, work-life balance.", "cons": "there is no cons..... ....."}, {"review_title": "Research lab", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "13 Aug 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "-Freedom and very flexible work", "cons": "-low pay\r\n- can be quite monotonous"}, {"review_title": "good", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "goodddd environmnet to work good colll", "cons": "Not much cons on this org"}, {"review_title": "Postdoctoral", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "20 Aug 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Good platform for doing research", "cons": "Not so sure about this"}, {"review_title": "MAO", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "18 Dec 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Good location and near eateries", "cons": "Enlarge jobscope will be better"}, {"review_title": "Dr", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "17 Oct 2018", "job_title": "Research Assistant", "duration": "N/A", "pros": "It was very motivating environment", "cons": "some are beyond over control."}], [{"review_title": "PhD student", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "17 Aug 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great diversity of workshops and career progression trianings", "cons": "Physical environment of the building"}, {"review_title": "Great place if you have a good team", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "10 Mar 2022", "job_title": "Research Assistant", "duration": "N/A", "pros": "Team and boss were really great. Was in a previous team that wasn’t very supportive too so it varies", "cons": "Everyone worked OT and was slightly too invested in their work"}, {"review_title": "Very nice", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "13 Jan 2022", "job_title": "Research Assistant", "duration": "N/A", "pros": "Good environment for research and study", "cons": "There is nothing bad about it."}, {"review_title": "good place to start off as an entry level graduate", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "23 Nov 2021", "job_title": "Research Assistant", "duration": "N/A", "pros": "friendly work environment, hours are not too long, most people are very easy to work with", "cons": "very little room for growth / promotion / salary increase"}, {"review_title": "Great collaborative environment", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "18 Nov 2021", "job_title": "Assistant Professor", "duration": "N/A", "pros": "Good collaborations, great leadership, good facilities.", "cons": "Small environment, long administrative hurdles"}, {"review_title": "Good Part Time Job", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "5 Feb 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "You get paid for  two hours minimum every time you go in, even if you only put in an hour or less. The teachers and students are all very nice and professional.", "cons": "You have to memorize a lot of information. There isn't much prior notice of when jobs are coming, so you can't rely on this as a stable source of income."}, {"review_title": "Nicest work environment I know", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "28 Oct 2014", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Stimulating learning and researching environment\r\nGreat work-life balance\r\nNice facilities", "cons": "No evolution nor consideration for non PhD staff\r\nHeavy administrative burden due to the double system NUS+ Duke-NUS, and slow HR"}, {"review_title": "Excellent place of work", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "7 Oct 2019", "job_title": "Research Assistant", "duration": "N/A", "pros": "Very collaborative and helpful culture", "cons": "There is a lot of red tape between the school of other entities like the SGH etc. which is normal for healthcare, but I had expected more synergy so felt let down"}, {"review_title": "It has been and up hill battle", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "24 Oct 2011", "job_title": "Senior Accountant in Raleigh, NC", "duration": "N/A", "pros": "The company has excellent  benefit plan.", "cons": "The salary is not competitive with the same roles at other companies,"}, {"review_title": "Research Assistant", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "29 Oct 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Duke-NUS boasts a supportive environment with welcoming staff and senior administrators. They also have great benefits and health coverage.", "cons": "I cant really think of any at the moment."}], [{"review_title": "Research", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Engaging community and promotes growth\r\nGreat overall benefits, compensation package is decent\r\nWork life balance", "cons": "None that I can think of"}, {"review_title": "Research Assistant", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "28 Jun 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great work-life balance. Advanced lab settings.", "cons": "No good canteen for work day lunch."}, {"review_title": "Horrible and incompetent management", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "24 May 2018", "job_title": "Research Fellow", "duration": "N/A", "pros": "Benefits, work-life balance, good location", "cons": "Poor and incompetent new PIs who are extremely unprofessional and disrespectful. Similar attitude of some senior managers.  Making research staff perform menial tasks.  Poor quality research in few departments."}, {"review_title": "Clerk", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "14 Feb 2019", "job_title": "Produce Clerk", "duration": "N/A", "pros": "great environment and workforce throughout the establishment", "cons": "I have not seen any"}, {"review_title": "It is a very enriching experience", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "It is an international organization", "cons": "The job is a little bit boring"}, {"review_title": "Student assistant", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "22 Mar 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "The working environment is very good", "cons": "The job is a little bit tiring"}, {"review_title": "it's a good position", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "get to know a lot of people", "cons": "don't have much freedom to relax"}, {"review_title": "A pleasure!", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "16 May 2012", "job_title": "Research Assistant", "duration": "N/A", "pros": "Benefits are great and all encompassing", "cons": "Hours can be long and grueling."}, {"review_title": "office clerk", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "22 Oct 2015", "job_title": " in Durham, NC", "duration": "N/A", "pros": "Great company to work for", "cons": "i have no cons i like working there"}, {"review_title": "Great employer", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "22 Jul 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Fantastic benefits\r\nGood life balance\r\nLearning opportunities\r\nGood salaries\r\nConferences to attend", "cons": "Lack of fundings\r\nExpectating too high"}], [{"review_title": "good", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "15 Nov 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "good working experience and friendly admin", "cons": "not really much to complain"}]]