[[{"review_title": "Great office with Awesome team", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "13 Dec 2022", "job_title": "Software Engineer II (Ios Developer) in Colombo, Western", "duration": "N/A", "pros": "- Using latest technology - Listening to employees - Super friendly team - Motivational Managers and Team Lead - Learning opportunity - Smooth onboarding - Good salary package and perks", "cons": "- Requesting access and wait for ages to get it approved - Lots of meetings"}, {"review_title": "Awesome Team", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "3 Mar 2023", "job_title": "Manager in Singapore", "duration": "N/A", "pros": "Almost all teams in Circles are supportive.", "cons": "Not a Con but nature, changes are a constant phenomenon. Adoptability or having a plan to execute while managing changes is essential skillset to have."}, {"review_title": "Company grows on you", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "8 Mar 2023", "job_title": "Compensation and Benefits Specialist", "duration": "N/A", "pros": "- Great manager who mentors, understanding & leads by example - Hybrid work arrangement - Autonomy at work with guidance when needed - Feed me fat with lunches & tea breaks - People-centric", "cons": "- Bonus - Work systems - Office can be better - High turnover"}, {"review_title": "Good Culture", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "1 Mar 2023", "job_title": "Senior Talent Acquisition Specialist in Singapore", "duration": "N/A", "pros": "Strong support and recognition from internal stakeholders in Talent Acquisition efforts. Helpful team members.", "cons": "Autonomous environment, if you are responsible, motivated, and driven you will thrive and enjoy your time here."}, {"review_title": "Bad experience mainly due to direct work team. Poor culture.", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "30 Aug 2022", "job_title": "Anonymous Employee in Singapore", "duration": "N/A", "pros": "- Handful of nice colleagues who were nice to work with and helpful when help was needed\r\n- Decent compensation \r\n- Hybrid work arrangement \r\n- Autonomy in the work you do to a certain extent\r\n- Monthly business update by CEO motivates the ground\r\n- Company tries to embrace a culture of recognition", "cons": "- Too focused on top line revenues which results in many tactical decisions being made on marketing and product. Deadlines are tight and launches are mostly half baked\r\n- Lack focus to create any long term impact\r\n- Important processes are not prioritised to be automated which causes a lot of manual work and errors downstream. Tech debt not prioritised. \r\n- Always rushing to do things without proper validation. When they don’t turn out as expected, the initiatives become deprioritised. A lot of time and resources become wasted in the process\r\n- Mostly fighting fires\r\n- Too many actors running the show - everyone is busy doing their own projects. They move ahead with development and execution even when validation results say otherwise.\r\n- There are some who take feedback poorly and they end up being un-collaborative. If you don’t agree with them, they stop talking to you\r\n- Bad manager. Not every manager is invested in training their underlings up. Perpetually busy but don’t know busy with what.\r\n- eNPS surveys are suspected to be non anonymous even though they claim to be so"}, {"review_title": "Toxic workplace, high attrition, waning B2C business but there is some hope with the pivot to B2B SaaS (I think)", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "22 Feb 2023", "job_title": " in Singapore", "duration": "N/A", "pros": "- Financial state is extremely well managed (or it seems). - The company has made an important pivot to become a telco SaaS business although this means that the company has to start over to establish PMF with the big telcos. It's been promising but the progress has been slow. - Reasonably fast paced, not always in a good way though. - Many smart people (some can be complete d**ks though) who will challenge you to push yourself. - The founders have somehow managed to attract some really prolific leaders from the industry. There are 6 CXOs, I kid you not. In addition to the 3 cofounders, there's a Chief Technology Officer, Chief Operating Officer, Chief Revenue Officer, Chief Business Officer, Chief Commercial Officer, Chief Growth Officer. not sure if that's a good thing or a bad thing. - Employees have access to equity through the Space Cadet and Space Explorer programs which is supposed to reward top performers. Performance, however, is a strong function of the relationships you have with those who the cofounders trust.", "cons": "There's a B2C business where Circles acts as an MVNO in Singapore, Taiwan, Australia, Indonesia and a B2B business where Circles provides cloud-based software to big telcos around the world to help them launch their digital sub-brands for underserved segments. For valid reasons, the company's focus is on getting the B2B business right & investing in and scaling it while the B2C business keeps the company afloat (for now). My comments are strictly based on my experience in the B2C business and not B2B. - Incredibly high attrition : You'll always see new job openings. Not because the MVNO business is growing but because people keep coming and going. There are many who quit within 3 months. The environment is very uncertain and unstable. Also, there's no proper handover or knowledge transfer. The result: Failed experiments or campaigns get repeated again only to fail again. - Bleak Product roadmap - As a Telco, your core product offerings are Data and Voice and how you're able to structure and package them to suit customer needs. As an MVNO, Circles neither has direct control over the core Telco tech nor is it able to influence partner telcos to bring new offerings or enter new segments. - Moving fast without executing well:There is a lot of intent to experiment and learn but the experiments are done without a clear plan or expectation about outcomes in such a hasty manner that they would just fail not due to an invalid hypothesis but due to poor execution. The result: Most of the time, it feels like everybody is doing so much work and burning out but things are going nowhere. - Lack of mentorship: Much of the above problem is because the people who do the work are interns or young professionals in their first or second job and lack proper judgment. but the root cause is lack is mentorship from seniors and leaders to coach them about what's right and what's not. - Bullies are allowed to thrive and are rewarded despite their behavior: Several people are generally nice and helpful. However, there are a few people who are just outright bullies. Their behaviour cannot be challenged as they are deemed 'passionate' due to slogging 80 hour weeks or they are the 'Old Guard' trusted a lot more by Senior Leadership. - Salary: much lower than market pay. also please forget about increments if you're not the best performer in your team. - Use of South Asian languages at work is commonplace and doesn't make the environment feel inclusive. To me, it seemed like 2 types of people could thrive in the organization - the type that worked hard to optimize for investor presentations and maximizing valuation, and the other type that worked harder to please the first type and be in their good books. Although one of the values is to give power back to customers, it's mostly just stated in meetings and slide decks, and never practiced in reality."}, {"review_title": "The Circles Life", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "17 Oct 2022", "job_title": "Presales Solutions Architect in Singapore", "duration": "N/A", "pros": "People-Centric, Open, Integrity, Humble, Innovative, Constructive Disruption, Creative, Efficient, Effective, Surgical, Precise, Always-On, Collaboration \r\n\r\nAt Circles, I've had one of the most smoothest, well planned onboarding journeys and was ready to go on Day 1 with zero effort. It's truly a People-Centric organization, even the department is called People & Culture (which is way cooler than \"HR\"). Right from day one till now, I have always felt well taken care of and am pleasantly surprised that such a super-cool company exists amidst the humblest of surroundings. True to form, Circles really does believe in putting the customer first, employees first and invests heavily in it's core mission and promise. I've found great creative freedom, open door access to everyone and it's really a space for true innovation, constructive disruption and drive coupled with collaboration, intelligence and brilliance. I think that being a part of this tribe that stays humble, believes in integrity and strives for mastery is an honor in itself. On a personal note, when I got sick, there was no drama, only care and concern and it's really heartening when your firm treats you more than just an employee.", "cons": "At this time, I find no Cons, after all, failure is treated as an opportunity to learn and celebrated when challenges are dispelled and replaced by the experiences for all."}, {"review_title": "A rare telecom disruption play based out of Asia", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "26 Jan 2023", "job_title": "Anonymous Employee in Singapore", "duration": "N/A", "pros": "- A career in tech that can uplift your learning considerably - Global exposure with a diverse employee base in Singapore - growth is imperative for the shareholders", "cons": "- New senior level management team is bringing on changes that might be unsettling for few - more objective based decision making is needed"}, {"review_title": "Circles of life", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "15 Feb 2023", "job_title": "Software Engineer", "duration": "N/A", "pros": "Good culture developed by the P&C teams. Good teammates.", "cons": "Frequent burnouts, required to be on calls and overnight deployments."}, {"review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "6 Feb 2023", "job_title": "Anonymous/Employee", "duration": "N/A", "pros": "Teammates are friendly and supportive. Learning opportunities are quite ample as well. Employee benefits are good.", "cons": "Might be hard to grasp sometimes since it's a start up."}], [{"review_title": "A mix of traditional and start up mindset", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "31 Jan 2023", "job_title": "Manager", "duration": "N/A", "pros": "- good benefits - employee stock options - compensation is not bad", "cons": "- broken systems - legacy issues - lack of focus, too many plans"}, {"review_title": "A great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "26 Jan 2023", "job_title": "Talent Management Director", "duration": "N/A", "pros": "Amazing teams and colleagues, good benefits and a great place to learn and grow. A forward looking company that has the employees interest at heart. Friendly and supportive environment.", "cons": "So far so good. Nothing much to add"}, {"review_title": "Great place to work and grow", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "3 Feb 2023", "job_title": "Program Manager in Singapore", "duration": "N/A", "pros": "- Friendly and supportive colleagues - Opportunity to obtain breadth of experiences", "cons": "- More conducive office space and infrastructure"}, {"review_title": "Don't join if you want work-life-balance", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "31 Jan 2023", "job_title": "Software Engineer", "duration": "N/A", "pros": "Decent colleagues, stocked pantry, location is bad", "cons": "Bad policies, no work life balance"}, {"review_title": "Good Learning, but lack of clarity", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "25 Jan 2023", "job_title": "Associate in Singapore", "duration": "N/A", "pros": "- Great place to learn - Ample opportunities and ability to be exposed to all types of work - People are nice", "cons": "- Senior management can lack direction"}, {"review_title": "Leadership needs to change or company is doomed", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "3 Dec 2022", "job_title": "Manager", "duration": "N/A", "pros": ", 6 months salary as rewards to high performers", "cons": "Numerous challenges \r\nLeadership does lip service to most problems. Example - people welfare, career development, reducing number of meetings to name a few.\r\n They want org to change but dont want to change themselves. \r\nHave high ego, very iterative style and no appreciation for hardwork. The new Leadership avoids confrontation and have just become a bunch of yes-men.\r\n Leadership keep changing things every other week and it generates more and more chaos for everyone \r\nLeadership is poor at quick decision making and just keep delaying"}, {"review_title": "If you're looking forward to a great place to work non-stop, you're in luck!", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "17 Apr 2022", "job_title": "Software Developer", "duration": "N/A", "pros": "You won't have to worry about tackling any tech debts in Circles Life! The management is more then happy to let it burn up all of the services availability! \r\nWork on new features over bug ridden codes! \r\nWanna work on fixing a bug? Tough luck! IT literate management wants u to build a duck animation on the app instead of getting rid of the fire!\r\nLook forward to a world class procrastination management team where you're life isn't a concern to them!\r\nWeekends? Why bother when work is able to call you up at ANY given moment in life, even while you are out and about!\r\nWatch the fire burn as you constantly work 24/7 to deliver features while ignoring genuine tech debts that will make you're life easier!\r\n\r\nLooking to figure out systems without any guidance! Look no further! With the constant stream of seniors leaving you will end up figuring everything all on your! No questions asked! Literally!\r\n\r\nFight fire while you figure the unknown and constantly being asked 'Is it done?' like if a broken tape recorder is placed next to you!\r\n\r\nAs our wise CTO told the employees\r\n'If you do not want to work hard for our company, then your parents have raised you wrongly' - Hetti", "cons": "Nothing much, the grind is real thou"}, {"review_title": "Short review", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "25 Jan 2023", "job_title": "Project Manager", "duration": "N/A", "pros": "Team Activity Fast paced development", "cons": "No job guarantee in Job security"}, {"review_title": "Neutral", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "10 Jan 2023", "job_title": "Product Designer", "duration": "N/A", "pros": "Great for those looking for a fast paced environment that allows for growth.", "cons": "Work life balance isn't the best where you find yourself being overwhelmed and burnout."}, {"review_title": "A culture of: OVERPROMISE, UNDERDELIVER", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "16 Oct 2022", "job_title": "Anonymous Employee in Singapore", "duration": "N/A", "pros": "- Given strong ownership and autonomy of projects - Career progression - Strong recognition is given to high performers - Opportunity to learn tremendously", "cons": "- Constantly under-resourced - High turnover - Suck the energy and mind out of their employees with high expectations and minimal resource/support - Fake promises on compensation - Poor HR support (no empathy, no transparency in communication) - They do not care about quality, only care about speed deliveries of projects - Constantly over-promise and under-deliver (both internal and external)"}], [{"review_title": "Work Hybrid Arrangements", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "12 Jan 2023", "job_title": "Specialist", "duration": "N/A", "pros": "Flexible schedules arrangements & Weekly employee engagement", "cons": "Toilet needs upgrade Managers needs to hands on"}, {"review_title": "Friendly, Dynamic and Positive", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "31 Oct 2022", "job_title": "Pre Sales Lead in Singapore", "duration": "N/A", "pros": "Had a most engaging first day orientation where everything is sorted out and set up in the most hassle free manner, so much so that I am almost up and running on the 2nd day of work. People here are friendly and willing to share and teach, which is a great thing to have as compared to other environments when first days/weeks you're typically left alone for self-reading.", "cons": "Traveling to the office probably is the only thing. The humid weather in Singapore isn't exactly the best environment for walking."}, {"review_title": "Fast paced", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "26 Dec 2022", "job_title": "Software Engineer in Jurong West New Town,", "duration": "N/A", "pros": "Independent, promote autonomy. Fast paced. Innovative.", "cons": "Nothing much to comment for now"}, {"review_title": "Will never recommend", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "6 Sept 2022", "job_title": "Marketing Executive", "duration": "N/A", "pros": "Start up culture so you can already guess what the culture is like. Only good thing was the colleagues and friends.", "cons": "before lockdown period, everything just went downhill. things got too political and heated in the room. projects were discarded just as they were completed which meant that the work the team put in went down the drain because the CEO said to change strategies. there is also no clear direction when it comes to the direction of the company."}, {"review_title": "I don’t know what to say", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "10 Dec 2022", "job_title": "Devops Engineer in Singapore", "duration": "N/A", "pros": "Good direct manager. He’s willing to shield us from all the politics that’s going on", "cons": "Too many politics… Even though manager shield us from politics. But he can’t shield me from everything."}, {"review_title": "Poor Management and Culture", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "13 Dec 2021", "job_title": "Anonymous Employee in Singapore", "duration": "N/A", "pros": "- Career opportunities are decent. There are a few opportunities for you to work on things outside of your day to day portfolio. There are also opportunities for you to showcase your work and feel valued, depending on the scope.\n\n- Team members on the associate and senior associate level are generally pretty ok, except a few political ones.", "cons": "- Very poor communication across different teams and lack of transparency. It is often a case of \"who owns what\".\n\n- Performance management system is very skewed due to favouritism. You can have a few folks that aren't doing much being rewarded. \n\n- Very poor company culture. It is understandable that joining a start-up means not having a work-life balance, but over here it is very common to get (demanding) requests late at night or through the weekend. There is also a culture of glorifying employees that work late and put in insane hours.\n\n- Employee Stock Option Plans are given to employees but again, it is very unclear whether an employee has ownership over their plans and if there is a way to cash out on them. There was a buy out recently announced but many employees are not kept in the loop. Even employees that have left or employees that have been working in the company for years have not gotten any news on how they can cash out on their stock options. It is fine if the implementation of the plan was poor, but the lack of communication and transparency results in ambiguity on whether what was promised is actually available to them."}, {"review_title": "Poor work-life balance", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "14 Nov 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Good place to learn and grow", "cons": "Stretched teams with no focus"}, {"review_title": "Messy processes", "rating": "3.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "8 Oct 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "a lot of autonomy in your work", "cons": "horrible office facilities esp the toilets, everyone here is very young so you might not be learning from the best due to lack of experience, tech debt is heavy, engineers can't keep up with work"}, {"review_title": "Red Flags Everywhere", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "30 Jun 2022", "job_title": "Engineering Manager", "duration": "N/A", "pros": "You get to work with Singapore", "cons": "Waterfall product engineering, big upfront design and plans - a comparatively recent startup needs to undergo digital transformation for years?\nUnlike modern product companies, teams on the ground have little real autonomy and ownership/responsibility over outcomes. Mentality cultivated is churn more lines of code and resolve production tickets as quick as possible - no thought for the future and no sustainable engineering skills.\nHiring talent difficult than peer competitors - quality outflow outsizes inflow many times.\nHorror stories of CSOP (company stock option plan) - not transparent, vested options but unable to exercise.\nLow product discovery and scaling capability - cannot remember the last time Circles was on the news.\nCTO writes fancy ivory tower newsletter that has nothing to do with what's happening on the ground.\nLabour arbitrage @Sri Lanka is not giving value as expected."}, {"review_title": "Shady company", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "9 Apr 2022", "job_title": "Senior Software Engineer in Singapore", "duration": "N/A", "pros": "- Your experience may vary. I reported to caring managers but I have heard many other horror stories from other teams.\r\n- Many young employees, can be fun and vibrant (again, depends on your team)\r\n- Many learning opportunities (because there is nothing in place, good/bad depending on your perspective)", "cons": "- Does not feel like the management knows what they are doing. Long-term plan changes every quarter.\r\n- Benefits is pale in comparison to industry standard. (No flex claims, no dental claims, the only benefit you get is mobile phone claim)\r\n- Wants to build a \"SaaS\" product but does not have the correct pool of talents to achieve this goal. Felt like I was sold a dream that will not materialize.\r\n- Shady practices with the whole CSOP initiative. It was not clearly explained, many questions not answered, felt like the company is withholding information on purpose. When you are offered shares or cash, PLEASE TAKE CASH. Saves you the trouble of chasing for information and avoid being lured into a trap of your \"vested\" options expiring."}], [{"review_title": "Management not able to set clear and realistic directions", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "10 Oct 2022", "job_title": "Project Manager in Singapore", "duration": "N/A", "pros": "- Highly motivated peers \r\n- Regular compensation review", "cons": "- Ineffective middle management focused on avoiding accountability"}, {"review_title": "Company super messy", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "4 Oct 2022", "job_title": "Project Management Office (PMO) in Singapore", "duration": "N/A", "pros": "Very fast paced with steep learning curve", "cons": "toxic management with lot of blaming games"}, {"review_title": "Not bad", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "24 Oct 2022", "job_title": "Associate", "duration": "N/A", "pros": "Big goals - if realized eventually", "cons": "Less worklife balance for most"}, {"review_title": "One of the best workplaces I've worked at", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "13 Oct 2022", "job_title": "Analyst in Singapore", "duration": "N/A", "pros": "Challenging environment that enables you to work and grow", "cons": "High stress environment. Not for everyone"}, {"review_title": "Growth opportunities", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "16 Oct 2022", "job_title": "Product Manager in Singapore", "duration": "N/A", "pros": "Growing company with many areas to add value in", "cons": "Lack of hard prioritisation leading to stretched teams and no focus"}, {"review_title": "Take ownership of your own growth", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "30 Jun 2022", "job_title": "Software Engineer in Singapore", "duration": "N/A", "pros": "Flexibility to move to different domains when you feel like you're stagnating\r\n\r\nSupportive seniors (not all seniors obviously, but like all companies there are people who are passionate about their work and passing down knowledge to juniors and there are those who just want a pay check)\r\n\r\nAm still early on in my tenure in Circles, but from what i've experience so far is that management seems to be proactive about feedback although whether or not they follow up on feedback I can't say yet. But overall it seems they really care about employee's wellbeing. \r\n\r\nWorkload is great actually besides the fact that you'd have to be on-call for a week or so at most which means if there were any serious crashes to the service you are working on, no matter the time, you'd have to be online trying to solve he issue. I see this as a learning opportunity for juniors but not quite positive for seniors. But then again, it's your perspective. I feel there are plenty you can learn from these call ups (which don't happen too frequently by the way). It's a positive for me as it encourages engineers to write excellent grade code.\r\n\r\nTeam leads/Engineering managers seems to be very experienced and from my experience, very supportive too.\r\n\r\nWorking hours are strict but i guess it depends on the severity of the task. So far i have never been required to work past working hours. I was even discouraged by my team lead to work past working hours.\r\n\r\nFree lunch in the office sometimes. Might not be a 5 star michelin meal but come on guys be grateful for the thought.\r\n\r\nNice hybrid work setting but could be way better if they don't enforce it and only have employees come to office if REALLY NEEDED \r\n\r\nAmbitious company\r\n\r\nYearly bonus and CSOP (Have't received mine yet as I am not here long enough)\r\n\r\nWork from anywhere policy (20 days a year)", "cons": "Salary isn't great just average or slightly above market rate\r\n\r\nCould offer more work life balance by increasing the work from anywhere policy to at least 3 months per year or better yet, giving employees full control of where they work. ONLY COME TO OFFICE WHEN NEEDED. People are shifting the way they view work and Covid has shown how unpredictable life can be. The world is a huge place and if you are going to have to spend 80% of your life in one place (the office) isn't that such a wasteful life? Given the freedom to be anywhere you want to be and still get the job done is a win-win for both employee and employer given that employees are more enthusiastic about life and in return, could be more productive and involved with work. \r\n\r\nBetter on-boarding materials (though i've heard that Circles are already in the process of bettering the on-boarding process and will start for July on-boarders)"}, {"review_title": "Good place to learn and grow", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "12 Oct 2022", "job_title": "Strategy Associate in Singapore", "duration": "N/A", "pros": "Good culture, I like my colleagues", "cons": "Need better office set up"}, {"review_title": "Great Experience", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "29 Jun 2022", "job_title": "Technical Project Manager", "duration": "N/A", "pros": "It's a beautiful experience for me thus far. I am very happy in my current role, working with my team and helping the company to achieve our delivery goals. Personally I am experiencing a good work life balance in Circles Life.", "cons": "Working location can be improved. Admittedly the Singapore office is not within walking distance to the MRT train station the company does provide shuttle bus at selected MRTs. Having worked in more remote location such as Tuas, I would say this far from the worst but it can be further improved."}, {"review_title": "Great place to grow", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "24 Sept 2022", "job_title": "Software Engineer in Bedok New Town,", "duration": "N/A", "pros": "Great place to grow and never ending interesting problems to solve.", "cons": "Immature agile practices/rituals and poor work life balance in critical projects"}, {"review_title": "On a transformational journey", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "16 Jun 2022", "job_title": "Platform Team", "duration": "N/A", "pros": "Investing in the platform\r\nFocus on engineering fundamentals\r\nIn a transformational journey from B2C to SaaS facing challenges on the way - with great learning opportunities\r\nMotivated young team keen on learning and growing\r\nStrong engineering leadership coming into place", "cons": "Office space has room for improvement"}], [{"review_title": "Superb workplace with good bosses", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "17 Sept 2022", "job_title": "Senior Account Manager", "duration": "N/A", "pros": "Like the bosses and company culture", "cons": "Bad office location and employee benefits can be further improved"}, {"review_title": "Decent", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "19 Mar 2022", "job_title": "Senior Software Engineer", "duration": "N/A", "pros": "free food in pantry\r\nfree phone bills\r\nbonus scheme is decent (trust me there are worst places), pays market average\r\nmost people are very nice to work with\r\nyou will have the opportunity to learn a lot about different technologies, and see how they are built to scale", "cons": "-too much firefighting, a lot of tech debts cannot be solved because a lot of old timer engineers left, nobody knows how the codebases function anymore\r\n-a lot of oncall for engineers\r\n-most of your time will be spend on fixing prod issues instead of working on new features. new features are just small things added onto existing codebases\r\n-culture is if you need someone ASAP, just ping them right away even if in the middle of the night or on a weekend"}, {"review_title": "Broke my life", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "14 Jun 2022", "job_title": "Senior Software Engineer in Singapore", "duration": "N/A", "pros": "You get free water and coffee", "cons": "Expect to work 24x7 round the year. There will be no time to go out for a 5 minute walk. There is no way you can learn anything technical here. What you can learn is how spineless someone can be. And dozens of people being spineless together. \r\n\r\n Anyone who ever gave real feedback, or asked questions got fired. Anyone who is still around has no other option, because they depend on the job for their legal status in Singapore. \r\n\r\nBut trust me, any 3rd world country life is better then this degrading helhole."}, {"review_title": "Fake promises", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "9 Oct 2022", "job_title": "Principal Software Engineer in Singapore", "duration": "N/A", "pros": "I did not find any", "cons": "They hire people from India with fake promises \r\nPathetic work culture"}, {"review_title": "3 months at the wrong place can feel like a lifetime", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "23 May 2022", "job_title": "Product Manager", "duration": "N/A", "pros": "None [and trust me, I really tried to think of a few pros in order to write a balanced review]", "cons": "1. People, esp senior leaders oftentimes curse [using tasteless profanities that might sound more in place at a mobster movie by Martin Scorcesse] and yell very loudly in meetings.\r\n2. There's a strong belief that outputs = outcomes. Consequently, there's a crazy pressure to deliver software with a near disregard for the outcomes\r\n3. No triaging of bugs [or triaging of anything really]. Even if ONE customer complains about a bug on the website, PMs and Engg are expected to drop everything to get on a call with the customer to repro and fix the bug. If you have spent even one day as a PM / Engg on consumer products, you will realize how unsustainable this can be.\r\n4. Backstabbing and politics. Now, I have spent 12 years of my life in various Engg and PM roles and have seen a fair bit of office politics. But this is a whole new level. I have had a case where an owner of a different vertical launched his product knowing fully well that there is a dependency on my area and gave me 2 hrs notice. Our team had to then scramble to meet arbitrary deadlines\r\n5. Uninspiring colleagues. Mostly fresh college grads with a massive ego. Bulk of my time was spent (unsuccessfully) coaching and mentoring them rather than collaborating and building successful products. The knowledge gap alone can be bearable BUT that coupled with oodles of braggadoccio made the 3 mos that I spent in this company a very forgettable experience."}, {"review_title": "good company", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "5 Sept 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "good company\r\nfast growing\r\ncareer growth opportunity", "cons": "salary not up to the market"}, {"review_title": "Not that bad", "rating": "3.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "22 Jun 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- Flexibility in terms of working hours and where to work\r\n- Autonomy to run with ideas\r\n- Work From Anywhere (20 days)\r\n- Colleagues and leaders are supportive and live up to company values", "cons": "- The office space needs rethinking as it is not the most conducive space to work\r\n- More learning and development opportunities\r\n- More clarity on career pathways (talent mobility) within the organization"}, {"review_title": "Culture at Circles", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "30 Jul 2022", "job_title": "Anonymous Employee in Singapore", "duration": "N/A", "pros": "Start-up, can learn if you are keen to devote all your Time, cross dept exposure and try your ideas freely.", "cons": "Salary is not as per market guidelines. If you are careful you will be underpaid."}, {"review_title": "Competitive Rewards with Exponential Growth Potential", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "24 Mar 2022", "job_title": "Anonymous Employee in Singapore", "duration": "N/A", "pros": "- Competitive Rewards (CSOP, Space Cadet & Explorer) to motivate high performers\r\n- Willingness to allow employees to take a leap of faith on opportunities \r\n- Aggressive Growth ambition to 10X company", "cons": "- Employee Welfare (Fringe Benefit (Dental, Wellbeing))\r\n- Office Toilets \r\n- Too many cooks spoil the broth"}, {"review_title": "Dodgy practices", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "19 Jan 2022", "job_title": "Software Engineer in Singapore", "duration": "N/A", "pros": "free snacks\r\nteam mates are nice and supportive", "cons": "access to production database is regular occurrence\r\n3 branch + feature branches for each country for each repo, think this style is not common anymore, can be frustrating\r\nseems like reputation is bad, hiring well is difficult\r\ndiversity is not real..some colleague's english are hard to understand\r\nex colleagues were not notified on ESOP\r\nmany talented and good people resigned and gave up bonus, especially those here around 1 year\r\ndon't think i am learning correct things, seniors firefighting all the time. on call for devs is practically 24/7, disruptive to personal life\r\nsome teams with high turnover have the most decorated leaders"}], [{"review_title": "Startup culture - great place to learn and grow, very fast-paced, though sometimes messy", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "23 Jan 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Have been here for >2 years and its truly a place where one can learn and grow tremendously if you are up for the rocket ship pace and willing to take on new challenges alongside the company's rapid growth and ambitious plans. Also made many like-minded friends here who believe in the mission and vision, and are constantly pushing the boundaries to disrupt the telco industry and give power back to customers around the world. Greatly satisfying and fun for those with a growth mindset and looking for a startup to scale your career alongside the company, though challenging for those who might not enjoy such a culture or pace.", "cons": "Not for the faint hearted nor those who are just joining to earn a keep without truly believing in the mission and vision of the company."}, {"review_title": "Great place to learn and grow!", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "6 Jul 2022", "job_title": "PMO Lead in Dallas, TX", "duration": "N/A", "pros": "- Great place to learn and grow (bosses encourage you to carve your own career path)\r\n- There is work life balance", "cons": "- Office building is in an old industrial building which isn't great"}, {"review_title": "PTSD", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "11 Mar 2022", "job_title": "Software Engineer in Singapore", "duration": "N/A", "pros": "friendly team mates and free snacks", "cons": "engineering practices near zero lead to crazy overtime, scrambling on-call all the time\r\nsoul-crushing tech debt\r\nmostly clueless people too happy to work in Singapore company\r\nsoftware reputation is in mud now, good engineers leave, juniors have not seen what good companies do"}, {"review_title": "Worse office ever", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "26 Mar 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- Free snacks\r\n- Good teammates and colleagues, very supportive\r\n- Flexible", "cons": "- Run-down office\r\n- Too many shady practices, including hire and fire. (Then hire again for the same position in the next year)\r\n- Employee survey EVERY MONTH but never take a look at it and act to solve it."}, {"review_title": "Flexible working environment with nice colleagues", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "19 Jul 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Fully stocked pantry items \r\nFlexible hours", "cons": "Cannot make it toilet facilities"}, {"review_title": "infalted titles", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "18 Apr 2022", "job_title": "Senior Software Engineer", "duration": "N/A", "pros": "some government support\ngood public branding", "cons": "u always feel management is not honest, CSOP not straightforward\nsystem not as good as marketed, difficult to scale...\ndisrupting worse dinosaurs but not interesting innovation\nshort term cost cutting mentatlity, rotten software practices, learn bad stuff\nuse promotions to keep people, rank don't reflect leverage\nif u have seen good DevOps culture/product dev, please don't come u will want to tear your hair out"}, {"review_title": "A place for personal growth, expectations can be high", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "22 Feb 2022", "job_title": "Marketing in Singapore", "duration": "N/A", "pros": "1. High level of ownership given at every level\r\n2. Direct manager cared about longer term career planning and makes it easy to have an open discussion\r\n3. Space for personal growth where role changes, expansion and learning can be expected", "cons": "1. High ownership means you need to spend your own time to think through what really matters for your OKRs\r\n2. It is not always clear what's the bigger picture given how fast paced we move\r\n3. Team is really lean and the goals are ambitious"}, {"review_title": "Not bad Not good", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "11 May 2022", "job_title": "Operations Associate in Singapore", "duration": "N/A", "pros": "Culture is alright and founders are ambitious.", "cons": "Ambitious teams but need to work more on execution"}, {"review_title": "Consider Carefully before joining", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "11 Apr 2022", "job_title": " in Singapore", "duration": "N/A", "pros": "- Great small team of colleagues including those in tw/indo, manager and cfo. \n- Snacks/Pantry\n- Mobile Bill reimbursement\n- Our own Music in the small room", "cons": "I am so glad that the finance team left as it was such a depressing workplace and have no work life balance.\n- No action done during employee feedback/survey (etc. Pulsecheck)\n- Not sure what happen to the Employee Stock Option (ESOP) for those left\n- Top down management"}, {"review_title": "Potential to grow", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "14 Jun 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Autonomy, ownership, learning opportunities, flexibility", "cons": "Time management and priorities, effective decision making can be done better."}], [{"review_title": "Honestly not half as bad as all these reviews you see here", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "12 May 2022", "job_title": "Product Designer in Singapore", "duration": "N/A", "pros": "Love the autonomy and flexibility given to us here! People here are amazing as well", "cons": "Office is far, that's about it"}, {"review_title": "rewards", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "16 Jun 2022", "job_title": "Devops Engineer in Singapore", "duration": "N/A", "pros": "overall good in reward process", "cons": "no any cons as found"}, {"review_title": "No work life  balance", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "18 May 2022", "job_title": "Accountant", "duration": "N/A", "pros": "friendly colleagues in the company", "cons": "Overtime almost every single day"}, {"review_title": "Work at your own risk", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "26 Jun 2022", "job_title": "Software Engineer", "duration": "N/A", "pros": "Easy interview, fun working environment, young, fast paced", "cons": "Not nurturing, far location. Dirty toilet."}, {"review_title": "Great for growth and well-poised to disrupt the industry", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "23 Jan 2022", "job_title": "Manager in Singapore", "duration": "N/A", "pros": "- Great place to learn and grow. Compared to larger more established companies, junior to mid-level staff also have an outsized influence on the company's future.\r\n- Disruptor in the telco space, really changing the game and making a difference to improve how telco services are delivered to consumers.\r\n- All employees can participate in the employee stock options program", "cons": "- Startup is not for everyone due to the relative fast pace and sometimes lack of structure. But with the right mindset, these can be great opportunities."}, {"review_title": "Tech leadership can't be trusted, exit ASAP", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "17 Feb 2022", "job_title": "Engineering Manager in Tampines New Town,", "duration": "N/A", "pros": "Learn politics so that will craft you to work anywhere.\r\nWorld class political leaders in Tech to learn from.\r\nLot of leadership videos, motivation talks to learn from.", "cons": "The top leadership in tech doesn't paint the right picture, always plays mind games and always come with a hidden agenda.\r\nBringing impotent leaders from Friends and Family to spoil the entire culture, resulting in very toxic culture. \r\nPoor pay and 24/7 firefighting culture."}, {"review_title": "Confidence destroyed with depression, self doubt and mental stress", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "22 Jan 2022", "job_title": "Finance in Singapore", "duration": "N/A", "pros": "Great potential\r\nGood people\r\nYounger employees with raw talent\r\nGood team in SG and Philippines", "cons": "I saw the Glassdoor reviews before I joined, I should have listened to my gut. My issue is very isolated to the top most leadership. This companies leaders at the top have outlived their value. They created something great, but now they cannot lead anymore without destroying this company. They think this is a slave camp with endless presentations and updates but takes ages to make decisions. When the answer is not what they want, they try to prove you wrong and insult your profession. \r\n\r\nThe whole team is depressed and wanting this nightmare to end. I got the courage to quit and that was the best decision I ever made. It took me a good 3 months to recover. They won't let you quit until they ground your confidence to the ground and make you depressed. Every time numbers are presented, it has to be what they want. They will show you how stupid you are and how brilliant they are with numbers. The team works night and day to arrange the numbers, so everything looks good to hide all the management mistakes. \r\n\r\nDon't care for your life and no vacations work through holidays and false deadlines to make budgets, false sense of urgency just to get the teams working extra hours. They think the teams are not working unless they sit in front of their office. Changes the seating plans and having people just sit in front of the office to keep an eye out for people not working. If they see you a bit relaxed and in a happy mood, they will make sure to destroy your confidence until you get depressed."}, {"review_title": "engineering-driven company is far from truth", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "14 May 2022", "job_title": "Engineer", "duration": "N/A", "pros": "gd press coverage in media\r\n24/7 talking about improvement", "cons": "IS NOT engineering / product driven. Sales, marketing, top-down management comes first\r\nzero visible technical debt because engineers over time to make up for it"}, {"review_title": "Poor tech leadership", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "8 Feb 2022", "job_title": "Senior Software Engineer in Singapore", "duration": "N/A", "pros": "Marketing painting a good picture of the company outside.\r\nPhone bill reimbursement", "cons": "There is a team focusing on putting good rating/review and replying each review on glassdoor. If they really spend this time to solve the actual problem it would have been great.\r\nTech practises are really poor and most of the top level leadership doesn't understand tech. Most of them read/watch youtube videos and gives advices & writes newsletters. \r\nThere is this scratchback culture between the tech leaders that they praise well each other. \r\nZero learning other than fire fighting"}, {"review_title": "Join if you wish to ruin your mental health", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "18 Jun 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Good individuals in most of the teams", "cons": "Horrible leaders, including CTO\r\nCompany feels employees are obliged to overwork and work at their 110% even outside of office hours\r\nNo standard salary hierarchy . Some are severely underpaid while some are unjustifiably overpaid\r\n Well being of employees are non existent. Leaders see it as a norm that employees are working OT all day, everyday and including weekends and PH. When asked if employees can have time off for mental health, CTO responds that it is the individual’s responsibility to take care of his mental health. \r\nNo yearly salary review or increment.\r\nThey counter offer with unreasonably high salary when employees try to leave in a desperate attempt to not lose more employees."}], [{"review_title": "A good challenge", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "16 Apr 2022", "job_title": "Manager in Singapore", "duration": "N/A", "pros": "hovering between a medium global enterprise while trying to keep its start up roots", "cons": "focus / strategy changes before true impact of current execution can be felt"}, {"review_title": "👍🏻", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "11 May 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Good growth with good management", "cons": "Salaries are not as competitive"}, {"review_title": "Bottom of the Barrel Engineering Practices", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "6 Nov 2021", "job_title": "Senior Software Engineer in Singapore", "duration": "N/A", "pros": "- People are nice\r\n- Good story and mission", "cons": "- No automated tests, culture around dev testing, local testing, manual QA\r\n- Architecture is messy, all distributed systems are coupled and deployed in lockstep\r\n- ~5 years of legacy code without any safeguards, there is no way to refactor\r\n- Unpaid and unhealthy on-call. Phone rings 10 times a day at any time. Is this legal?\r\n- Fixation on process instead of technical excellence and value\r\n- Constant whack-a-mole game, don't learn proper skills\r\n- Due to all these attrition is high, titles, pay and recognition are very inflated and difficulty attracting the best talent\r\n- Most people don't see or acknowledge the problems\r\n- As every day passes the problem compounds, there's no sign of improvement. uphill just gets steeper and steeper."}, {"review_title": "Android Intern", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "26 Apr 2022", "job_title": "Android Intern in Singapore", "duration": "N/A", "pros": "Learn Android architecture and Android practices in Kotlin", "cons": "Be prepared before intern would be the best"}, {"review_title": "Lots of learning opportunity", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "11 Jan 2022", "job_title": "Frontend Engineer", "duration": "N/A", "pros": "i think i have grown 5x fold as a developer, given this is my second year as a developer. \r\n\r\nthey give you the liberty to propose your solutions and the discussion is very open.", "cons": "sometimes the management or the seniors will take over too much, not leaving much for the junior to pick up as well. \r\n\r\nwhen i first joined, every engineer had to do weekly 24/7 oncall duties.. which wasnt good for the body."}, {"review_title": "Think thrice", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "29 Mar 2022", "job_title": "Senior Software Engineer", "duration": "N/A", "pros": "quite Customer centric and focused", "cons": "distressing legacy, innovation very difficult, good ppl left, hard to replace\nlittle skills proper engineering culture should have, hero culture\ngive me imposter syndrome when searching for other opportunities"}, {"review_title": "Good career development", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "22 Jan 2022", "job_title": "International Expansion in Singapore", "duration": "N/A", "pros": "- Caring bosses and Founder that gives you the opportunity to grow, as long as you take the initiative to request for it\r\n- Strong pedigree of people that you can learn from\r\n- Opportunities to be involved in activities that would not otherwise be available to typical employees in large conglomerates", "cons": "Base salary and annual could be higher"}, {"review_title": "Stay away!", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "22 Mar 2022", "job_title": "Anonymous Employee in Singapore", "duration": "N/A", "pros": "Free snacks and soft drinks.", "cons": "- Teams are working in their own silo, very less synergy \r\n- Untouchables management especially in the Engineering \r\n- Full of incompetence staffs\r\n- Blaming culture, always pointing fingers to push away the accountability"}, {"review_title": "Worst company to work for….", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "12 Jul 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "The is nothing good about this company. Currently, looking to leave once new job is secured.", "cons": "The company lives in their own own world. They are oblivious to what goes on in the outside world. The Founders talk a lot but fail to walk the talk. Their leadership team is too full of themselves such that they think they are better than they actually are. CTO thinks he is a great leader, when he doesn’t know what it means to be a leader. Team is too young and does not know what a drives a company to success. They are also a racist company given the recent ad controversy. This is not a Singapore company. Majority of them are foreigners who do  not know Singapore Labour laws. Ministry of Manpower should investigate this company. Lastly, their offering is flawed. Information security is not secure which can result in data loss. They have blatantly lied to customers for meeting security standards when they do not. Integrity is definitely not part of this company."}, {"review_title": "Fast growing company - lots of opportunities", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "4 Mar 2022", "job_title": "Anonymous Employee in Singapore", "duration": "N/A", "pros": "Good and sound Mgt \r\nLots of opportunities to grow \r\nInteresting esop system \r\nFairly compensated\r\nGood team members and culture\r\nPretty transparent on data", "cons": "High targets that require extra hustling to achieve"}], [{"review_title": "This is a Fool's paradise!", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "19 Feb 2022", "job_title": "Senior Software Engineer in Singapore", "duration": "N/A", "pros": "* Some software engineers doesn't know what is happening and feels great about the company & the tech leadership and is spreading the positive news/reviews.", "cons": "* Stone age engineering practises\r\n* Toxic culture\r\n* Poor tech leadership right from the CTO to middle management\r\n* Zero learnings."}, {"review_title": "Great to work, but rewards can be more transparent", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "6 Jan 2022", "job_title": "Senior Software Engineer in Singapore", "duration": "N/A", "pros": "1. Can get really good opportunity to work on some of the newest ideas and projects in the telco sphere. \r\n2. Almost no micro-management\r\n3. Can literally work on any idea and just go and implement (and fail fast if missed)\r\n4. Very supportive HR", "cons": "1. Rewards program is not very transparent.\r\n2. Pay is less than industry standard"}, {"review_title": "glorified waterfall sweat shop", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "8 Jan 2022", "job_title": "Software Engineer in Singapore", "duration": "N/A", "pros": "you get to work in Singapore", "cons": "HIPPO, lack of autonomy\r\nepitome of Agile theatre/cargo cult, frustrating if u understand technological and business agility\r\nwork longer hours, fight fires => high performance and recognition\r\nengineering/product can be more diverse, disproportionate from CTO country even though no operations there"}, {"review_title": "Exciting business, particularly SaaS. Not for the feint of heart...", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "3 Dec 2021", "job_title": "Founder's Office in Singapore", "duration": "N/A", "pros": "- Always innovating; launching the SaaS business after years of operating a B2C business shows the founder's foresight\n- Opportunity to always be working in \"start-ups within start-ups\"\n- High caliber people on average\n- Shine through the quality of your delivery; no hierarchy", "cons": "- Chaotic (as with any hyper-growth company)\n- Requires cultural fit. No point in fitting a square into a circle"}, {"review_title": "Yes this is how a startup should be.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "17 Jul 2021", "job_title": "Senior Android Engineer in Singapore", "duration": "N/A", "pros": "If you want to understand what is happening inside Circles.Life, I really recommend the people to read the book \"Inspired\".\r\n\r\nYou will always hear this phrase at least once a week from the Leadership Team, \"Imagine if you are the CEO of Circles, how will you decide in such a situation?\", This clearly indicates the mindset of the Leadership team, how to treat the Employees. Personally, I can experience that.", "cons": "There are some communication barriers between the upper management and the employees, but the management is trying to break them, through monthly feedback, open office hours, etc., Slowly the employees are getting trust to provide real feedback."}, {"review_title": "Terrible company with no ethics", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "11 Apr 2021", "job_title": "Senior Software Engineer in Singapore", "duration": "N/A", "pros": "Nothing as such part from free snacks", "cons": "No work-life balance.\r\n\r\nTreat employees as if they are slaves.\r\n\r\nRuin your peace of mind. I have done a major mistake in my life that I joined this company.\r\n\r\nTerrible and double-faced CTO, you should never believe this company.\r\n\r\nThis company hires mostly from countries like India for cheap labour. Indians are so fascinated about working outside of countries like Singapore, the US, UK etc. This company takes advantage of that mindset. Get them in lesser salary and treat them as if they are slaves.\r\n\r\nBe aware of this company if you ever care about your career.\r\n\r\nPlease don't overlook these negative reviews. I have overlooked them and bearing consequences now."}, {"review_title": "Overall positive, but your individual experience may vary", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "1 Jun 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "+ Plenty of opportunity to step up, do some of the best work of your career\r\n+ Company vision & performance is solid, going global in a major way\r\n+ Founders make an effort to get things right", "cons": "- Working level & even middle to top management crunch can be brutal at times\r\n- Things move fast so there's a catch-22 where teams must press forward leaving no time to fix long standing problems that would let them move faster or destroy morale less\r\n- Day by day pains e.g. tech debt & menial work on non-tech side grind many down, especially some of the best people who get more to do just since they can do more better"}, {"review_title": "A Company Filled with Incompetent Leaders", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "28 Oct 2021", "job_title": "Engineer", "duration": "N/A", "pros": "The MC policy when you are sick.", "cons": "- Incompetent people are promoted to be leaders\r\n- Change of direction is very frequent - constantly looking for secret formula to success (e.g. When CTO read a new book (The Phoenix Project), he would change his direction of the whole engineering team to do what the book says)\r\n- Every change in direction was implemented half-baked, no vision and tenacity to see things through\r\n- Security is taken for granted (security and integrity can be deprioritised to chase after revenue - even devops can see it)\r\n- CISO (self-proclaimed) has severe insecurity issues - whenever something happens, he would \"arrow\" the work to his staffs and micromanage them\r\n- CISO's attitude changes daily - dependent on how CTO treats him the day before\r\n- CTO loves to play favourites - only wants to surround himself with people that agrees with him, constantly toying with the CISO with career progression, salary increment, bonuses\r\n- Lousy benefits (can't claim dental, minimum 14 days annual leave, etc)\r\n- COVID restrictions not observed (e.g. senior management asked everybody to come back to office to work, claiming on essential services. SafeEntry not enforced, safe distancing not enforced, employees do not wear masks in office)\r\n- Too many fresh grads that joined the company got promoted too fast (no real-world industrial experience)\r\n- Engineers are burnt out, worked through the night, over weekends\r\n- No work-life balance - nobody respects the working hours, annual leave and weekends boundaries\r\n- Senior management initiates a lot of open-hours, townhalls, 1-1s, but did not take any feedback from the ground seriously. CTO and his band of yes-men dismiss everything as \"it is your responsibility to achieve this/that\"\r\n- No salary increments (even for those that have been working there for more than 2 years)\r\n- Major lack of resources"}, {"review_title": "Very bad engineering culture", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "11 Feb 2022", "job_title": "Software Engineer in Singapore River", "duration": "N/A", "pros": "Learn to work like a slave.", "cons": "there is a plenty not sure what all to write. \r\nPoor leadership in tech, Zero learning for engineers.\r\nSome people are trapped by their marketing. Time to leave."}, {"review_title": "Ambiguous,  exciting and the best company to burn out completely", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "24 Sept 2021", "job_title": "Engineering Manager in Singapore", "duration": "N/A", "pros": "Ambitious targets, good opportunity for interns and juniors to try out different roles, multicultural environment. Quick career growth is possible.", "cons": "No work-life balance, seniors are underpaid, terrible micromanagement, frequent plan changes. All good engineers are burned out. Some politics is happening. Lots of broken promises."}], [{"review_title": "Fast-paced, changing and room to grow", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "2 Nov 2021", "job_title": "Marketing in Singapore", "duration": "N/A", "pros": "Committed, ambitious leadership team. Proven success story. At the cusp of transforming into telco-tech giant, so plenty of opportunity to make a difference.", "cons": "A few growing pains along the way, but overall good culture with sincere founders."}, {"review_title": "Great company", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "17 Feb 2022", "job_title": "Software Engineer in Singapore", "duration": "N/A", "pros": "Startup culture and good work ethics", "cons": "There are none so far"}, {"review_title": "Very good place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "10 Feb 2022", "job_title": "Software Engineer in Bedok New Town,", "duration": "N/A", "pros": "Very flexible environment and nice people", "cons": "Do not have any cons"}, {"review_title": "Great Company", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "9 Nov 2021", "job_title": "Billing Operation Specialist in Singapore", "duration": "N/A", "pros": "Very innovative & fast forward company. Always believe in the employee to persevere & show their fullest potential. Kudos to the mgmt & team", "cons": "Employee take time to get to know the different inter-department."}, {"review_title": "Game changing telco-tech", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "17 Jan 2022", "job_title": "Head of Business Development in Singapore", "duration": "N/A", "pros": "On a rapid growth trajectory. \r\nAlready unicorn. \r\nStrong vision and team.", "cons": "Slow execution and GTM. \r\nHigh turnover."}, {"review_title": "Poor Management, Political Environment & Bad Compensation policy", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "9 Apr 2021", "job_title": "Anonymous Employee in Singapore", "duration": "N/A", "pros": "- Ambitious product roadmap (Country launches & SAAS)\r\n- One of the best digital telco experience\r\n- Customer centric\r\n- Inspiring CTO, shows you how to do things\r\n- Few passionate engineers around who makes the environment better\r\n- Unlimited snacks for employees", "cons": "- Political environment\r\n- Execution is always poor. Be it country launches/Feature launch. Engineering team has to \r\n- Everyone tries to do something to meet OKRs which might not help the overall Engineering growth\r\n- No co-operation within teams\r\n- Teams get very political when it comes to supporting each other\r\n- No space for improvement, just run behind business\r\n- Quality of hire is extremely poor. \r\n- Lot of pressure to hire in new location where quality of candidates is sub par.\r\n- Hiring decisions are made mostly based on feedbacks gathered from referrers and not based on the interview performance\r\n- Management talks a lot of improving the culture, but no actions put in place. \r\n- No actions taken to control attrition.\r\n- Bogus Employee recognition programs. only engineering managers & Leads are rewarded.\r\n- Many are under paid. Not everyone is treated equally wrt compensation."}, {"review_title": "Management not taking staff as precious asset", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "24 Oct 2021", "job_title": "Manager in Singapore", "duration": "N/A", "pros": "Can learn new technology. Very supportive colleagues.", "cons": "Poor benefits. Minimum bonus. Super high work load without allowance. Management are not taking staff as their precious assets."}, {"review_title": "Overall is not a bad company.", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "14 Sept 2021", "job_title": "Software Engineer in Singapore", "duration": "N/A", "pros": "1) Intelligible and friendly team.\n2) Interest task\n3) Benefits and stock options program.", "cons": "1) What is the highest management talk sometime is not same to reality\n2) Non paid overtimes (Support ~once at the month over weekend)\n3) As it is product company sometime quality doesn't match with the product team timelines. They trying to fix it now.\n4) The growth process is not clean."}, {"review_title": "Great place to learn", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "27 Oct 2021", "job_title": "Marketing Executive in Singapore", "duration": "N/A", "pros": "They give you a lot of responsibility from day 1", "cons": "The company moves too quickly and they often lose focus. There's always a sense of rush everywhere and people feel overwhelmed."}, {"review_title": "No Work Life Balance", "rating": "2.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "5 Oct 2021", "job_title": "Software Engineer in Singapore", "duration": "N/A", "pros": "No company politics, everyone is super friendly and helpful", "cons": "Basically u wont get a time to rest, constantly working. Burnt out"}], [{"review_title": "Worst Politics", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "17 May 2021", "job_title": "Senior Software Engineer in Singapore", "duration": "N/A", "pros": "Mobile bill reimbursement for both employee and dependents\r\nFree snacks.", "cons": "For most of the people working here think only mobile app is important and everything else is secondary. They call themselves a \"digital telco\" but they care nothing about being telco and their digital meaning is only mobile app. \r\nNo recognition for good hard work. Only people who are capable enough to play politics can survive and get recognised.\r\nPlans change every month and the company OKR is never aligned with engineering OKR which is ridiculous. They say all green when it comes to showcasing individual department achievements but when it comes to bonus, it's all red for company achievements.\r\nThey also run a scam called space explorer program which you can become if you are good in politics"}, {"review_title": "Questionable work culture and preferential treatment", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "18 Mar 2021", "job_title": "Senior QA Automation Engineer in Singapore", "duration": "N/A", "pros": "- some interesting challenges\r\n- working with multiple countries/markets\r\n- some telco infrastructure experience\r\n- work life balance was alright in QA automation. I’ve heard it’s a bit worse on a dev side.", "cons": "- lower than average pay (based on the other offers I got) \r\n- got paid a reduced bonus even though I’ve over-achieved (based on my OKR’s) and had no unfinished goals. Didn’t get any salary increments after a year either. Couldn’t get a straight answer on how to achieve more either.\r\n- weird organizational structure (huge pseudo-scrum teams that can not be efficient because they’re triple the size of what they should be). It’s hilarious to see 20+ people packed into a meeting room for a “standup meeting”. \r\n- poor coding practices and testing approach (developers don’t even write unit tests for God’s sakе). Huge reliance on manual QA.\r\n- incident culture - fixing issues in prod will be your main task. And no real strategies are implemented to prevent those issues instead.\r\n- some company policies and reward schemes incentivize office politics and preferential treatment. Higher management’s close friends are always right.\r\n- illusion of transparency - there’s a bunch of town halls and pulse-check polls, but none of the feedback is ever addressed. All the answers/solutions are PR friendly and any real criticism is swept under the rug.\r\n- company puts out an “innovation facade” but all the value comes from low prices and marketing. On the technical side there’s nothing innovative or impressive about the app or any backend systems. In fact it’s probably only still afloat because most people never use their telco apps."}, {"review_title": "Don't join at any cost! Run away! Don't believe in the rating more than 3 :-)", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "21 Aug 2021", "job_title": "Senior Software Engineer in Singapore", "duration": "N/A", "pros": "On time salary\r\nMobile bill and device reimbursement\r\nBreadth wise learning\r\nMonthly team lunch", "cons": "1.The founders and leaders talk a lot but they failed on each occasion.\r\n2.The more you stay and it silently destroy your career.\r\n3.Long working hours everyday, literally work from 9AM to until midnight\r\n4.In the name of ownership you have to work on weekends and attend the calls in the midnight\r\n5.No hike or increment\r\n6.Cheap labour camp, mostly they hire from India for low salary"}, {"review_title": "It's not for everyone, but one of the better places to be", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "5 Jul 2021", "job_title": "Anonymous Employee in Singapore", "duration": "N/A", "pros": "- Opportunity to grow, do interesting things\r\n- Managers, peers, and extended team are smart people \r\n- Stocked pantry with lots of sugary junk\r\n- Hacky way of doing things\r\n- Best idea wins, not who you are or how long you've been with the company\r\n- Chance to be Space Explorer with additional 6 months of equity", "cons": "- Team very lean and targets very high\r\n- Don't expect work-life balance here, leaders always pushing for more\r\n- Sometimes means well but execution is strange (e.g. give pay bump but 1 year claw back)"}, {"review_title": "In circles.Life there is fullstop before your life.  you got what i mean ?", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "17 Nov 2020", "job_title": "Anonymous Employee in Singapore", "duration": "N/A", "pros": "Hardly any apart from the mobile bill reimbursement", "cons": "bad product ideas pitched. everything revolves around 20GB data products. CEO also spoke about very high goals and stuff but in reality, they also know they are lying. Very bad hierarchy and teams get shuffled every other week with just fancy names like growth track alpha track and so ... but nothing works. CEO and management just playing around the employees and structure and that impact the delivery from engineering but they blame it on employees. Also they tell you you are not fit for fast paced environment. but in reality they don't know just changing the structure doesn't mean anything. fast pace means launching new products and not the launching the same product in different flavours. \r\n\r\nas everyother reviewer mentioned, you don't expect the work life balance here. few people are ok with this slavery kinda workstyle but they get appraised for that. and relatively make you bad performers. \r\n\r\nin short in circles.Life just notice there is full stop just before 'life' word and they are very good to make you feel the same way.\r\n\r\njust giving it 1 star as there is not way to rate below that"}, {"review_title": "A sham, a puff, and everything that amounts to nothing", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "16 Sept 2021", "job_title": "People and Culture", "duration": "N/A", "pros": "Can't think of anything, seriously. A lot of huff and puff, promises and smokescreens initially.", "cons": "Broken promises, founders who don't agree on anything yet have no guts to tell each other and their teams, leaving them to figure things out on their own. These folks don't really know how to run a company"}, {"review_title": "Hyper Growth and Learning", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "20 Aug 2020", "job_title": "Engineering in Singapore", "duration": "N/A", "pros": "- A lot of learning opportunity in terms of tech stack, process, leadership and more.\r\n- Startups are easy - No process, Code & Fix, lots of ad-hoc.\r\nEstablished companies are also easy - Full on process, top class code quality. \r\nIn Circles, I see it interesting and challenging since we are neither an early startup nor full grown. Innovation, Growth, Learning happens when someone is transitioning.\r\n- Good peers from whom people can learn a lot of things.\r\n- Seeing the stocks increasing multiple folds year on year.\r\n- Company's vision is really good and our CTO and CEO are really pushing for diversification.\r\n- CTO is a very planned individual and knows how to lead not just Engineering team but drives the whole company with his planning experience.", "cons": "- Seldom, we do have to go beyond working hours to get things done! It's not a regular thing though. And everyone is working towards a better work life balance. But yeah, I have joined a growing company so I chose to take some risks.\r\n- For pay, Circles doesn't claim to be the best in the market(slightly less) but I see stocks growing multiple times. Personally, If someone wants to be a millionaire, then we have to rely/trust on ESOPs."}, {"review_title": "Great company for growth and learning", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "16 Aug 2021", "job_title": "Software Engineer in Singapore", "duration": "N/A", "pros": "Many opportunities for learning and growing in the company. Very frequent meetings with the management to voice out any unhappiness in the workplace. Free snacks and drinks in the office. Smooth and fast interviews. Amazing HR personnel (Special thanks to Jinling).", "cons": "Work-life balance seems to be an issue in the company, overworked staffs"}, {"review_title": "Don't get buttered up by the vision and waste your effort here", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "25 Jun 2021", "job_title": "Engineering in Singapore", "duration": "N/A", "pros": "Other than the SaaS idea, nothing else is good about the company.", "cons": "Founders have the I am higher class than you attitude. They will complain straight to your managers while keeping the smile in your face.\r\n\r\nCTO is bringing in all his good pals to take the top positions. Either you get into their good books or else be prepared to face roadblocks at various junctures.\r\n\r\nBe prepared for the lack of psychological safety while working here. Often you hear people being asked to leave for poor performing or not align to the company vision reasons but the fact is that you stepped on the CTO pals tail and they will find all kinds of excuse to let you go.\r\n\r\nExecution is extremely bad and you have all the questionable engineering practices and short cuts leading to all kind of firefighting all over the place\r\n\r\nFeature factory but all the new features are buggy and just patch work. Often a feature gets into production due to product requirements but then all kinds of bugs/problems occur leading to even more \"workarounds\" and more of tech debt\r\n\r\n The rewards framework is only based on role expansion or promotion. Don`t expect to get yearly adjustments or good company performance bonus (same bonus % throughout the whole company). Role expansion requires you to be double/triple hat for a mere 5% - 10% increment. \r\n\r\nDuring the whole covid period the engineering team tries to get you to work in office as the top level prefers that. However 90% of the company works in the office without masks, safe distancing, temperature checks and even safe entry enforcements!\r\n\r\nThis is especially prevalent with the senior leaderships (CxOs) who are mostly in office daily without mask, meeting people in large groups all the time.\r\n\r\nWhen such issues are raised to the leadership during feedback/townhall/open hours leadership response are lack lustre."}, {"review_title": "Just deal with it", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "25 Mar 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- Many cheap food around the area\r\n- Well stocked pantry\r\n- Many good initiatives by the company (e.g. Space cadets program)\r\n- Flexible working hours\r\n- Great team culture\r\n- Good career opportunities\r\n- You'll learn ALOT in a short span of time here - you'll see so much personal growth.", "cons": "- Founders \r\n- Management\r\n- Office area sucks\r\n- A lot of favoritism within management teams, toxic. \r\n- Retrenchment management? Very poorly managed. (Beware)"}], [{"review_title": "Great place to learn and grow.", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "6 May 2021", "job_title": "Product Manager in Singapore", "duration": "N/A", "pros": "Circus life is a great place to learn and grow. You can get a lot of responsibilities at a very short period of time. The company is expanding fast and the new SaaS business has a lot of potential. The new engineering org is great and we are solving some real problems in the Telco world. I'm learning a lot and and I can see there is a lot of opportunity for learning in the near medium and long term.", "cons": "This will not be your 9 to 6:00 job but work life balance is respected by the management."}, {"review_title": "Not a place for A players.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "18 Nov 2020", "job_title": "Software Engineer in Singapore", "duration": "N/A", "pros": "* Mobile bill reimbursement.\r\n* Some for the leads/managers are good, but most of them have already left the place.", "cons": "* Toxic culture created by senior leadership team, they need a bunch of people who blindly follows them.\r\n* Too much politics. \r\n* Zero tech learning\r\n* Office location is in a warehouse and software engineers are slaves working there. \r\n* All leadership hires are just friends and acquaintance of the CTO.\r\n* The leadership team claims to be experienced but failed to deliver career path even after spending 1 year on it. \r\n* Doesn't know how to use the right talent. Circles was able to attract good talent, but doesn't know how to use them, this is because of the in-experienced senior leadership. \r\n* No job stability (psychological safety). If you question the CTO, you are no longer in the company.\r\n* Engineering in Singapore will be closing down soon, because the Srilankan CTO is expanding in Srilanka."}, {"review_title": "\"Not recommended, wasted my time there.\"", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "2 Jul 2020", "job_title": "Software Engineer in Singapore", "duration": "N/A", "pros": "The ambition is good but the execution is extremely chaotic and poor, most of the time products don't reach anywhere and your time will be spent mostly stabilizing/fixing existing products and No, you do not get learning opportunities, they don't have learning programs.", "cons": "1. nonexistent work-life balance (be ready to work on weekends and long hours).\r\n2. Very poor code quality and pathetic infra, so expect most of your time fixing issues.\r\n3. In the name of a fast pace environment, you are expected to attend to calls even at 2 in the night.\r\n4. Climbing to the next level career-wise, getting recognition is very difficult unless you are the kind of person who likes to insert themselves in unnecessary email chains and conversations with people and even then no guarantees.\r\n5. very average pay when compared to competitors.\r\n6. If you are vocal or express concerns against management, it won't bode well for you. E.g, they claim to hold an anonymous survey every month but it's not actually anonymous and if you don't write good things, well good luck then.\r\n7. Management is a mess and they change their decisions very frequently so no stability.\r\n8. And lastly, you won't learn anything new here, its mostly adding small features here and there, porting existing code for new launches, and you won't get time to learn anything new anyways."}, {"review_title": "Chaotic Mess", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "25 Mar 2021", "job_title": "Senior Leader in Singapore", "duration": "N/A", "pros": "Interesting model\r\nExposure to telcos\r\nAttempt to be a startup", "cons": "Unclear objectives\r\nUnclear org structure\r\nOpaque accountability \r\nMasking leadership failures by blaming staff"}, {"review_title": "Please don't join this company anywhere in the world.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "29 Jul 2020", "job_title": "Senior Engineer in Singapore", "duration": "N/A", "pros": "There is no pro in working for this company", "cons": "No work life balance. \r\nNo learning or career growth. This is not a professionally run company.\r\nYou can be let go anytime citing organisational changes.\r\nThe current CTO is a complete non technical person. He is trying to replace key people by bringing his friends from Silicon Valley. He intends to do nothing as he knows nothing. \r\nThere is no democracy here, in a lot of things CTO's attitude is \"my way or highway\"\r\nThe stock option plan (CSOP) is a SCAM.\r\nYou have to be in good books of CEO, CTO, CEO's Office Assistant to be employed here\r\nFounders' attitude towards employees is very disturbing. Many times I have seen founder(CEO) shouting at the ex-Head of Engg in the office in front of everyone. Imagine what would be case if it was a normal engineer in his place."}, {"review_title": "Great company to be in at the moment", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "8 Jul 2021", "job_title": "Engineering Leader in Singapore", "duration": "N/A", "pros": "Great company with unique values and is on hyper-growth mode with ambitious goals\r\nBeing part of the journey during expansion provides multiple opportunities and learnings\r\nGreat vision matching the market demand \r\nHaving right leaders to drive strategy", "cons": "Some traditional legacy elements getting fixed as we scale\r\nHistorical context which has no value in the current state and fwd"}, {"review_title": "Good vision, poor engineering culture. Do not join!", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "9 Nov 2020", "job_title": "Senior Software Engineer in Singapore", "duration": "N/A", "pros": "- The founders have got the vision for some of the greatest ideas in the telco domain.\r\n- The founders encourage feedback culture and they continuously seek for feedback for improvement (although they implement a very little portion of it).\r\n- You'll possibly come across some of the very talented engineers who really care of the product and the company. And you might then wonder why they're still working with this company.\r\n- The DevOps team has grown and improved significantly by moving to modern tech that makes the deliveries easier, faster, smoother and more reliable.\r\n- Encouragement for internal transfers (which could turn out to be a big scam).\r\n- Recognitions for exceptionally performing employees (they are doing this to simply retain employees who have created dependencies. LOL!).\r\n- Great domain that has survived and performed well amidst the pandemic.", "cons": "- No proper tech onboarding process or documentation. You are expected to find everything out by yourself.\r\n- Dangerously poor software testing culture set up by the management. The teams rely heavily on manual testing, which is not sustainable if they are aiming for frequent releases. They hire manual QA Engineers like crazy. There is little to no unit testing by the developers. Instead of building and using automated tests, the engineering management wants you to break your head on serving for on-call issues from production. It is like letting the issues land into production rather than avoiding them in the first place.\r\n- Dangerously low hiring standards. Rather than getting some genuine talent, the engineering management wants you to hire under-qualified engineers from a certain geography/location of their liking. You'll be frustrated interviewing the candidates and upon rejecting them, you'll be forced to approve them for a lower grade. This defeats the purpose of interviews. LOL.\r\n- Possibly the worst office location and locality in Singapore. Not at all recommended. Most Indian startups have better offices than this office.\r\n- Some \"People and Culture\" team members are rude for no legitimate reason.\r\n- The HR processes do not reflect inclusion for consultants in general.\r\n- Extremely poor reimbursement and leave tracking processes for consultants. You'l feel like you're living in 1990.\r\n- No values for new ideas. Any process improvement in tech that is not liked by the management will be avoided by simply quoting that you're working in a startup.\r\n- No proper process or framework for internal transfers. Your transfer will be twisted and cancelled anytime politically as per the management's moods. Extremely annoying.\r\n- Minimal insurance benefits. The dependents do not get the same benefits."}, {"review_title": "A growing start-up that comes with the joys and pains", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "1 Jun 2021", "job_title": "Product Manager", "duration": "N/A", "pros": "Lots of autonomy if you are driven, the sky is the limit. Plenty of opportunities are out there for grabbing if you can take the lead. Even interns can drive impactful projects.", "cons": "A lot of manual work, fire fighting on fixing bugs, lack of strong engineering support."}, {"review_title": "High Growth Company, Lot of learn opportunities", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "5 Jul 2021", "job_title": "Software QA Engineer in Singapore", "duration": "N/A", "pros": "* High Growth\r\n* Lot of things to Learn\r\n* Flexibility in work hours\r\n* Great Team with lot of diversity\r\n* Very good stock options", "cons": "* Office in India closed, lot engineering roles moving to Srilanka after upper management changes"}, {"review_title": "Good teammates / colleagues, bad work life", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "24 Jun 2021", "job_title": "Software Engineer in Singapore", "duration": "N/A", "pros": "Everyone is willing to help around here, will learn many things", "cons": "overloaded, poor management. many legacy tech debt"}], [{"review_title": "Decent but doesn't care about employees", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "14 Apr 2021", "job_title": "Product Development Engineer in Singapore", "duration": "N/A", "pros": "You'll get to work in a fast paced startup.", "cons": "You may not get the esops promised to you.\r\nYou may feel that you are not valued in the company\r\nThey pay extremely low as compared to market standards"}, {"review_title": "Great learning experience", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "14 Jan 2021", "job_title": "Product Manager in Singapore", "duration": "N/A", "pros": "1. Great learning experience: Joined here as a fresher in tech Product Management from healthcare Product management(Which is completely different), have learnt a great deal here, thanks to the peers and founders.\r\n2. Fast pace: Unlike my previous companies, things move fast here, there is a mindset of experimentation and quick POC's here which is enjoyable if you are here to learn", "cons": "Not really a cons for me, but when you have a bold vision, sometimes there are some days that can be challenging because the company is moving forward all the time; If you take a long term view, these things really dont matter"}, {"review_title": "About Circles.Life", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "10 Sept 2020", "job_title": "Software Engineer in Singapore", "duration": "N/A", "pros": "* Mobile bill reimbursement\r\n* Free lunch on Wed\r\n* Good team-mates\r\n* Flexible working hours\r\n* Allow working from home\r\n* Free snack\r\n* Cutting edge technologies", "cons": "1) Still a lot of politics\r\n2) No Work-life balance: Expect you to work on overtime, holiday, and weekends. Expected to attend call event mid-night. \r\n3) No career growth and learning: Expect you to work on multiple projects with very poor code quality and pathetic infra, so most of your time is to fix issues. \r\n4) Management decisions keep changing frequently and there is no stability. \r\n5) Most of the employees are not happy and leaving because of work-life balance, contexting switching, overloaded with muitple projects which never work on before."}, {"review_title": "bad work life balance", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "5 Sept 2021", "job_title": "Product Manager in Singapore", "duration": "N/A", "pros": "fast pace\nchallenging\ndecent salary\nsome stock option", "cons": "long working hours\ndemanding bosses\ninternal layers of approval"}, {"review_title": "Cool and unique place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "14 Dec 2020", "job_title": "Engineering Manager in Singapore", "duration": "N/A", "pros": "1. Challenging environment where you own your growth by showcasing your best work. There is always an opportunity to take on more responsibility and ownership.\r\n2. Great team. I enjoy working with and learning from a very diverse team (both within and outside engineering)\r\n3. The esops plan is quite unique and employee friendly.", "cons": "1. Office facilities but that's becoming less of a problem with the current situation.\r\n2. Telecom is still a very rigid and inflexible industry - not easy to change old processes and practices\r\n3. Still very much a startup (in most areas) so, some of the usual disadvantages are still valid."}, {"review_title": "Great company to work in Asian region", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "11 Jul 2021", "job_title": "Software Engineer II in Singapore", "duration": "N/A", "pros": "Friendly environment, Lot of things to learn, Latest Technologies", "cons": "nothing to say about cons regarding circlesLife"}, {"review_title": "CSOP scam", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "6 Nov 2020", "job_title": "Senior Software Engineer in Singapore", "duration": "N/A", "pros": "once upon a time there were some good folks who created some best practices. now those folks are no more and those practices are being ruined by new amateur engineers.", "cons": "Biggest CSOP scam they have done. Don't fall for what HR says. Ask any former employee like myself on linkedin who has spent more than 2 years there and got nothing till date except that a promise for future which keeps extending few months every now and then.\r\n\r\nBe ready for a day when HR will come and say you know we promised to pay to $x amount of salary per month its written in your offer as well but we can not pay you this amount as there is no budget. And the employee can not do anything except if you want sue them. but who does that right ?"}, {"review_title": "Do not join, engineering is getting outsourced to Sri Lanka office!", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "6 Oct 2020", "job_title": "Senior Software Engineer in Singapore", "duration": "N/A", "pros": "Mobile bill and device reimbursement.", "cons": "Too much hierarchy, as other reviews have mentioned there are multiple managers to manage a single person. None of them has any people management experience.\r\n\r\nCTO is brining all his friends to the company. They are moving the engineering work to Srilanka. There is a high chance that they might fire all the engineers in the Singapore office or force them to leave.\r\n\r\nFounders have no spine, despite CTO doing things at his will they are not even saying a word.\r\n\r\nCEO is a big mouth person who does not have any skill on how to run a company other than talking random stuff.\r\n\r\nPeople are getting hired randomly in Srilanka office (mostly friends or friends of friends) even if some of the candidates are not good. They are still rolling out the offers.\r\n\r\nOnly god can save this company!!!!"}, {"review_title": "Toxic environment to be in.", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "15 Oct 2020", "job_title": "Software Engineer in Singapore", "duration": "N/A", "pros": "Mobile reimbursements and free snacks and drinks", "cons": "Since the start of 2020, the working environment has been extremely toxic and we have to stay back every night to complete the tasks given. \r\n\r\nProduct Managers are clueless and expect things to be settled on the spot. \r\n\r\nI still remember that one of the founders has promised and guaranteed us that our team will be safe and none of us will not be terminated. But a week after, some of us need to leave the company! Lesson learned, when you are in a company, trust no one. Just do your work diligently and do not believe in such fake promises made by the upper management."}, {"review_title": "Best company to work to loose your work life balance and be fooled by bunch of lies", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "9 Feb 2021", "job_title": "Anonymous Employee in Singapore", "duration": "N/A", "pros": "- Always the environment is very sweet with sugar quoted lies\r\n- Can become great at FIRE FIGHTING instead of solving problems\r\n- Will become proficient in finding loop holes and managing the sinking ship rather than fixing it.", "cons": "I doubt if the space is enough to cover all of them here\r\n- Right from the Hiring till the exit of the employee the company is just surviving on selling lies to its employees\r\n- The tech recruitment team would promise something during the interviews and when you ask them for the promised pointers, those would not be honoured and the answer would be \"WE ARE CHANGING and THINGS HAVE CHANGED ALOT and now we cant honour them\"\r\n- Most of the efforts spent last year by the top management were spent on firing and closing down the offices\r\n- No proper methodology followed in firing as well, even the top rated employees were asked to leave though they still harbour very poor and low talented folks, but preach \"HIGH PERFORMING CULTURE\"\r\n- New CTO needs a mention here, even his words can't be taken into confidence as well, as they turned out to be biggest bunch of lies of the lot.\r\n- No recognition for hard workers in terms of financial benefit or job security\r\n- Please dont bring or even consider the CSOP's for anything\r\n- Completely run by few set of employees who are with the organisation from a very long time\r\n- No growth trajectory defined for any roles\r\n- Managers were made scape goats based on pulse check scores\r\n- Too much bureaucracy in day to day works\r\n- Non Tech founders who dont understand the real issues at the ground level\r\n- Tech leadership, never bothers about tech debt and just keeps on delivers bad code\r\n- No motivation to work\r\n- Monthly townhalls are full of lies where the word TRANSPARENCY is a mere word which has its different meaning altogether.\r\n- Finally orchestrated positive reviews here on glassdoor to counter the negative reviews \r\n\r\nMany more........"}], [{"review_title": "The Fyre Festival of Telcos", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "1 Mar 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "After 2 years, the only pro I see left in the company is the sense of camaraderie among colleagues that think alike and different to the management of the company.\r\n\r\n2 years ago there was a sense of purpose to actually deliver a better product, but that is lone gone.  Mainly due to the endless pivots and short-sighted ideas the founders attempt to launch and believing the management they've put in place will deliver, when in reality they are not suited for their roles or the objectives of the company.", "cons": "The culture of the company is the worst I have seen.  Toxic, and it is a pure reflection of the many  insecurities the founders have and their urge to make an exit rather than building the company they boast about in the townhalls, and no one believes them.  \r\nThis comes partly because they do not have management experience, and mostly because they've put in place managers who merely act as \"yes-men\" and are grossly incompetent.  This results, in managers becoming extremely political because they are continuously scrambling for resources to cover up for their lack of knowledge.\r\nThey started with an amazing product to bring down costs vs big telco players, but it was as clear as daylight that the big players in the market took a nanosecond to adjust prices and compete.  Now Circles is not growing its subscriber base since mid 2020, furthermore it is disregarding it's other markets (Taiwan is closing) because they realized that the MVNO model doesn't work any more.  Take a look at their marketing strategy, it is as simple as throwing money at subscribers to keep them.  Not sustainable in time.\r\nThis has pushed the founders to pivot to the B2B model and become to big telcos, what Grab & Uber are to the ride hailing industry.  They boast about their Circles-X platform and how they can solve the 20-year old problems the industry has had.  However, as we all know, all of Circles' tech is based on Oracle (+90% of it).  Even to the point that Circles doesn't even have a registered IP because it did not develop anything.\r\nThen there's the CSOP plan which everyone bought into thinking they had upside in the company.  Only later to find out that the plan had many irregularities, specially after the company brought in a private equity fund.  Word around is that CSOPs are worth nothing because they are not tied to equity, but also that the Founders have cashed out in the latest funding round.  This is very frustrating.\r\nThen there's HR & Talent, which continuously keeps on walking out the door because they become frustrated or because they are tired of the politics and having to deal with the incompetency of managers and the lack of willingness of founders to listen to alternative points of view. This only leaves the wrong type of people in the company, or those who need to stay in it because of EP issues, and that number is significantly high and founders use that as leverage when negotiating salaries."}, {"review_title": "Its great when its great", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "10 May 2021", "job_title": "Employer Branding Expert (Creative Media) in Provo, UT", "duration": "N/A", "pros": "The people are generally nice depending on which team you were in", "cons": "They say they have transparency but what it means is its at 95% opacity"}, {"review_title": "Good Team", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "29 Jun 2021", "job_title": "Sn QA Engineer in Provo, UT", "duration": "N/A", "pros": "Management is transparent to the workers", "cons": "Salary package low and not attractive"}, {"review_title": "I've worked in Circles.Life for 2 years.", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "7 Sept 2020", "job_title": "Software Engineer in Bukit Merah Estate,", "duration": "N/A", "pros": "1. Good teammates. Who can share with you experience and also become a good mates in a life.\r\n2. Growth opportunities. Position growth and also tech skills growth (company provide opportunity to get online courses).\r\n3. Taking ownerships. You will have more communication with product team and design the feature yourself than get tasks from your lead.\r\n4. Good benefits. In the mid of the year and at the end.\r\n5. You can give a feedback and communicate directly with the top managers and founders.", "cons": "1. Overwork and overload - now the processes more stable than it was before, but this is still happen.\r\n2. If you are developer, then notice that company most focused on the product, that mean quality goes in the second order some time."}, {"review_title": "Good company to work for", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "21 May 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Provides a great opportunity to learn and earn. Also to have more responsibilities incase one is interested.", "cons": "None I can think of"}, {"review_title": "Tough but fulfilling ride", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "3 Aug 2020", "job_title": "Product Manager At Circles Life in Singapore", "duration": "N/A", "pros": "- You can take ownership of any project really, you just need to want it enough and be up for the challenge\r\n- Team-mates are really friends / family, since everyone has signed up for the same journey and face similar challenges", "cons": "- Perhaps founder level / senior management are too tactical in approach. They have a crystal clear vision statement, but not the same level of clarity for 1 / 2 year mission statements\r\n- People from big company backgrounds don't realise only <1% startups get to where Circles.Life is - so be prepared to see differing opinions from employees (even on glassdoor)\r\n- Give opportunity to work from international offices / should be mandatory / rotational for max exposure"}, {"review_title": "A quick experience sharing....", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "24 May 2021", "job_title": "Product Executive in Singapore", "duration": "N/A", "pros": "Many snacks/drinks/fruits to choose from daily. You get to enjoy team lunch and cakes regularly.", "cons": "Poor management and working culture is far from best. Lacking proper planning for future projects and planning."}, {"review_title": "good potential, but needs to focus on becoming tech company again", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "29 Nov 2020", "job_title": "Engineering Lead in Singapore", "duration": "N/A", "pros": "5G is a growth area, so there's good potential if leveraged correctly.\r\n\r\nmobile bill reimbursement.", "cons": "top management is not receptive to honest feedback. good people have been let go due to shallow cost cutting measures and need for immediate results without slowing down and investing deeply in the tech platform first.\r\n\r\nsalary structure is not competitive to attract and retain the top percentile"}, {"review_title": "Ambitious Company", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "9 May 2021", "job_title": "Senior Software Engineer in Singapore", "duration": "N/A", "pros": "Growing fast, high calibre manager", "cons": "Too mant overtime, on call is worst"}, {"review_title": "Exciting & Full of Promise", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "7 Mar 2021", "job_title": "Founder's Office in Singapore", "duration": "N/A", "pros": "You get to be part of a team that is disrupting the telco industry and bulldozing the competition. Dynamic and fast paced.", "cons": "You have to chart your own course - There's no reference guide for an uncharted journey."}], [{"review_title": "please, really dont.", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "24 Jun 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "the startup life, where you can to learn alot", "cons": "the negativty by the cto"}, {"review_title": "Culture needs to improve", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "29 Apr 2021", "job_title": "Engineer", "duration": "N/A", "pros": "Friendly team mates. Nice working environment", "cons": "Too political. Individual departments can’t work well together"}, {"review_title": "The last place you want to work for", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "15 Apr 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Barely any pros to call out for this company", "cons": "Lack of direction, basically scrambling month to month with unrealistic targets. Stay as far away as possible"}, {"review_title": "Feedback", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "14 Jan 2021", "job_title": "Recruiter in Singapore", "duration": "N/A", "pros": "- Start up experience of learning and doing things from scratch\r\n- Advanced ATM system and tools were in place", "cons": "- Decisions are not aligned between founders and Engineering Heads\r\n- Delay in receiving feedback from Hiring team"}, {"review_title": "Bad", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "10 Jun 2021", "job_title": "Designer in Singapore", "duration": "N/A", "pros": "Free snacks in the pantry", "cons": "Everything, from manangement to work life balance and remuneration"}, {"review_title": "Great vision, disrupting the market", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "24 Nov 2020", "job_title": "Senior Software Engineer in Singapore", "duration": "N/A", "pros": "Circles has managed to disrupt a sector which hasn't seen innovation in a long time. Because of the pace of innovation, there is just so much to do and so much to learn. I get to punch beyond my weight category. Because we are finding answers on the go, that keeps me challenged.", "cons": "Sometimes code quality takes a toll as there is not enough time to always adhere to the process."}, {"review_title": "[BEWARE] If you are smart run as far as possible from this company", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "22 Sept 2020", "job_title": "Engineer in Singapore", "duration": "N/A", "pros": "*May get to work on a variety of things. Breadth wise learning can happen depending on your interest and the level at which you join. But, if you are looking to sharpen your skills then you will get disappointed. \r\n*People and culture team - the only ones still trying to create positive environment in the company\r\n*Town hall meetings\r\n*Wednesday Lunches[depends on your taste though]\r\n*On time salary\r\n*Marketing team - Backbone of Circles", "cons": "I wish I could say take this big feedback with a pinch of salt and there are shades of grey here and there. But, when the complete environment is shady, it's my duty as an engineer to warn others.\r\n\r\n\r\nHere are some factual points -\r\n\r\n1) Management - Manager's who have joined recently seem to be better than the existing lot, let's wait until they become part of this system, or leave. Old ones just benefited and became managers because of sticking with the company for a long time and don't have the people management skills, or right technical skills, or both management and technical skills\r\n2) Politics - From top to bottom it is there. It's not an engineering company but a political setup\r\n3) Pressure - You won't know the reason but there is a constant pressure\r\n4) Poisonous - The more you stay in this company, more bad it will do to you personally and professionally\r\n5) Learning - They give few \"chosen\" employees some online courses coupons, others are neglected as they are just labours. You need to be favoured by your manager for this, some genuinely hard working guys are also given this benefit, but the ratio is [1:5::good:mediocre]\r\n6) CSOPs - BIGGEST SCAM, in the last one year policy w.r.t. awarding of CSOP's was changed almost every month. It was done to deny you CSOP's in every way possible\r\n7) Exits - Many people were handed pink slips. People were fired in the worst possible way, no professionalism even when parting with your own employees. Looking at the mayhem, and the unstable environment, many good people quit themselves out of self respect, as they didn't find this company worthy enough to put their career on the line\r\n8) Marketing heavy - It's a big marketing setup where starting from founders to CTO they know how to sell subpar things at good prices and raise funding. Check the advertisements of Circles.Life in Australia and cat videos in Singapore, if these resonate to you, then please go ahead. Also, I hope you are smart enough to have figured out how there are many 5 star ratings [no brainer - added by HR team]. Look at recent exits in the HR team and you would know the situation\r\n9) Bonus and Hike - 0.5 months of bonus to most, 1 month bonus to chosen ones. No hike was given to most citing different stories, no consistency even among stories\r\n10) Space cadet and explorer - ANOTHER SCAM. If you feel hard work can help you become one, you will be disappointed. Most of the people who have got these fancy rewards won't even find a decent job in a good company outside. It's just a mechanism to retain people who have created dependency in company\r\n11) Growth - hahaha, no growth in any terms. No clear career progression roadmap defined. Every month starting last 1 year a new timeline was given about releasing career progression and role definition guide\r\n12) Hierarchy - People report to anyone and anyone can become manager/lead[literally anyone], true for more than 75%  of the lot. Look at the profile of the people with whom you are supposed to work, or to report, before you accept the offer. Also, refer to point no 1 when making the decision about joining this company\r\n13) HR - Bunch of spineless people. Worst I have experienced so far in my career, they are the ones who just want to lay policies to fire people, and don't care about how to make people grow. But, I pity them, due to the condition outside they are just doing everything asked to save their own jobs\r\n14) Employee benefits - No insurance for family, it only covers employee, no memberships, no education support, monthly phone bills can be reimbursed [here comes the surprise - you need to submit bills every month for the same, thing as simple as this in a TELCO company, where founders/CTO in one breath compares Circles to FAANG is not automated]\r\n\r\n\r\nCircles.Life company motto is to run fast and the company name has circles in it. Company name itself should give you a cue, as a circle means no direction. \r\n\r\nFill in the blank puzzle for \"Physics\" fans ?\r\nWhen you run around a circle with the speed of light you end up ...?... yourself. \r\n\r\nIf you have figured out the blank, you have already proven that you are smart. I don't need to convince you more about what to do or not to do. \r\n\r\nIf you want to work in a madhouse, like to work with people who would talk about random things which wont make any sense, want to learn big technical jargons, want to learn about how not to build a product (engineering as well as product wise), then you are lucky to have found this company. Only if you are in dire need of a job and not finding any other good position you can think of joining this company. Otherwise for your own sake I suggest keep on looking."}, {"review_title": "Great place to learn", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "28 Mar 2021", "job_title": "Software Engineer in Singapore", "duration": "N/A", "pros": "Fast environment and a great place to learn", "cons": "I do not see any cons"}, {"review_title": "Very unstable and nothing that recruiters promise", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "30 Mar 2021", "job_title": "Software Development Engineer in Singapore", "duration": "N/A", "pros": "You will be promised a lot of things while hiring", "cons": "None of those promises will be delivered."}, {"review_title": "Toxic Culture and Unhappy Employees", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "13 Aug 2020", "job_title": "Anonymous Employee in Singapore", "duration": "N/A", "pros": "- able to wear many different hats since you're joining a startup environment where they throw you multiple tasks and projects to do. this would look good on your resume if you have the mindset of hustling and taking on everything that comes on your plate\n- there are some good people in the company, talented, hardworking, humble and ready to really make an impact. you would be very lucky to work with them.", "cons": "1. retrenchment exercise was a joke. \n\nemployees were let go without dignity, told that they were let go and expected to return assets within an hour or two the same day. no damage control, no sympathy. during the meeting, told some employees they were being let go because business needs changed, but after that newspaper reports and even a Glassdoor review below mentioned that people were let go due to performance/ productivity issues (if you fire entire teams in Singapore, Taiwan, Australia, and India, are you sure you're doing right by the employees if you said they were bad performers?) in my pov, a company that does this to their employees have 0 respect and you would be better off not joining lest you face the same situation.\n\n2. promises stock options but gives nothing\n\nas a non senior management employee, esops promised were never exercised or given. many people have left and are unable to exercise their stock options (we paid to have them) and I'm not even sure about the legality of their practices. \n\n3. lack of transparency. \n\ncompany wide townhalls questions are vetted beforehand, and founders/ leadership team prepare their answers. expect 3 minute answers that are vague and promise things far off in the future without really getting to the point.\n\n4. huge superiority complexes, founders and senior management believe \"if you dont fit our culture, then maybe this isnt the place for you\". Very narrow minded thinking, if you arent giving 200% and sacrificing your own personal time, being aggressive in pushing your ideas, or exceeding (not just meeting) your kpis, then you arent a culture fit in their eyes to be honest."}], [{"review_title": "My experience .. not for everyone!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "27 Sept 2018", "job_title": "Senior Engineer in Singapore", "duration": "N/A", "pros": "I have been working in the engineering team for now 1.5 years. Now I have to say I would have not work anywhere else. \r\n\r\nCompany has ambitious targets and it is proven itself in the past\r\n\r\nTeam has grown 5x. When our growing this fast, its not for everyone.\r\n\r\nYou can change your roles or grow into languages. huge autonomy and ownership.\r\n\r\nAt times when someone is sick, heads go to their homes and deliver food. \r\n\r\nWe do social activities almost every week. Once a month there is a huge team outing. Once every two months, we also \r\n\r\nIn terms of the telco stack, its the most advanced thing to work on in this field. \r\n\r\nSo not for everyone, the and that becomes clear very fast.", "cons": "Need to do a better job in addressing the isolate cases where people are struggling. Hiring a lot is important and tough but better set expectation at the start when people join. \r\n\r\nStrong performance environment can be tough for some people. Also some people are young so they need more hand holding /guidance. \r\n\r\nWe need to make that available.  \r\n\r\nWe should do more townhalls for engineering. Let leads and people run those townhalls rather than head"}, {"review_title": "No where is perfect but definitely room for improvement", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "16 Feb 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "as startup as they come", "cons": "culture has some issues to work on"}, {"review_title": "Good company to work for!", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "27 Dec 2020", "job_title": "Senior Software Engineer in Singapore", "duration": "N/A", "pros": "1. Good exposure to new technologies. \r\n2. Can pick up and work on anything that interests you. If you're able to do well, more opportunities await you.\r\n3. Great work-life balance.", "cons": "1. A lot of firefighting goes on.\r\n2. Low hiring bar"}, {"review_title": "Low Pay High Growth", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "21 Feb 2021", "job_title": "Manager in Singapore", "duration": "N/A", "pros": "- Exciting new roles\r\n- Endless learning and growth potential", "cons": "- Office politics from a senior member\r\n- Low pay, unclear benchmark"}, {"review_title": "Circles.Hell - Your Slavedriving Nightmare", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "3 Aug 2020", "job_title": "Anonymous Employee in Singapore", "duration": "N/A", "pros": "• Strong consumer branding - So your family and friends *think* that you're doing good work in a good company.\r\n• Phone bill subsidies - You don't have to pay for your phone bills here.\r\n• Easy to get hired - Circles.Life has quite a bad rep as an employer, so you don't have much competition if you apply to join.", "cons": "• Slavedriving culture - Long working hours can be expected. You can literally work from 9 am all the way to 9 pm, and that's the norm. I've seen folks have to work past midnight and even regularly on weekends.\r\n• No respect for personal time - You're pretty much expected to work or be on standby 24/7. The founders and senior managers will text you outside of work hours and during the weekends, and you are expected to work on things immediately. Even when you are on leave.\r\n• Lousy CEO - Your typical ex-consultant who knows how to talk big but cannot execute. Pretty much sums up the lack of leadership to steer the company out of its current mess. He claims he listens to feedback but actually he doesn't. He surrounds himself with people who feeds him with validation instead of good ideas.\r\n• Culture of Dishonesty - This company is built on a web of lies and admittedly strong marketing. On the surface, this looks like an innovative company. Underneath, it's just a patchwork of makeshift blocks put together to look like a functional business. Fake it till you make it - claims to be the best telco in Singapore but doesn't even provide decent network coverage for most of it.\r\n• Meagre compensation - To be fair, they do pay the market average. But when all things considered, the long working hours plus the impending karma from participating in all the lies makes the compensation package meagre at best."}, {"review_title": "Circus Life at Circles.Life", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "31 Jul 2020", "job_title": "Product Manager in Singapore", "duration": "N/A", "pros": "Can't think of much - maybe just the perks of having your telco bills paid for?", "cons": "TOXIC WORK CULTURE: You're expected to work overtime and on weekends/holidays. It has become such an expectation that it has permeated throughout the whole organization. It gets frowned upon or even \"escalated to your superiors\" if you do not provide \"timely support\" (even outside of working hours).\r\n\r\nNO WORK-LIFE BALANCE: Especially if you're at the working level. You can find yourself easily working 18-hour shifts on weekdays. Meetings are arranged on weekends and sometimes on public holidays. If you do see any other reviews that claims that there is plenty of work-life balance here, they are probably at the top managerial level where they do all the talking and none of the heavy lifting.\r\n\r\nCLUELESS LEADERSHIP: The CEO is known to prefer yes-men over those who are opinionated but genuinely have good ideas, but the founders and senior management have little clue on how to bring the business forward. The lack of business acumen and relationship management is appalling, as the constant cherry-picking and indecisiveness have caused the company to lose out on potential growth opportunities and new revenue streams. Instead of rectifying this, the leaders have been sugarcoating the lack of growth with big words and fluffy \"motivational speeches\".\r\n\r\nCAREER REGRESSION: Earlier in 2020, the company laid off a huge number of employees due to over-hiring from the previous two quarters, but chose to blame it on the employees for being poor performers. Many co-workers joined for a specific role but was eventually asked to work on a totally different scope as early as one or two months into their employment."}, {"review_title": "Work Satisfaction", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "17 Feb 2021", "job_title": "Marketing in Singapore", "duration": "N/A", "pros": "Lots of opportunities to learn and go beyond typical job scope", "cons": "Hard to maintain work life balance"}, {"review_title": "Good Place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "13 Jan 2021", "job_title": "Anonymous Employee in Singapore", "duration": "N/A", "pros": "- Good learning opportunities\r\n- Friendly people and collaborative env\r\n- Listen to employees feedback and always try to improve", "cons": "- There is more scope in improving salary baselining but CSOP, bonus program are good."}, {"review_title": "This is not a company, this is labour camp", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "15 Jul 2020", "job_title": "Engineer in Singapore", "duration": "N/A", "pros": "Pros:\r\n\r\nWednesday lunches and team lunches before Covid-19\r\nFree snacks and pantry at office\r\nDigital Telco and digital environment hence easily transitioned to WFH\r\nDress-down culture, you can wear anything to office.\r\nExcept these, a lot of other things are bad.", "cons": "Cons:\r\n\r\n1) The culture is last-minute culture. They do not understand that things need to be properly planned and executed. If they need something for the weekend, they will only raise last-minute on Friday evening and call you “blocker” if you don’t work on Friday night or weekends.\r\n\r\n2) Many bad managers are around (although new managers seem to be good). Bad managers will not protect the team and they will not care about the wellness of the employees. Instead of finding out why there are so many last-minute requests (from number 1), managers will just ask the employees to work on weekends. If you do not work on weekends, they will mark you as “under-performer” and just let you go. They basically treat employees as slaves and expect to work 24/7.\r\n\r\n3) During town hall in front of everyone, department head likes to say that they are building the best place to work and grow and weekends work are not expected. Yet after the town hall behind the scene, they will still ask employees to work on weekends.\r\n\r\n4) Poor work-life balance\r\n\r\n5) Performance review is very biased based on “personality favoritism” and not on actual performance. Even if your performance is decent, if you make 1 mistake, you may be asked to go. However, those people who are performing nothing will stay in the company for long.\r\n\r\n6) They do not know how to scale or plan ahead. When engineers work on issues, they only care about fixing the issues in the short-term without thinking about long-term scalability, stability, sustainability or security. Many people in tech team call themselves as tech person but they are not even familiar with those concepts. So there are many recurring issues because things were not properly done in the first place. It may not be engineers fault because they are all over-worked because of bad managers above (from number 2).\r\n\r\n7) Founders make mistakes and wrong decisions at the expense of employees, like closing down Australia and Bangalore office, laying off many people across all regions and giving less than 1-month bonus with 0 increment.\r\n\r\n8) No job security. You may be let go anytime. We cannot trust the founders. After Australia and Bangalore office closed, founders mentioned in the town hall that there would be no more laying off. Soon after that town hall, laying off in Singapore started.\r\n\r\n9) Positive reviews here are doubtful because employees are asked to write good reviews and they are asked to put themselves as “Shareholder” on LinkedIn. \r\n\r\n10) Out of my 10 years of working experience, Circles.Life experience is the worst ever. The only happy day I had in Circles was my last day. The moment I returned my laptop, I felt relief.  I am free from this slavery."}, {"review_title": "Best place to work and very trusted company - unlimited your career growth", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "2 Aug 2020", "job_title": "Senior Software Engineer in Singapore", "duration": "N/A", "pros": "Loyal, well paying, value for money, job satisfaction, friendly staff, \r\nGood learning, open organization structure, great team, and latest technology, very innovative, unlimited growth. \r\nGood work-life balance. flexible timing\r\nAccess to senior management\r\nGood ideas are welcomed", "cons": "This company is best in every possible way, so i don't find any Cons**"}], [{"review_title": "Not perfect but getting there", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "15 Nov 2020", "job_title": "Senior Software Engineer in Singapore", "duration": "N/A", "pros": "The new engineering leadership has rich global experience and is trying to bring about a lot of change. Still a lot of distance to cover but the intent seems to be there. New processes are being introduced.", "cons": "Still pretty manual and hence, hectic"}, {"review_title": "Not as shiny on the inside", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "11 Jan 2021", "job_title": "Project Manager in Singapore", "duration": "N/A", "pros": "snacks, food, friendly colleagues, cool vibe", "cons": "over promise, under deliver, weak leadership team"}, {"review_title": "Never again", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "25 Mar 2021", "job_title": "Consultant", "duration": "N/A", "pros": "Loads to learn and grow", "cons": "Politics from all the way from founders to developers"}, {"review_title": "Just dont", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "12 Feb 2021", "job_title": "Software Engineer in Singapore", "duration": "N/A", "pros": "To be fair, at this point I feel like there are no pros.", "cons": "Too many to enlist them. Simply put, do not."}, {"review_title": "Avoid if you can", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "24 Feb 2021", "job_title": "Senior Software Engineer in Singapore", "duration": "N/A", "pros": "The company is in a hyper-growth stage", "cons": "Work 12- 15 hours a day."}, {"review_title": "Not Recommended", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "16 Feb 2021", "job_title": "Software Engineer in Singapore", "duration": "N/A", "pros": "No reasons to work here", "cons": "Do not join this company"}, {"review_title": "High growth company.. great to place to grow professionally and personally", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "9 Nov 2020", "job_title": "Digital Marketing Specialist in Singapore", "duration": "N/A", "pros": "Celebrate feedback\r\nempower to do what you want\r\nembrace change", "cons": "Chaotic (just like any startup)\r\nGround realities don't meet tall & ambitious goals"}, {"review_title": "Not Recommended", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "4 Feb 2021", "job_title": "Software Engineer in Singapore", "duration": "N/A", "pros": "No Pros I can think of.", "cons": "No work-life balance.\r\nNo salary hikes."}, {"review_title": "One of the worst places to work as a software engineer", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "17 Feb 2020", "job_title": "Software Development Engineer in Singapore", "duration": "N/A", "pros": "1. Somewhat flexible work hours which is cancelled out with constant micromanagement\n2. One of the founders is quite knowledgeable and eloquent. \n3. Weekly lunch", "cons": "1. Product team and marketing are flooded with unachievable targets while the quality of platform and current products is unequivocally bad. They boast about having the plug and play type of platform while almost all the time the development team is fixing things, that in turn messes up other things. Inspite of having great developers the pressure put on them makes them find shorter easier ways yo get things done, this pressure trickles down all the way from top.\n2. They use “foreign” developers as DONKEY WORKERS, paying very less than the average with the promise of getting better bonus and shares options. Last year most of the people got less than half of their salaries as YEARLY bonuses!\n3. Many bad apples in the company who have created teams of friends who stick with each other and maintain dominance. Everyone points fingers at others, little to no ownership mentality in the managers/ leads and bad work ethic.\n4. Founders and leadership teams only promote and give better roles to people they have personally worked with and are close to. They have a proper performance and review process but it does not matter at all. Performing developers and silent quality workers never get appreciated and or get recognised for the time and effort they put in. \n5. Bad quality, limited amount of food items in pantry"}, {"review_title": "Unprecedented Growth and Learning Opportunities", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "23 Jun 2020", "job_title": "People & Culture in Singapore", "duration": "N/A", "pros": "Ownership given, ambitious vision, customer obsessed, innovative mindset and unique culture.", "cons": "At times the company moves too fast due to ambitious growth targets."}], [{"review_title": "Do not join!!", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "12 Jul 2020", "job_title": "Account Executive in Singapore", "duration": "N/A", "pros": "Competitive colleagues & innovative ideas to gain more streamlined & automated processes", "cons": "Deceitful to employees; unclear company vision thus result to spike in employee turnover"}, {"review_title": "Great place to grow", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "25 Sept 2020", "job_title": "Project Manager", "duration": "N/A", "pros": "A lot of opportunities to work beyond your scope and relatively flat hierarchy.", "cons": "No clear structure on salary increment or taking up courses."}, {"review_title": "Intern Salary at Circle.Life", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "11 Aug 2020", "job_title": "Intern in Singapore", "duration": "N/A", "pros": "- Fast paced high growth company\r\n- Younger colleagues\r\n- Very open minded culture", "cons": "- Lots of Red Tape\r\n- Constantly changing objectives can be hard on some people"}, {"review_title": "Amazing.......ly bad company to work in", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "8 Oct 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Wed Lunches, pretty much thats it?", "cons": "Upper management doesn't bad an eye if you perform well. They will relentlessly let you go and deem it as \"change in organization structure and direction\""}, {"review_title": "DO NOT JOIN", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "5 Jul 2020", "job_title": "Software Engineer in Singapore", "duration": "N/A", "pros": "If you have survived more than a year, you will have a thought of joining actual politics. Too much learning opportunity of politics. (I had it :p)", "cons": "HR posts many reviews here to keep rating of company high, take cons in reviews seriously."}, {"review_title": "Do not work here. Awful company culture which doesn't connect with anybody", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "4 Jul 2020", "job_title": "Technical Support Specialist in Singapore", "duration": "N/A", "pros": "None, sorry to say. A sweat shop. Exploit whenever they can.", "cons": "- Management who pretends to take feedback but will always do their own things\r\n- Non-competitive pay. \r\n- More about making noise then real deliverable."}, {"review_title": "Please don't join", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "7 Jun 2018", "job_title": "Software Engineer in Singapore", "duration": "N/A", "pros": "Only pro would that the colleagues are good apart from the management. Because same problems have brought everyone more together. Everyone can relate to the problem and sympathise with each other.", "cons": "Please don't join this company if you're a software engineer.\r\n\r\nThis company is the ideal workplace for managers who don't care about the engineering culture and think of engineers as just some cheap labour. That is why they are always after hiring cheap Engineers from the Indian subcontinent or very pathetic service companies.\r\n\r\nThere idea is that if they can get all engineers from a poorer background and dependent on visas then they'll be able to oppress the engineers. \r\n\r\nThe job is 99% production support and 1% building features on top of the worst codebase anyone can see in their whole lives. You'll get frustrated to your core.\r\n\r\nThe technical management has zero technical skills and think they can run a team of software engineers but just oppressing and old school management techniques. It's really disgraceful.\r\n\r\nIf you value software engineering even 1% then don't join this company. Don't fall in their trap. They keep saying that the situation will improve but it has only gotten worse every day for the past year.\r\n\r\nThis is the reason that most engineers leave this company in a matter of months."}, {"review_title": "Deceptive, Shady, Dishonorable Management living in Grand Bubble of Delusion", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "30 Apr 2020", "job_title": "Marketing", "duration": "N/A", "pros": "Practically none. They'll promise you the world during courtship, such as EMPLOYEE STOCK OPTIONs, but keep mum about the grant and value when you are in. Most of us are fooled into this trap this way.", "cons": "They will guilt trip you into doing things you don't like or find unethical. Such as hiring and firing people at will, finding loopholes to exploit in their relationships with employees. They view everyone as disposables, and will retrench you without warning, while spinning blatant lies to survivors.\r\n\r\nIf you don't do as they tell, they'll say you're not living up to company values such as taking ownership. When the management does nothing to prove their worth at all, or take any ownership. They just hide behind their order barks, and expect everything to be handed on a silver plate. Worse, management is not qualified nor capable. They keep clutching at straws trying to find something to please the 3 co-founders.\r\n\r\nAt the management level, there's a lot of toxicity. Politics are rife and people are all looking out for themselves.\r\n\r\nIn year end party and previous company events, management and other senior employees recognised as space explorers and cadets made fools of themselves by taking advantage of each other while drunk. Management spewed vulgarities and asked people to get crazy drunk.\r\n\r\nIrresponsible, downright despicable and nowhere near the basic standard of a properly functioning company.\r\n\r\nDon't taint your CV by being associated with a place like this."}, {"review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "6 Aug 2018", "job_title": "Software QA Engineer in Singapore", "duration": "N/A", "pros": "Successful fast-growing startup. Positive environment.\r\nMost of the problems Circles.Life had before are already solved.\r\n\r\nHiring becomes fair and objective.\r\nNo more overtimes. (At least for my team.)\r\nTransparency in company goals and ways how to achieve them. Possibility to discuss your vision on it directly with founders.\r\n\r\nAlso:\r\nFree company lunch every week.\r\nMonthly team building activities.\r\nNice and clever people around!", "cons": "Difficult to find something bad right now. A lot of changes are made and even more, are coming."}, {"review_title": "Poor team management", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "22 Aug 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great team mates. If not for some of the people here, I might have already left. \r\n\r\nLearning opportunity. Given ample chances to learn and gain new knowledge, which could be a double edge sword.", "cons": "Lousy stakeholders who expect to be babysat and constantly reminded to get their job done. \r\n\r\nLousy team lead whom used to consider the teams’s welfare but recently has given in to management pressure and because just another zombie in the system that follows instructions without considering the impact on the team morale and thoughts. \r\n\r\nLousy higher management that micromanaged every aspect of the job and don’t trust the people they hire. Stingy as well (team achieved all targets on the quarter but no appreciation shown). \r\n\r\nPoor company culture: certain individuals are given too much power and people who want to progress in their career  are afraid to say “no” to unrealistic expectations. In turn, they squeeze their team to produce and claim the credit. \r\n\r\nCompany is full of “talkers”: best at giving instructions but have no clue how the work is carried out. Complained when work is not completed on time but they had no idea how it even works in the first place. \r\n\r\nCompany only likes to “parachute” people into higher positions despite those people having no prior experience. Even getting paid more than current staff whom have been here more than 2 years."}], [{"review_title": "[WARNING: Don't be influenced by the bad reviews]", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "10 Mar 2020", "job_title": "Anonymous Employee in Singapore", "duration": "N/A", "pros": "- Pantry is well stocked with goodies. Not many companies have that.\r\n- Positive work environment\r\n- Office area has a lot of cheap eating places\r\n- I have a good manager, having one is important (you'll see the other reviews here attacking someone which is really unprofessional)\r\n- Flexible work time\r\n- Able to work from home when needed\r\n- Founders are really good", "cons": "- Not a bad company, has potential but with many messy processes\r\n- Start-up vibe\r\n- Office is too industrial and old for a hip company\r\n- Benefits should be more \r\n- A lot of communication issues and a lot of salty employees (they are not satisfied even if you give them a cake, they want the whole bakery instead)\r\n- HR is too small and overloaded with work that they take so much time to complete their tasks"}, {"review_title": "Innovative product - energetic team - demanding environment", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "28 Jun 2017", "job_title": "Anonymous Employee in Singapore", "duration": "N/A", "pros": "- Great vision, awesome product and high growth company \r\n- No office politics, people are nice and also too busy for politics. Colleagues are willing to help out and teach\r\n- People are quite open to different ideas (including founders), open minded is a company value. Doesn't matter your position, as long as your idea is good for the product and customers\r\n- frequent feedback from manager, which is good for learning, although can feel uncomfortable at times\r\n- Free snacks, free lunch once a week, monthly outing (laser tag!)\r\n- strong culture", "cons": "- very fast paced, everyone expects you to response quickly and get stuffs done asap, typical startup\r\n- people are smart and direct, can feel a bit intimidating (but if you are used to it and debate back, they respect you more for it). Not everyone likes it I guess.."}, {"review_title": "Come here to get disrespected and underappreciated", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "26 Feb 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "1. Food\r\n2. Pantry\r\n3. Cleaning attendant is very nice", "cons": "1. They do not respect your weekends, Don't buy in to the startup culture. If they tell you things get tough, they mean they shout at you, call you up and expect you to work for them 24/7 and do not appreciate you\r\n2. They do not think long term, if a strategy does not work in 2 days, it's scrapped\r\n3. Bosses do not care and will not hesitate to fire you\r\n4. Ecosystem department was torn apart, they tell you to take a 20% paycut and \"be your own founder\" yet do not allow ANY of their design team to help you. If you don't want to get that paycut, they tell you to find another department, yet when you go to that department, they tell you there is no headcount. Essentially forcing your hand to resign (pretty sure that is illegal)\r\n5. MASS firing. Please really look at the reviews, most of the positive ones do not seem real and everyone is just tired and stressed because no one knows who will get fired next\r\n6. Share your opinion on the new product, and watch them throw that feedback into the bin because they think they know it all. Execute that plan, then watch them get upset that no one wants the product and be blamed for bad marketing"}, {"review_title": "Great Experience", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "20 Sept 2018", "job_title": "Software Engineer in Singapore", "duration": "N/A", "pros": "- Motivated and friendly colleagues\r\n- Modern technology stack\r\n- Company has great direction and ambition\r\n- Free food", "cons": "Many people are joining the company and we need more office space"}, {"review_title": "Best career decision I've ever made", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "3 May 2019", "job_title": "Anonymous Employee in Singapore", "duration": "N/A", "pros": "Some context - I work with a wide variety of the different departments so my perspective reflects that. \r\n\r\nOverall, working in Circles.Life has been without any hyperbole (and no, this is not planted by the founders), has been one of the most fulfilling and rewarding decisions I've made. \r\n\r\nHaving worked in a big corporate environment before Circles.Life, I really appreciate the speed and the trust that is given to me by everyone in the company. Decisions are made quickly and based on first principles. As a result of this, I feel unshackled and I'm able to make an impact everyday. \r\n\r\nFinally, the founders has shared an epic vision that is definitely ambitious, crazy, and even ridiculous sounding to some. This is what ultimately drives me, having a shot at making this vision a reality, no matter how small.", "cons": "Circles.Life might not be the most competitive in terms of cash compensation, making up for it with more generous stock options.\r\n\r\nThere's a lot of work and if your heart is not in it, proceed with caution.\r\n\r\nThe office toilets could be much better."}, {"review_title": "Really enjoyed my experience so far", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "23 Oct 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "I've been with CL for more than 2 years. Seen a lot of growth and also a lot of changes.\r\n- People are nice and friendly. Senior people is accessible and willing to hear you out, also available for coaching some time\r\n- Great product, solid business model\r\n- Smart colleagues\r\n- There is a sense of satisfaction when you get stuffs done, as things are implemented fast and not a lot of layers of approval like big MNCs\r\n- There are efforts from leadership to solicit feedback from people and implement improvements such as ESOP, shuttle buses to office (could be done faster though)", "cons": "- Processes are always changing as we grow and expand. Up to you whether you like it\r\n- Always receive many requests, deadlines are tight. Need to be firm on setting expectation, and when to say yes/no so you don't over stretch yourselves\r\n- No set career path, as it is a young company, so you need to be proactive about planning your own career"}, {"review_title": "Great place to grow but be ready to always be on your feet!", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "23 Apr 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Freedom to share frank feedback-Have a weekly town hall and monthly Pulse Checks (for anonymous feedback)\r\nIf you are hungry to learn, you'll always feel being pushed to boundaries.\r\nCare to initiate? you will be lauded.\r\nNobody care's about limelight, so nobody cares about office politics.\r\nThey are fair and will always give you a benefit of the doubt. To them, work is important, who has done, yet due credit is always recognised.", "cons": "It's great to behave like a Startup but Sometimes act miser as hell- Christmas Party in a Cafe and ikea pillow cases as game prizes, are you kidding me? Rather Don't do the Party at all!\r\nVery less holidays & Medical benefits vs Singapore avg.\r\nProcrastinate too long on infrastructural decisions and look for cheaper make-shift arrangements to save costs, which sometimes cost duplicated effort. (Temp contracted staff for key rolls)"}, {"review_title": "Operations Associate", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "17 Oct 2018", "job_title": "Operations Associate in Singapore", "duration": "N/A", "pros": "Circles.Life is a start-up company that is growing an an amazing pace.\r\nTherefore, working there is very interesting:\r\n- Various missions and new projects coming every day\r\n- Multicultural environment \r\n- Great career opportunities \r\n- Flexibility in the missions\r\n- Brilliant and motivated people\r\n\r\nFurthermore, the working environment is very comfortable, the management aiming to create a \"Google-style\" office where everyone can find what he likes (free food, play area, small library and many other things!)\r\n\r\nI arrived in Circles.Life as intern in September 2017 and converted to full-time employee six months later. \r\nCircles.Life has grown a lot since then, the future looks even more promising as before!", "cons": "High level of flexibility and dedication is expected. People who prefer a smooth working routine may not like it."}, {"review_title": "Chaotic and not in a good way", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "11 Jun 2020", "job_title": "Software Engineer in Singapore", "duration": "N/A", "pros": "Getting lots of fundings; very viral branding; very competent colleagues; cool workplace perks once in a while; impressive townhall culture and event organization; exciting products for engineers to build", "cons": "Chaotic management; founders' visions are too abstract and hard to understand to the frontline soldiers; irresponsible mass hiring followed by mass firing in all global offices; OKRs conflicting with the essential tasks which are actually vital to the company's business, causing engineers to work selfishly on things that only reflect well on OKRs; although just a small startup, people are already having serious politics going on"}, {"review_title": "Great place to work.. mission driven!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "13 Feb 2018", "job_title": "Anonymous Employee in Singapore", "duration": "N/A", "pros": "Founders trying to solve a big problem. Feels like we are part of a big story..\r\nGood culture...little hierarchy, lots of fun meet ups...\r\nLots to learn... fast moving environment...", "cons": "Can be intense at times... not for everybody...\r\nDon't always have 100% info on big strategic questions.. want to be involved at that level.."}], [{"review_title": "Great work + Great culture", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "30 Jan 2017", "job_title": "Anonymous Employee in Singapore", "duration": "N/A", "pros": "Many reasons to be excited about working here:\r\n\r\nAlways felt work had a bigger purpose. We are the David fighting multiple Goliaths.. so that's always a good feeling..\r\n\r\nWe probably have 15 countries represented here at work.. great mixing of cultures and lots of new experiences to share.. some of us casually hang out after work and its good to have a diverse team you can choose friends from..\r\n\r\nConstant learning.. I am learning everyday about new things in a space I thought I knew everything about. Everyone wants to grow.. not easy and sometimes challenging but why else would you be in a startup?", "cons": "This is not the usual desk job. Chances of snoozing and cruising are usually not there. We hardly work beyond 7-8pm in the office but these are intense hours.."}, {"review_title": "Talk to current engineers to get a real feel!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "8 Mar 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Transparency and communication in company metrics and direction (every Monday townhall)\r\n\r\nChallenging engineering problems to solve (but this depends on the role you get within engineering)\r\n\r\nGood co-workers and healthy culture (only 3-5 people left in a year... for a engineering team of 100  or so)\r\n\r\nGenerous equity/ shares for every single employee", "cons": "Continuous refactoring of code necessary to go with the growth\r\n\r\nCan be crazy at times in terms of work\r\n\r\nOverall, I'm happy but I would talk to existing employees if you can and ask for what team/challenge you will take on. This may not be for you."}, {"review_title": "Highly ambitious yet with some questions to be answered", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "18 May 2019", "job_title": "Anonymous Employee in Singapore", "duration": "N/A", "pros": "Ownership driven company. With the flexibility given to the job scope, you could get more exposure to other tasks. \r\nAmazingly fast-growing company. If you would like to be stretched and have exposure to the company that is expanding quickly to other countries. This is it.\r\nFounders are highly ambitious. \r\nSmart colleagues \r\nFounders are actively working to improve work environments", "cons": "Although they boast themselves to hold monthly team lunch and company event, these are oftentimes skipped due to a hectic work environment. There are not enough cross-team event so you will not know many outside of your team. \r\n\r\nBD team while in the meeting very often times exaggerate our current capabilities, with regards to event discover app, telco back-end, as well as insurance. \r\n\r\nThe company lacks guidance and training opportunities. \r\n\r\nThe company \"encourages\" people to write positive reviews here. I would say please thoroughly read negative comments as well\r\n\r\nMicromanagement issue from the founders level"}, {"review_title": "A good experience marred by some questionable decisions", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "17 Feb 2020", "job_title": "Anonymous Employee in Singapore", "duration": "N/A", "pros": "A young and vibrant culture, where most of the junior people are passionate to learn, and they work hard.\r\nExpect to build friendships here, expect to learn new things about the organization and industry if you open your eyes and ears to listen.\r\nDecent welfare for staff and compensation seems to be at market standards.", "cons": "Politics come from the older and senior ones.\r\nOn previous point, you have to take a proactive approach to learn because people won't tell you much.\r\nRoom for improvement in CSOP/ESOP, compensation promises and staff benefits."}, {"review_title": "fake glassdoor reviews, values & management meh.", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "12 Jun 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "free food, young environment, colleagues are nice and friendly.  creative benefits.", "cons": "only department that is well loved by the management is marketing and the developers. Other departments are being slaved drived and got 2nd rated treatment.\r\n\r\nteams under Rameez are treated very well as he is the only boss with EQ. if you are under Abhi or Adeel, forget it i cant decide which is the worst....\r\n\r\nIf you are not well-liked or your \"pet-period\" is over, you will be banished into the \"cold treatment\", your job scope will be changed to do unimportant stuffs.\r\n\r\nThe management does not trust anyone and likes to test you. everyday in office is like fighting a war and running around like headless chickens.\r\n\r\nBe careful of the reviews you read as quite alot are fake... ever since the bosses knows that the glassdoor reviews hurts their hiring, they persuaded their \"pets\" in the company to write good reviews."}, {"review_title": "Great Fast Paced and Challenging Environment, with potential for growth", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "3 Mar 2020", "job_title": "Anonymous Employee in Singapore", "duration": "N/A", "pros": "Fast paced environment, where you have the possibility to do totally different things on different days. Very fast learning curve, as the org size is still not that big to act like a corporate, so you get to do many different things.\r\nThings get done in days, which used to take weeks in other places.\r\nMost leadership is hands on and mostly available to the teams. Co-founders are still involved in day to day things, thus shortening the time it takes for  decision making.\r\nGood environment with nice cafeteria and some amenities.", "cons": "Incredible roller coaster ride, so be ready to be fully utilised. \r\nLocation, while conveniently close to city centre, is a bit away from local train. \r\nOld building, while inside the office is good, outside is kind of industrial."}, {"review_title": "Good learning experience", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "15 Apr 2019", "job_title": "Anonymous Employee in Singapore", "duration": "N/A", "pros": "- learning opportunity: things here are moving fast so I can learn and expose myself to many things here.\r\n- flexibility: in working hour, casual dress-code, working from home option, etc\r\n- people: supportive colleagues and enriching environment. They are willing to guide me along whenever I need help.\r\n- ownership: this is one of our values and is also my favourite one. Since working here gives me the autonomy to take charge in different exciting project from end to end.", "cons": "As stated above, fast-paced environment may overwhelm me sometimes. So I have learnt to prioritise my tasks and manage my time better."}, {"review_title": "Fast pace growth company where everyone strives to improve", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "5 Apr 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- Very good business strategy, product and growth prospects.\r\n- Founders and leadership taking feedbacks very seriously and making continuous improvements.\r\n- Things move fast", "cons": "- Flux, constant changes, sometimes lack of focus"}, {"review_title": "Really what you make of it.", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "22 Apr 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "On a non-technical team, but I've been here a while and hang out fairly often with people across the company, at different levels of the hierarchy and different departments, so I think I have a fairly good idea of what's going on.\r\n\r\nIn summary. Individual bad-egg managers and typical tech / startup scaling pains really drag down the experience. These are real problems, and they cause real pain for some of us. \r\n\r\nAt the same time, there are still great opportunities and people around, and the company is headed in the right direction - on innovation, profit, and culture.\r\n\r\nIt really is up to you to decide if that's the tradeoff you want to make, balanced against your preferences and needs. It's a bad deal if your expectations, or what you need in your life at this time are different. But this isn't a bad company. Not by a long shot.\r\n\r\n> PROS <\r\n\r\n1. Growth trajectory. \r\nThis company's going places, quickly, with great products and serious resources (both financial as well as talent-wise, on the whole); it's quite likely to succeed in a big way. \r\n\r\nEven over beers with those who left feeling frustrated and mismanaged, on both tech and non-tech teams - they agree that on the whole the company is doing good business, and that this is a good brand to have on your CV.\r\n\r\n2. Opportunity.\r\nCL is growing crazy fast, so it's really like what they say about fast-growing companies and exposure. You can expect to work on international projects affecting millions of users or high level strategy across the organisation globally quite quickly in some cases.\r\n\r\nPlus, this is a really good/critical time to join the company just before it goes full steam on global expansion - so you do get to do important & high profile things much earlier than you would elsewhere.\r\n\r\nAgain, great for your CV and personal growth.\r\n\r\n3. Talent.\r\nBad eggs are a given, and maybe it's true we can do a better job of weeding them out - but by and large, plenty of smart people around on average. Add this to point 2 and it means you really do get the chance to learn lots from doing big things with smart people", "cons": "> CONS < \r\n\r\n1. Work-life balance.\r\nThink the right policies are in place...we have a work from home policy now, and broadly managers are flexible. Ultimately though it boils down to your individual manager, and business needs. Not every manager respects your off-time (nights, weekends) or is understanding to your needs - so, in other words, just like anywhere else.\r\n\r\nWhere it gets really frustrating is when you feel like you're staying back for a poor reason. Which leads to:\r\n\r\n2. Inefficiency.\r\nThe telco tech here is really advanced, which is why it's strange that things are just done...badly sometimes. Like having a lot of different Google Sheets to manage simple things. Horribly documented legacy code. Just bad, dirty data that creates problems for everybody. \r\n\r\nLots of people across every team are concerned more with doing things quickly in the moment, than doing things right in a way that saves time and irritation down the road.\r\n\r\nIt's a total mess sometimes and a serious pain point. If I left, this would be why. Again, a bit of a 'necessary evil'...know for a fact that Grab, honestbee, and more are suffering the exact same problem.\r\n\r\n3. Culture.\r\nValues aren't really lived because we don't properly hire for culture like other places do, we're not confrontational enough to call out bad culture when it happens, and culture initiatives are half-hearted in execution or not targeted in the right way. (example: we have a foosball table. but you'll never see senior leaders using it...)\r\n\r\nCulture is hard to do right and happens from the ground. Some stuff is in progress but right now this is just lacking. What this problem looks like is exactly what others have mentioned: micromanagement, politics, taichi, just a lack of enthusiasm, not speaking out when something's being done wrong, even by senior leaders. (Good counterexample to this is what Facebook has on \"see something, fix something\")\r\n\r\n> OTHERS < \r\n\r\nSeeing lots of comments saying positive reviews are planted. I don't know if this was ever true, but it's quite definitely not true now. I think we'd have done a better job of adding more positive reviews if that was the case; a 3+ rating isn't great.\r\n\r\nOverall, serious problems we need to deal with. There is still a long way to go, but there have been signs for a while that management is pivoting seriously to fix this, especially before we launch in multiple countries.\r\n\r\nStill, it just means you need to decide to work here with your eyes open and a clear mind on what you want and are willing to give up.\r\n\r\nTo put things in perspective, you'll hear the same problems and pluses if you ask anyone working at a tech company at this early stage of development. \r\n\r\nIt's the same tradeoff, and if those who compare Circles right now to cushy jobs in other more 'developed' tech firms (like Grab lol, fun favourite benchmark) isn't being fair. You need to compare Circles now to Grab then, not Grab as it is today: the tradeoff and the value proposition is now very different."}, {"review_title": "How to not enjoy your career", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "12 Apr 2020", "job_title": "Senior Software Engineer in Singapore", "duration": "N/A", "pros": "- Fake camaraderie events, \r\n- Fake town halls, reports\r\n- Fake media releases", "cons": "- You learn to be fake and dishonest, looking almost passionate in your work when your self belief tells you that its actually a poor quality product we are releasing\r\n- The talk is all about inspirational leaders, sacrificial leadership when truth is one of bureaucracy\r\n- You learn you are never enough and you are not worth it, which leads to poor self belief and confidence\r\n- You learn to write fake reviews, provide false promises and releases\r\n- You go to work never happy and never safe which results in an unproductive career span\r\n- There is a library of how to make a workplace great and yet it is one of the worse places to spend time at\r\n- Work by instructions not by trust and inspiration\r\n- Majority are in for the ride not for the journey"}], [{"review_title": "Solid community, good future potential", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "17 Nov 2019", "job_title": "Software Engineer in Singapore", "duration": "N/A", "pros": "-great employee program Space Explorers\r\n-stock options are generous\r\n-free flow snacks and weekly company lunches\r\n-team outings\r\n-insurance and medical benefits", "cons": "-no dental benefits\r\n-not enough leave days\r\n-work from home not flexible\r\n-founders and leaders like to micromanage, not sure if they're aware\r\n-more empowerment needed"}, {"review_title": "Excellent working environment", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "21 Jul 2018", "job_title": "Software Engineer in Singapore", "duration": "N/A", "pros": "Good work life balance. Working time flexible. Colleagues are nice, smart and supportive. Salary for engineer is higher than average.", "cons": "Need to be more diversified"}, {"review_title": "Progressive company but with low employee satisfaction", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "28 Feb 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "1. Free coffee machine\r\n2. Well-stocked pantry\r\n3. Fridge with variety of drinks\r\n4. Dress down work attire\r\n5. Helpful and friendly colleagues", "cons": "1. Poor work life balance with OT and some weekends being burnt.\r\n2. Some leaders are not proficient in their work and are often clueless.\r\n3. Team members may bear the blame of poor decision making by their managers occasionally.\r\n4. High turnover after over-expansion which is due to poor management decisions.\r\n5. Honesty is discouraged as some employees who speak up against flaws are asked to leave.\r\n6. Uncomfortable environment as some leaders are demeaning and use vulgarities excessively.\r\n7. Poor planning resulting in teams being abruptly shut down and employees taking the axe.\r\n8. Unreasonably high targets which lead to unnecessary stress on the teams.\r\n9. Poor internal systems and processes which lead to inefficiency."}, {"review_title": "Dynamic and energetic", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "2 May 2019", "job_title": "Anonymous Employee in Singapore", "duration": "N/A", "pros": "This is an upbeat company with its eye always on the ball. If you yearn for growth, it's a place to find that in spades. There is always something to be done, and with a lot of people willing to help, it's certainly somewhere with opportunities to stretch yourself and thrive.", "cons": "More structure (or at the very least, a discrete chain of processes), and more communication at key junctures would be useful for the company's sustained growth."}, {"review_title": "Fastest growing, most promising startup in Asia", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "8 Feb 2018", "job_title": "Business Development in Bukit Merah Estate,", "duration": "N/A", "pros": "-Truly visionary leadership: the founders really understand the future of the industry and apply their experience in the telco, investment, private equity spheres to ensure that Circles is one step ahead of the market\r\n\r\n-Culture and Values: the company is built upon 3 core values of which the foremost is giving power back to the customers. EVERY product, strategy and decision made in the company can be traced back to this core value. This has cultivated a unique culture where everyone is respectful to eachothers' views and works hard to deliver happiness (internally with colleagues and externally to customers)\r\n\r\n-Alignment in vision: the leadership team (16-17 pax) spends time consistently on making sure that everyone from the co-founders to interns are aligned on a unified vision. \r\n\r\n-Autonomy and ownership: as an employee you take complete ownership of your domain and are given the autonomy to make decisions based on the core values. \r\n\r\n-Focus on innovation: all employees are given a free hand to think and execute innovative ideas / solutions.", "cons": "-This is not a place for everyone; people looking for a free ride will not survive.  If you're looking for gourmet lunches, this is not the place. If you're looking to work hard and learn, you will get that opportunity here. \r\n\r\n-You need a balanced personality between thinker and do-er. You can't just be the idea person or the one waiting for instructions to follow. You have to do it all. Generate ideas, break them down in to action plans, and finally be ready to get your hands dirty and execute!"}, {"review_title": "“Look elsewhere, you deserve better.”", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "16 Nov 2019", "job_title": "Anonymous Employee in Singapore", "duration": "N/A", "pros": "Company has the potential to scale and deliver good business results.\n\nFlexible work arrangements\n\nFree snacks and drinks in pantry\n\nMeal and transportation claims for people who worked late", "cons": "Inexperienced team leads (head of departments) with poor team management skills. Micromanagement is common.\n\nFrequent poor/bad planning causes last minute rush in the team, which leads to poor work quality output. This eventually leads to poor business results, which isn’t a surprise. “If you fail to plan, you plan to fail.”\n\nPlenty of fluff going on with some senior managers. Ask them more in-depth questions about the topic and they stumble."}, {"review_title": "Worst company everrrrr", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "12 Feb 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- free lunch on wednesdays", "cons": "- a company as big as this strongly believes in working for long hours even by writing  bad code just to finish a feature.\r\n- extreme micromanagement due to which the engineers can't focus.\r\n- management come up with random specs and waste engineers' time and confuse them by continuously changing them.\r\n- even with so many people they call themselves small.\r\n- if you believe in working for a company who helps you grow while you do the same for them, this is definitely not a place for you.\r\n- most importantly,  take glassdoor reviews very seriously before deciding to join this company, all positive reviews are fake."}, {"review_title": "Never join this company ( Full of politics and don't care about there employees.)", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "23 Jan 2020", "job_title": "Anonymous Employee in Singapore", "duration": "N/A", "pros": "I would love to write about pros, but ain't got any at the Founders are highly money-minded", "cons": "- You would not increments even if you are an outstanding performer unless you are sycophant and agree to what your director or founder has to say.\r\n- They don't care about employees and there needs. You will always be unheard of if you want to present your ideas.\r\n- The most important thing they are paying salaries way less than the market average. \r\n- The company is very opaque in terms that you wouldn't even get a tiny bit of information about how the company is doing and what's the valuation. \r\n- At last, you can be laid off without notice or this can happen to your colleague and trust me that's very disheartening."}, {"review_title": "Not recommended", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "12 Mar 2020", "job_title": " in Singapore", "duration": "N/A", "pros": "The ideas of the product are good and innovative. Good investors.", "cons": "The founders asked employees to submit good reviews because the rating dropped badly. \n\nThey fired everyone (left only 2 people) in Australia after only 4 months \n\nSome people’s salaries are cut. \n\nThey fired more than half of people in Taiwan after less than 1 year of operations \n\nThey keep on firing the engineering team since last year. \n\nThey make people work 7 days a week, all departments. \n\nThey make everyone work in a crowded room when other companies are requesting their employees to work from home during the corona virus pandemic. Work from home doesn’t exist."}, {"review_title": "Probably the most ambitious start-up in the region", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "27 Aug 2018", "job_title": "Product Engineering", "duration": "N/A", "pros": "I may have joined only a short while ago but I am most impressed by the vision and the spirit of continuous improvement. Every week is a townhall. Engineering now does its own every month. All feedback gathered and transparently shared - whats been worked on and whats in progress. \r\nI was surprised with the vast different between the negative reviews and the reality.", "cons": "Location is still something that people might find challenging\r\nIt can be stressful as it its a live super low tolerance production environment and eventually you get to own a piece of it.\r\nNot rating it 5 as there is room for improvement"}], [{"review_title": "Join only if you have no social life", "rating": "2.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "1 Aug 2019", "job_title": "Software Engineer", "duration": "N/A", "pros": "Free Wednesday lunch. Free team outings. Will be able to learn a lot if you don't mind giving up a lot of your life to work.\r\n\r\nFortunately I have a supportive and good team.", "cons": "1. No work life balance. Do not join any of the back end teams if you do not want to overwork.\r\n2. Most people are just chasing after OKRs blindly and causing many issues down the line. One example: Product Managers are so focused on OKRs that they don't think through products properly, only causing issues in the future. \r\n3. Certain key people are too fixated on rapid expansion and ignoring the well-being of the employees. Many necessary requirements such as extra manpower in the RELEVANT teams are also not met. Too many new people but only very few veterans to train these people. Furthermore, these veterans are always overloaded with work, giving them even less time to guide new engineers.\r\n4. Pretty much most of the truly talented engineers do not stay in the company for long and the obvious issues with the systems definitely contributes to their departure.\r\n5. Quite a number of people across the different engineering teams have hinted that they do not have a positive view on the company future.\r\n6. So many useless meetings. Seems like people like to 'think' and not do the actual work.\r\n7. Have a wonderful Circles.Life time!"}, {"review_title": "If you are looking to challenge yourself and status, this would be an ideal workplace", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "2 Oct 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- You get to initiate projects and take ownership from start to end \r\n- A challenging workplace where you never get bored and have worry about being in a repetitive routine \r\n- Pantry has improved  over the months and now we really dont run out of food anymore (:", "cons": "-Location is a bit off centre, understand the company constraints but will be good if our future location can be more accessible via public transport"}, {"review_title": "Hello", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "10 Oct 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great team, culture, work and office", "cons": "Toilets need to be fixed"}, {"review_title": "Please do not join", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "4 Mar 2020", "job_title": "People Operations", "duration": "N/A", "pros": "Free lunch on Wednesday and snacks", "cons": "Management never trust their employees \r\nLet go people with no reason .Let go very good employees recently indicates that they retain only their favourites and slaves.\r\nExtreme micromanagement\r\nEverything revolves with CTO and cofounder\r\nFake promises to employees\r\nThey keep and promote their favourite people \r\nNo room for improvement and no chance of growth \r\nPulse check on every month but of no use.\r\nRetracting offers with no reason \r\n Full of fake people in the management . Some strong leaders already left because of internal politics \r\nFull of fake gimmicks in Linkedin and in advertisements \r\nOverall very bad company and never advice anyone to join the company"}, {"review_title": "do not loyal to the company if they don't loyal to you", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "5 Mar 2020", "job_title": "Software Engineer in Singapore", "duration": "N/A", "pros": "free  snack, free Wednesday lunch, plenty high tech", "cons": "Plenty high tech but not know how to fully utilise the tools,\r\nA lot of cow-boy on most leadership in Singapore office\r\nExpected to be working OT everyday including weekend\r\nYou will be push to be a founder mentality, but you will be let go easily when they don't need you (due to the cost i think)\r\nExpected your personal mobile whatsapp/slack group will ALWAYS filled with work message\r\nMost of the feedback provided by employee they don't even consider to implement into the workflow which applied across company"}, {"review_title": "\"Nasty, unsympathetic top down culture\"", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "19 Sept 2018", "job_title": "Senior Software Engineer in Singapore", "duration": "N/A", "pros": "Some colleagues are good to work with", "cons": "CEO cares more about money than with employees.\r\n\r\nsend an email to you if you dont come on time\r\n\r\nHigh level of micromanagement\r\n\r\nYou do not work, follow script.\r\n\r\nNo proper planning or roadmap for engineering\r\n\r\nThere is no discussion about improvement, you job is to fix and patch, fix and patch \r\nCodebase is nightmare to work on\r\n\r\nCTO is not familiar with term knowledge transfer, software design, time estimation and just want u to work 24/7\r\n\r\nBlame, insult in front of others or with your mate in team\r\n\r\nGive bad review to founder and founder believes blindly\r\n\r\nHR dont treat emloyees as humans\r\n\r\nJUST STAY AWAY, DONT JOIN"}, {"review_title": "Be a part of revolution in telco", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "28 Dec 2016", "job_title": "Engineer in Singapore", "duration": "N/A", "pros": "- Push your boundaries, learn and grow\r\n- Be part of a consumer offering that is revolutionizing the industry \r\n- Work with and learn from the best talent around", "cons": "It is not a place where you want to take it easy, step back and relax. This is where you challenge yourself."}, {"review_title": "\"Beware\" if you are an engineer", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "27 Sept 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Information about company growth plans  is provided in timely manner.", "cons": "* Total chaos and too much politics. \r\n* No clear roadmap for anything. \r\n* It's not an engineering company, everything is driven my marketing and product. \r\n* Only reason for people staying in this company is the agreements they sign after coming to Singapore which is rental/internet/phone and if you have kinds and get them admitted to some school then only god can save you. Just look at all these agreements online and check for how much time they are applicable you would understand what I am talking about. So, in short people are stuck.\r\n* Don't expect any learning."}, {"review_title": "Circles.Life: Bad culture and management", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "2 Oct 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Free lunches, fridge in pantry and free flow muruku in pantry for you to get more out of life", "cons": "Very bad culture, co-founders very sarcastic and sometimes very demeaning. Nothing promised in interview is true. \"Flat\" structure means cofounders will unilterally veto your decision or override them, even if you are lead on project. Will always pretend to want to improve culture and workplace welfare but after \"open discussion\" nothing changes. No idea of funding and whether start up is able to sustain, which is worrisome for those mid career. When raise salary issue. promised revision doesn't happen. Talk about nice changes but in reality too stingy to pay talent."}, {"review_title": "Best Startup in Singapore", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "27 Jan 2017", "job_title": "Analyst in Singapore", "duration": "N/A", "pros": "- Great culture: focus on learning and respect\r\n- A diverse bunch that is a ball to hangout with\r\n- The company's focus on the customer, trains one to seek product excellence\r\n- Work on latest tools and technologies", "cons": "- Location is not CBD\r\n- Can we have free food everyday vs once a week?"}], [{"review_title": "BEST CEO TRU VISIONARY", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "25 May 2017", "job_title": "Java Developer in Singapore", "duration": "N/A", "pros": "Top notch leadership with furst in class directorship always making postive decisions to increase competition", "cons": "No cons!!! Believe me really one of the best company to work for in my life superb benefits and welfare we can take MC pay $5 only and mcuh free food"}, {"review_title": "Company with good potential but unrealistic timelines , rushing and stress", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "-You have freedom in design and implementing solutions \n-Good , experienced coworkers", "cons": "-The higher ups set very unrealistic timelines and ask developers to rush stuff . This leads to ad hoc solutions that are bad ,  without having enough time to design properly/follow good practices \n\n-Too much stress as they force you to work after office hours and on weekends . Work life balance will be completely gone .\n\n-You can't complain about these because why ? Politics"}, {"review_title": "All positive reviews are fake", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "13 Mar 2020", "job_title": "Employer Branding", "duration": "N/A", "pros": "Good learning environment. But this also means no hand holding. If you make a mistake, you're on your own.", "cons": "Poor management decision making. Their caliber has maxed out at managing less than 100 people. Once the company grew past that, founders find it difficult to manage the people. \r\n\r\nCompany hires people whilst disregarding the person's family needs. Currently retrenching people but current staff are told to hush and not tell potential candidates. At the same time still selling the attraction of \"hyper growth\" (excuse me, you just let go of 200 people) and exciting new-age tech (but the CTO can't even code)."}, {"review_title": "Good place to learn", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "5 Apr 2020", "job_title": "Prefer Not to Disclose in Singapore", "duration": "N/A", "pros": "The company is diverse\r\nCompany has grand plans to grow\r\nYou have access to the management\r\nYou get to work on important projects \r\nStartup mindset", "cons": "It's a corporate with a startup mindset to grow as fast as possible and launch in new markets. This means that certain things might not go according to the plan. Things can constantly change. This company is definitely not for people who are looking for a chill corporate environment."}, {"review_title": "Hotest Startup in APAC", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "21 Feb 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- work on amazing products\r\n- you get ownership to do stuff\r\n- platform is more complex than most tech products so excellent learning environment\r\n- great feeling when customers appreciate the product", "cons": "- product cycle can be fast at times\r\n- location is not CBD"}, {"review_title": "People are just dispensable resources", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "19 Apr 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Product is decent; above-average even. A tiny percentage of leadership are made up of really brilliant folks. Perks are abundant at Circles.Life, food, snacks, drinks, coffee.", "cons": "A very unforward-thinking organization.\r\n1) Clear over-hiring practices during scaling for an asset-light company, and then performed several retrenchment/firing exercises (only join if you're looking to use them as a stepping stone).\r\n2) Claim to be fast-paced, but sets yearly OKRs, which are not realistic due to the nature of the industry and competition, etc. Even though they tried adapting the quarterly OKR model, no clear methodology was used to deploy the new process.\r\n3) Had more than a year to develop the \"ecosystem\" that they've always touted to investors, but chose not to. The evidence of this was the demolition of the ideathon practice where they encouraged employees to contribute new ideas for new relevant products or verticals.\r\n\r\nKey unresolved issues within the top management.\r\nA) The '3-cofounder' model is clearly a tactic to absolve themselves from mistakes and responsibility. They refuse to nominate 1 CEO. Each co-founder supposedly has a clear portfolio to manage, but in reality, they overlap, thus small issues can take months to resolve due to disagreement among themselves. If you're looking for a company with strong leadership, give this one a pass.\r\nB) They are clearly inexperienced handling a company of this size and stage. Even the CTO seems to be better equipped in handling the direction of the company. Hold on, why is there a CTO if there are no C-suites?\r\n\r\nDishonesty is the core of this company.\r\ni) For all the talk about bonuses and stock options, they never kept their promises. Terms in the contract are intentionally made vague (it's technically legal, so there's no case to bring to court). If you've been offered a role, please question the HR hard because you can be sure they can't give specifics.\r\nii) Their transparency is a farce as important communications to employees keep dwindling. They also don't address legitimate issues that have been raised in meetings and townhalls. The values and mission they keep selling are never seen in the 3 co-founders, so don't expect anyone else to exhibit them!\r\niii) You'll be surprised to find out that there's no fixed date for payroll as well. Your salary can just \"drop\" any time near the end of the month. You must love guessing games and anticipation to join this organization."}, {"review_title": "Considering? DON'T. You have been warned.", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "22 May 2020", "job_title": "Software Engineer", "duration": "N/A", "pros": "Stocked pantry with snacks, coffee machine and tea. Amazing company LinkedIn profile that makes Circles look glorious on the outside. \r\nTelco bill reimbursement, group medical insurance.", "cons": "Too many to list down. but here are a few. Things started going downhill since last year. Glassdoor rating was as high as 3.7 just a year ago, but now a pathetic 2.4 and this is NOT for no reason. \r\n\r\n- Multiple “restructurings” happened and people got laid off since last October. Used to joke that Thanos appeared in Circles because every few weeks there were layoffs, but it has since evolved into a fear culture that these jokes aren’t even funny anymore. We were tricked into believing every single lay-off was “the last one” in the company’s exact words. And then it happened, and happened, and happened again and again.\r\n\r\n- High turnover rate. Most good people are leaving the company because of the turn of events that have happened. Many are looking for an exit. Ask around, even recruiters from other companies know about it, we were told during interviews with other companies.\r\n\r\n- Don’t trust anything the recruiters tell you if it is not written in your offer letter. Don’t be naive. Make sure everything is in the OFFER LETTER that you sign and not only in the email, or worse still if it’s just verbally told to you. When questioned why salary adjustment was promised by recruiters but not granted, the company’s response was “we did not commit to that if you check your offer letter”.  Wow, amazing. You won the legal game. \r\nMany people even for those who have worked for >1 year did not enjoy any salary adjustments last year, and for those who got it, it was way lower than market rate. Do you want your pay to be stuck at the same range even after working for a few years? Think twice because when you move on to other jobs, companies will base their offer on your current pay, which means you are kinda stuck. \r\n\r\n- Management here abuses the word “ownership”. Taking ownership means you are expected to firefight, churn and deliver within tight timelines and most of the time losing your work-life balance. The CEO said firefighting is in our company spirits. What? \r\n\r\n- Process changes all the time without elaborate planning and systematic execution. You are told to follow this process today, two-three weeks later they would change their mind and tell you to follow another process, and the cycle keeps repeating. You will find yourself being caught up with processes instead of focusing on learning and developing your skills in the company. \r\n\r\n- Insanely KPI-driven. If setting exceptional goals to appease your boss and working overtime to meet KPIs is how you enjoy working, welcome to Circus. Oops I meant circles. \r\n\r\nTo people who are considering to take up job offers from Circles, if you do not want to constantly worry about job security, fearing that you will be fired anytime after seeing your colleagues being let go one after another, being stuck in an infinite loop of working like a robot to deliver within tight timelines but learning nothing, no pay increment, DON’T JOIN. You have been warned. \r\n\r\nFresh grads especially, please look elsewhere. You deserve better. Don’t be tricked by the glorious social presence of the company. Always try to speak to engineers (engineers on the ground, not managers, not recruiters) in the company first before joining one, and for circles specifically, you will understand why there are so many negative reviews on Glassdoor."}, {"review_title": "Wouldn't recommend this as a place to work", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "30 Apr 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "This is no doubt a very ambitious company. They truly focus on- and deliver what customers need. Management is also very performance-focused, but maybe too much (more on that later), there are some very smart and hardworking people in the company.\r\n\r\nUnfortunately, my experience working here had more cons than it did pros.", "cons": "Lacking transparency - They claim to have transparency in the form of sharing business results/performance goals/roadmaps, but many important business decisions are still made behind closed doors. You hear of/see new \"business partners/consultants etc\" joining the current team with no proper introductions made, and Management only addresses these when people start asking questions/express unhappiness. Reactive, not proactive. \r\n\r\nFeedback - Don't know if they still do it now but the co-Founders held \"open door sessions\" and encouraged employees to come in and give honest feedback. Pure lip service. They listen to reply, not to understand; most of the time are very defensive, making excuses, and not committing to change things at all. This behaviour was also present in the HR leadership then.\r\n\r\nPoor management culture - You'll see many other reviews here talking about their miserable management culture. (Applies to majority of Managers, not all) Extremely focused on results, yet they don't celebrate how we get there. Minimal appreciation for team members; once you reach your goal/target, another is put in front of you for immediate action. This is not wrong at all, but without proper and SINCERE appreciation shown, it's bad for employee motivation. Micromanagement is experienced by MANY teams, which trickles from the co-founders themselves. They also seem to think monetary rewards = employee motivation, which brings me to my next point..\r\n\r\nInadequate HR leaders - The leader(s) in the HR team (or as they call it internally : \"People & Culture\") need to seriously rethink their understanding of employee motivation and building a positive workplace culture. High level of unhappiness and turnover, overall workplace culture is not ideal, some senior employees bully the junior folks, yet HR doesn't do anything when these are reported. Also, I can say for a fact that most of the positive reviews here are indeed \"planted\", and were arranged by HR themselves. There are people hired into the company because of connections with Founders, without any formal selection process, and HR just goes ahead with no (or minimal) objections. I do wanna point out that this team has grown considerably large and pulled in a few new talents in lead positions. Hopefully this is for the better...\r\n\r\nAs mentioned by a few others here, this place has a disproportionate focus on growth/profit, over employees. Understandable in a high-growth startup, but that doesn't mean you ignore employee morale and feedback. Turnover is not an issue to management, they have the mindset that people are very easily replaceable. \r\n\r\nI mentioned before that this is an ambitious company, but it borders a lot of times on being arrogant/obnoxious. Management consistently boasts about how the company is \"more than a telco\", and puts themselves in the ranks of Grab, Gojek (in terms of their success in Indonesia) but honestly they haven't really developed that much as anything more than just a telco. And with this same arrogance, they assume people are dying to join the company, but at the same time not offering competitive packages at all. Office location is also simply not attractive, but again, Management sees this as a non-issue in attracting talent. They really need a serious reality check. (If you've seen their latest Marketing stunt on the papers in Apr 2019, dissing their competitors in such an unprofessional way, you'll know exactly what I mean when I say they're obnoxious)\r\n\r\nOverall, from a consumer POV, Circles.Life is a top contender. But it's not a good place to work.....unless you don't mind being worked like a slave, under Managers who just see you as a money-making mule, ready to replace you at any time."}, {"review_title": "5 stars company? You have to be kidding me.", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "6 Jun 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- Free snacks at pantry\r\n- Great people (ruined by founder's extreme micro management)", "cons": "- 2 of the founder (with As in their name)  need to work on hands free, trusting others, listen to feedbacks & not micromanaging, assuming that people cannot function without their complete control\r\n- Sweat shop. Extreme long hour\r\n- Try to squeeze every penny's worth of your time and effort. \r\n- Very high attribution."}, {"review_title": "Its a roller coaster.", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "29 Oct 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Cooperating colleague \r\nManagement is always open to try new things for sake of good.", "cons": "You might get effected with politics and deal with people who try to manipulate you."}], [{"review_title": "Probably one of the best startups in SG both in terms of non toxic culture and growth opportunities", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Awesome leaders who are not afraid to get their hands dirty\nCulture is mostly positive with supportive colleagues \nHigh growth company opportunity to be in the xxx employees", "cons": "Strong bias for action can be taxing at times"}, {"review_title": "Do Not Join", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "25 Jan 2020", "job_title": "Software Development Engineer in Singapore", "duration": "N/A", "pros": "There are no pros to tell.", "cons": "1: Too much micromanage\r\n2: Non-Telco: No vision and relentless rush to copy other products without considering market needs.\r\n3: No employee benefits, Engineering treated as fourth class labor.\r\n4: Get to hear sudden news that people getting fired, without any reason.\r\n5: Hiring team may try to trick you with the prospects of company but the salary is below the Market norm in Singapore."}, {"review_title": "Manipulative and greedy bosses", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "1 Jun 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "free lunch on wed and free coffee frm coffee machine always try to force culture so a lot awkward situation.", "cons": "Management very egoistic, won't listen to suggestion because they think they know better and then become very demanding. Pay is low and they promise revision but never revise. pretend to be your friend but always makes moves against you and micromange you. Keep pressure you to work harder and harder and never pay attention to morale"}, {"review_title": "Worst Place to Work", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "13 Jan 2020", "job_title": "Marketing", "duration": "N/A", "pros": "No pros at all", "cons": "-Unwritten culture of having to be available round-the-clock\r\n-Issue with the existing marketing leadership team \r\n-Unrealistic OKRs \r\n-High turnover rate \r\n-Horrible compensation\r\n-Only care about acquisition"}, {"review_title": "So far the best company I have worked for.", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "4 Feb 2020", "job_title": "Staff Software Engineer in Singapore", "duration": "N/A", "pros": "Best place to work \r\nHumble co founders \r\nGreat HR \r\nKeep on growing \r\nKeep on Learning \r\nGreat emphasis on maintaining a humble office culture", "cons": "Office space is a little cramped."}, {"review_title": "World worst place for work and a company without captain.", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "14 Mar 2020", "job_title": "Principal Engineer in Singapore", "duration": "N/A", "pros": "Annual leave, Medical leave,Relocation bonus", "cons": "They don't know how to run company. They know only  how to hire the people and how good bye the people."}, {"review_title": "World's most valuable company", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "11 Nov 2019", "job_title": "Product in Singapore", "duration": "N/A", "pros": "Founders have big vision of growing the company. New changes taking place, people are happy at the change.", "cons": "Townhalls, pulse checks too many times, with no action plan"}, {"review_title": "Senior Recruiter - Singapore Office", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "23 Oct 2019", "job_title": "Anonymous Employee in Singapore", "duration": "N/A", "pros": "If you are offered a role in Circles.Life as a Recruiter, please take the reviews serious - all positive comments are fake.\r\n- Messy process\r\n- The team is just talking only, does not deliver results\r\n- Political environment\r\n- Terrible place", "cons": "- Founders are liars\r\n- Keep pushing and asking for KPI reports\r\n- Need to send your HRBP/HR to training"}, {"review_title": "Worst company ever", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "18 Apr 2019", "job_title": "Senior Software Engineer", "duration": "N/A", "pros": "Food in the pantry\r\nNothing else", "cons": "Mid-level & high-level managers lacks of management skills and VERY micro management.\r\nYour position is software engineer but your actual jobs are operation and bug fixing.\r\nKeep asking to release new things on top of terrible code bases and you have to dig into those horrible spaghetti codes.\r\nSeniors make bugs and force new hires to fix them, beg seniors to get help resolving bugs which made by seniors.\r\nNever care about new members."}, {"review_title": "Bad Enviroment - avoid at all cost", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Flexi-hours up to superior approval, snacks in pantry, very casual dress code", "cons": "Management temperamental, rude, overriding mid-lvl decisions and impose theirs, most direction  controlled so employee just execute, pay is low across the board and no bonus, little support for difficult task and expectation always too high, deadlines unreasonable."}], [{"review_title": "Difficult place to work", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Nice colleagues\nFree Snacks in the pantry.\nOne of the co-founder is intelligent & impressive", "cons": "- bad on-boarding experience\n- make you work for 11-12  hours daily & Still   complain\n- no training provided what so ever\n- level of micro-management is extreme & unbelievable\n- bad location"}, {"review_title": "You might not even get your bonus", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "2 Mar 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- Young driven people\r\n- Brand name", "cons": "- Some employees did not get their bonus. They were let go recently and even though they were within the eligible period they were told that bonus is given at the discretion of the company. \r\n- Direction changes every quarter and can be a 180\r\n- launch products/benefits and cover-up later with ambiguous speech\r\n- Inexperienced middle management"}, {"review_title": "avoid circles.life at any cost", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "29 Sept 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "casual dress code, weekly wednesday lunches, colleagues are decent (*some)", "cons": "Arrogant & disrespectful co-founders, low salaries, over promises during hiring but never honor it, all decisions are overwritten regardless of the employee's position in the company, office space too cramped as the co-founders refuse to spend for renovation."}, {"review_title": "Software Engineering", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "14 Oct 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Get to learn new technology and how the company is run", "cons": "Engineering culture is very toxic. People tends to keep their knowledge in their head and not document it down."}, {"review_title": "It’s just OK", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "21 Oct 2019", "job_title": "Marketing", "duration": "N/A", "pros": "Learn a lot, failure is acceptable", "cons": "No structure, big company acting like startup, micromanaging problem, many leaders don’t walk the talk"}, {"review_title": "Great CEO", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "18 May 2017", "job_title": "Developer in Singapore", "duration": "N/A", "pros": "free food and gathering and very good CEO", "cons": "location out of nowhere, difficult to find food"}, {"review_title": "Ambitious company with ambitious engineering team", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "27 Oct 2019", "job_title": "Software Engineer in Singapore", "duration": "N/A", "pros": "Wednesday lunch\nTeam activity each month", "cons": "Office is not good\nEverything in the office is low cost"}, {"review_title": "Worst place to work", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "2 Mar 2018", "job_title": "Technical Lead in Singapore", "duration": "N/A", "pros": "I do not think so, if there is any benefit for the employee", "cons": "Work like a dog, no work life balance, come office at 10 an leave office 11 pm"}, {"review_title": "Part time Circles Staff", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "23 Apr 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Office Culture is really great.", "cons": "long office working hours, sometimes till midnight."}, {"review_title": "Back to school??", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "25 Oct 2019", "job_title": "Anonymous Employee in Singapore", "duration": "N/A", "pros": "Flexibility\r\nInteresting business concept with potential", "cons": "Lack of leadership and poor decision making capabilities while trying to scale quickly"}], [{"review_title": "Happiness Operations Specialist", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "1 Jul 2019", "job_title": "Anonymous Employee in Singapore", "duration": "N/A", "pros": "you get paid for it.", "cons": "Insulting and demeaning ,  expect everything but does nothing to protect their employees."}, {"review_title": "negative", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "2 Mar 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "other than free lunches, nothing much", "cons": "culture is bad. they care more about people who can talk than silent workers who are really good at doing what they hired for."}, {"review_title": "Ok", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Flexible working environment for entry level graduates", "cons": "No career progression in the long run"}, {"review_title": "Unprofessional HRs", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "13 Dec 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "A promising tech start-up in Singapore", "cons": "The HRs are all unprofessional to work with."}, {"review_title": "Not a perfect company, but is a work in progress.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "21 Feb 2023", "job_title": "Manager in Manila, Manila", "duration": "N/A", "pros": "This is the first company I worked for where leaders truly listen to its people. Process and benefit improvement is also taken seriously and given priority to be reviewed, assessed and considered. Of course it helps that the People & Culture Teams consists of equally talented individuals who are excellent in their field thus equate for easier collaboration and communication.", "cons": "Fast phased even for a start-up company. If you are not used to quarterly targets on top of BAUs and if you are not ready to challenge the telco industry then you will find the phase too fast. However, if you are ready to challenge industry standards and prepare to really work hard for it, then this is the company for you. Likewise, since the company is also a start-up, please do not expect process and other organizational practices that might be present in a well established organization to be available in the Company, but as shared, it is a work in progress. The good thing is the company is willing to work on it."}, {"review_title": "\"Exciting Startup Culture with Niche Product and Hypergrowth Potential - A Great Place to Work!\"", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "22 Feb 2023", "job_title": "Director of Engineering in Bangalore", "duration": "N/A", "pros": "\"I've been working with Circles for a few months now, and I have to say it's been an amazing experience. The culture is great - everyone is passionate about the product we're building, and there's a real sense of camaraderie among the team. We're all working together to create something truly unique and innovative, and it's exciting to see how much progress we're making every day. The product itself is niche, which means that we have a lot of room to innovate and make a real impact in the Telco space. I love that we're not just another company trying to do the same thing as everyone else - we're really carving out our own space and creating something that nobody else has done before. One of the best things about working with circles.life is the potential for hypergrowth and I truly believe that we have the potential to become a major player in our industry. It's incredibly motivating to be a part of something with that kind of potential, and I feel like I'm learning so much every day. Overall, I would highly recommend this company to anyone who is looking for a fast-paced, exciting startup culture with a unique and innovative product. If you're someone who thrives in that kind of environment, you'll love it here!\"", "cons": "\"I've been working for this startup for a while now, and while I love the company's mission and the work-life balance that they offer, there are a few potential downsides to keep in mind. Firstly, the company is in hyper growth mode, which means that there are a lot of demands on our time and resources. This can be stressful and overwhelming at times, and it's important to be prepared for the fast pace and high pressure that comes with working for a startup. Secondly, the requirements for this job can be quite high. We're working on a product that's first of its kind, and that means that we're constantly pushing the boundaries and striving to be the best. While this can be exciting, it can also be challenging and requires a lot of hard work and dedication. Despite these potential cons, I truly believe in the company's mission and am proud to be a part of a team that's making a real difference. The work-life balance is also great, which is rare in a startup environment, and it's been wonderful to have that balance and flexibility. Overall, I would recommend this company to anyone who is prepared for the demands of a startup in hypergrowth mode, and who is passionate about the company's mission and the product that we're building. It's been an amazing experience so far, and I'm excited to see where the company goes from here.\""}, {"review_title": "Good culture", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "3 Mar 2023", "job_title": "Senior Operations Associate in Jakarta", "duration": "N/A", "pros": "Supportive coworker Pressure not high", "cons": "Job desc might not clear"}, {"review_title": "Great place to work and grow", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "26 Jan 2023", "job_title": "Senior Recruiter in Manila, Manila", "duration": "N/A", "pros": "Looks our for their employee - Been in a WFH setup ever since the pandemic happened. No one is forcing us to go back to the office even though we have plans on getting an office again. Growth and trust - Hired as a Tech Recruiter but entrusted me to take ownership of a different business. I am now owning all Operations/CH Department hiring and also all PH-based roles hiring. - I have received a salary increment every cycle. This happens twice a year.", "cons": "Still in that \"start-up\" environment where there will be major and minor changes in your goals."}, {"review_title": "Used to be a good one, but declined so badly", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "26 Feb 2023", "job_title": "Operations", "duration": "N/A", "pros": "people you work with that became friends", "cons": "no growth full of promises lip service"}, {"review_title": "Kind of average", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "23 Jan 2023", "job_title": "Senior Software Engineer in Colombo, Western", "duration": "N/A", "pros": "No one is checking whether you have worked 8hrs a day. Flexi hours Company only focus only on deliveries, they give freedom for the teams on how to manage the deliveries.", "cons": "Company direction is not clear. Keep changing the company hierarchy every year which will hinders one's career growth."}], [{"review_title": "Overall great learning experience", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "3 Feb 2023", "job_title": "Devops Engineer in Chennai", "duration": "N/A", "pros": "There's an opportunity to learn a lot of things. There are many employee benefits.", "cons": "The organisation is still getting restructured constantly but that comes at the cost of growth."}, {"review_title": "Review", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "5 Jan 2023", "job_title": "Software Developer", "duration": "N/A", "pros": "good project to learn but management is not good", "cons": "1. No worklife balance , have to login early morning 2. will give tasks at the end of the day and ask to completed by tomorrow which disturb personal life 3. short time lines 4. continue followups and irritating questions 5. no respect for employees 6. lots of micromanagements"}, {"review_title": "Good Company", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "25 Jan 2023", "job_title": "Senior Manager", "duration": "N/A", "pros": "The best in rewards and benefits", "cons": "Multiple roles to fill and extension of work when home"}, {"review_title": "Highly stressful work environment", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "3 Dec 2022", "job_title": "Senior Software Engineer in Colombo, Western", "duration": "N/A", "pros": "Always give a good package Can get the share as money without waiting log time", "cons": "You have to always work in the weekend, poyadays You have to always work more than 12 hours a day with different teams (india, usa) When you work hard, management will try to get get more from you. They will ignore the people who don't work You cannot discuss anything there. You need to obey the instruction given"}, {"review_title": "Great office with Awesome team", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "13 Dec 2022", "job_title": "Software Engineer II (Ios Developer) in Colombo, Western", "duration": "N/A", "pros": "- Using latest technology - Listening to employees - Super friendly team - Motivational Managers and Team Lead - Learning opportunity - Smooth onboarding - Good salary package and perks", "cons": "- Requesting access and wait for ages to get it approved - Lots of meetings"}, {"review_title": "Probation Review", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "5 Jan 2023", "job_title": "Softear Engineer in Colombo, Western", "duration": "N/A", "pros": "The manager and the team are very supportive they helps a lot", "cons": "There are no any cons in my side"}, {"review_title": "Life at circles.life", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "4 Dec 2022", "job_title": "Devops Engineer in Hyderābād", "duration": "N/A", "pros": "The work life balance is very good! they value and recognise the work we do and our contributions as and individual and as a team! Encourage on learning and self grooming in technologies!", "cons": "The press of being in office differs at time than working from remote!"}, {"review_title": "Great place to Learn, Work culture", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "5 Dec 2022", "job_title": "Anonymous Employee in Hyderābād", "duration": "N/A", "pros": "1. Ownership and autonomy of projects, Career progression, Strong recognition is given to high performers 2. Opportunity to learn tremendously 3. Growing company with many areas to add value in 4. Good culture from P&C Team", "cons": "Nothing for as of now"}, {"review_title": "Great place and flexible work culture", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "5 Dec 2022", "job_title": "SRE/Python Engineer in Hyderābād", "duration": "N/A", "pros": "- Great place to learn and grow (bosses encourage you to carve your own career path) - There is work life balance", "cons": "No cons till now to mention"}, {"review_title": "Good org and vision", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "7 Dec 2022", "job_title": "Marketing", "duration": "N/A", "pros": "Good team and easy to work with", "cons": "Moves too fast and doesn’t reflect on learnings"}], [{"review_title": "Don't do it", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "10 Mar 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "You feel empowered, at least in the beginning. Because they make you feel like you have a say, that your feedback matters, etc etc etc etc etc etc etc etc.\r\n\r\n....then one day too soon, things just go *cray*", "cons": "If you want everyone to have a say on your work to the point that you lose your own say for the sake of being \"collaborative,\" then this is the place for you. \r\n\r\nDon't be fooled by their \"bold/fearless/daring\" \"persona\" as well. Because here, safe is the bible. Safe is what works. Safe is what excites them. Risk-takers, adventurers, free-spirited souls, run. \r\n\r\nAlso, feedback? What is that? Words with no action? Ah yes, that exactly.\r\n\r\nOh don't even dare mention that you think/feel/hate that start-up culture is so messy and that are changes you wish/fervently hope/trying to implement because all you'll get is -- well, yeah start-up is, indeed, messy. It's either it's for you or it isn't. In other words: we're not changing, sorry. We love being messy.\r\n\r\nAnyway, is six years still considered a start-up?\r\n\r\nTL;DR: Not for people who value their sanity."}, {"review_title": "If you are looking for opportunities !", "rating": "3.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "9 Nov 2022", "job_title": "Project Manager", "duration": "N/A", "pros": "there are a lot of opportunities if you like to grow up fast and expand your ability. this place is right one.", "cons": "there are a lot of typical type of start up issues. like no structure. no planning well. etc.."}, {"review_title": "Service Operations", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "22 Nov 2022", "job_title": "Assistant Manager in Islamabad, Islamabad", "duration": "N/A", "pros": "Every day is a new day here for learning", "cons": "The expectation level is high"}, {"review_title": "Go Circles.Life!", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "25 Oct 2022", "job_title": "Manager", "duration": "N/A", "pros": "Great teammates! Kind, patient and always willing to help.", "cons": "Working remote can sometimes be sad without the physical presence of officemates, makes it more challenging to establish relationships with larger group Work demands can be overwhelming"}, {"review_title": "Enthusiastic customer service representative with a focus in retail", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "11 Aug 2022", "job_title": "Customer Service Representative in Dasmariñas, Province of Cavite", "duration": "N/A", "pros": "Working in Circles.Life gives you many professional opportunities. For starters, you will have access to a larger network, which can pay dividends down the line.", "cons": "In Circles.Life, you should have a job description. But, the odds are pretty good that you don’t have much else. Small companies don’t usually have a list of accomplishments you have to achieve before you get a promotion or even a raise. This means you may not have a clear road map of how you can advance your career or even what the next step at the company is for you."}, {"review_title": "Great place to learn", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "19 Jul 2022", "job_title": "Growth Marketing Associate in Jakarta", "duration": "N/A", "pros": "You'll learn a lot since 1 people typically managing 1-3 type of work roles (typical start up working environment). But the good side is the company also listens to your feedback and probably you'll get a raise (but more likely to happen if you asked for it).", "cons": "Since the company structure is quite flat, it's kinda hard to get an internal promotions. There is no clear career development path, at least in my department."}, {"review_title": "I said YES to steep learning environment", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "10 Apr 2022", "job_title": "Marketing", "duration": "N/A", "pros": "- Very refreshing environment, steep learning curve, and a great way to relaunch your career, for those who are considering to switch to tech/digital/start-up environment\r\n- Empowerment is strong in the culture, where there is freedom to explore passion points.\r\n- Overall team is very passionate & high energy. It keeps you eager and energized too. Team in general is on the younger side, but the amount of young talents is astonishing! It’s always a humbling experience to learn from all around, regardless of their age or years of experience.", "cons": "Wouldn’t really call this a con, it depends on your personality. Need to be independent to drive actionability forward. Guidance is limited, but what this means is you have a lot of say in how you want to drive your work."}, {"review_title": "Operations", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "21 Jul 2022", "job_title": "Country Operations Lead", "duration": "N/A", "pros": "-Recognition and reward is real!\r\n-CSOP program is the best.\r\n-Regular update of current business by Top management to all of employees thru wide Townhall\r\n-Hybrid mode of WFH and WFO.", "cons": "Dental insurance need to add for other benefits of insurance."}, {"review_title": "A good place to earn and grow", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "6 Jun 2022", "job_title": "Senior Graphic Designer in Jakarta", "duration": "N/A", "pros": "- Best team, colleagues, and managers!\r\n- Great salary\r\n- Good benefit\r\n- A hybrid working system that lets you work from the office and home.\r\n- A lot of opportunities to grow\r\n- Almost no hierarchy on the org chart that makes all voices matter\r\n- Your hard work is recognized", "cons": "- No yearly incremental salary\r\n- Sometimes the work pace seems too rushed that which reduces the work quality"}, {"review_title": "Great place to learn", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "16 Aug 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Leadership team is transparent\nAggressive with our company's growth\nESOP is one of the best in the region", "cons": "A lot of changes ever since I joined the company\nNo clear OKRs when I joined but they're trying to fix that now"}], [{"review_title": "Good to Grow but, Easy to Burnout and Get Depressed", "rating": "3.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "3 Apr 2022", "job_title": "Anonymous Employee in Colombo, Western", "duration": "N/A", "pros": "Amazing Manager and Team,\r\nGreat Helpful Work Culture,\r\nWide, New and Growing Tech Stack,\r\nFlexible Hours (Doesn't really matter if you are on-call: more on that in cons)", "cons": "- Low salaries from a reputed, high standard company compared to other high standard companies in the industry,\r\n- Certain policies of the company will make you stuck at certain tasks you are doing, without being able to proceed ahead, making all your efforts go in vain.\r\n- Takes a long time for the management to come to a decision (even if it is related to immediate HR problems.)\r\n- Very hectic on-call schedule - Consistent alerts will sometimes make you go crazy. Absolute impact on your mental health. Worst part is, there is zero compensation as a on-call benefit, which makes it even more depressing.\r\n- Worst part of company culture is that it is okay for anyone to call you and disturb you at any time (weekends, holidays nothing matters) and get their work done and some people don't even realize that they are disturbing someone's only free time and are not even grateful for the person being available.\r\n- At a time most companies are moving towards the use of MacOS due to the performance, efficiency and the ease of developers, Circles.Life an \"innovative, hyper growing company\", stopped giving out Macbooks (at least to the people outside of Singapore) and moved to some low performing notebook machines which can't handle a heavy load, which is absolutely necessary when you are working with multiple projects."}, {"review_title": "Proud Circles Lifer Here", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "10 Apr 2022", "job_title": "Customer Happiness Supervisor in Manila, Manila", "duration": "N/A", "pros": "Great Culture, Yearly Bonus, CSOP (Stocks), Great opportunity for advancement, The company looks after their employees, Very employee centered company.", "cons": "It would make us happier if we have supplementary beneficiaries for our health cards even just one."}, {"review_title": "Decent company", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "22 Jun 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- Great colleagues who are always willing to help \r\n- Feel that most managers genuinely care about wellbeing and developing employees\r\n- If you want to do something more/different, high chance you will get the chance to do it", "cons": "- Toilets can be alot better \r\n- Sometimes feel that employee feedback can be listened to more"}, {"review_title": "Circles.Life as a great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "12 Aug 2022", "job_title": "People Services Associate in Manila, Manila", "duration": "N/A", "pros": "This is my first place to work where Leaders appreciate and value my hard work.", "cons": "Not yet permanent WFH :)"}, {"review_title": "nice", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "27 Aug 2022", "job_title": "GL Accountant in Makati, Rizal", "duration": "N/A", "pros": "Salary is higher than in any market", "cons": "less training more mistakes u make"}, {"review_title": "Great vision - but with some downsides", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "11 Jan 2022", "job_title": "Software Engineer in Colombo, Western", "duration": "N/A", "pros": "- You can learn so many things if you have the correct attitude, however people will not respect your personal time with this attitude.\n-  You can directly do a constructive criticism even to the top managers \n- New technologies\n- They are open for discussions\n- Hetti has a great vision and he is one of the best talents that I have ever seen, however he lacks some of the leadership qualities such as empathy and agreeableness", "cons": "- Some engineers are burned out to the max because of the on call schedule\n- Salary is low\n- Good people are leaving some because of the workload and some because of the attitudes of the management"}, {"review_title": "Excellent Company", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "16 Aug 2022", "job_title": "Ap Accountant in Candelaria, Province of Quezon", "duration": "N/A", "pros": "Good Salary and Excellent Benefits\r\nKind and hardworking Co-workers\r\nGood Management", "cons": "Communication at work\r\nNo more\r\nNo more"}, {"review_title": "Good culture", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "14 Aug 2022", "job_title": "Software Architect", "duration": "N/A", "pros": "Work life balance,\nNew technology\nGood team", "cons": "Some projects runs with legacy tech"}, {"review_title": "Good company so far", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "5 Jul 2022", "job_title": "Senior Billing Analyst in Manila, Manila", "duration": "N/A", "pros": "They enrich my knowledge and provide me with career growth. It's a great workplace, focuses on employee needs, and has great benefits", "cons": "Not enough manpower especially in the backend who will work on the improvements."}, {"review_title": "Software Engineer II avg salary", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "29 Jun 2022", "job_title": "Software Engineer II", "duration": "N/A", "pros": "cutting edge technologies\nwork life balance", "cons": "so far no Cons to say"}], [{"review_title": "Circles review", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "12 Jun 2022", "job_title": "Senior DevOps Engineer", "duration": "N/A", "pros": "Good package, supportive and global team and good exposure", "cons": "Work life balance is bit low"}, {"review_title": "Great, but still a lot of room for improvement", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "13 Mar 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- Lots of training and career opportunities available\r\n- Expansion of skillset is inevitable\r\n- CSOPs are one of the best things!", "cons": "- Too top-heavy\r\n- Everything is urgent, everyone is impatient"}, {"review_title": "Smoke and mirrors", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "17 Mar 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "It’s hard to think of something compelling as to why you would want to work here.", "cons": "The entire operation is smoke and mirrors.\r\nNobody has honest conversations and targets are seemingly pulled out of thin air. \r\nSystems, processes and accountability are woeful. \r\nThey drink the cool aid giving you csop instead of salary."}, {"review_title": "I should have listened to past reviews and never entered this company", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "8 Jan 2022", "job_title": "Analyst", "duration": "N/A", "pros": "- Very data-driven in all things.\r\n- A handful of coworkers who are genuinely helpful.", "cons": "- No respect for time. They own your evenings. \"Lunch break\" is mere formality because it is not properly observed. If they want you to join a sudden meeting at 12:35pm, you join. You could be literally starving but it's not their problem. \r\n- Also about time, expect some colleagues to think like your life revolves on them alone and you have no one else to deal with. Their demands are heavy for very little time given to you. (to be fair, some are quite understanding)\r\n- If you are new to your job, they don't care. There's no such thing as margin for error. When it comes to maths, forecasts, and numbers, it's either you get a number right to the hundredths decimal or you are a failure at your job. Not to mention there is ZERO support or mentorship to begin with. I was my own mentor and simply learned off mistakes. I learned everything the hard way.\r\n- One minute they say \"we don't want you to be overburdened\", then later on they give you the opposite what they say\r\n- Most of the people interactions I had was when I'd be dumped some work to do or I'd be told \"how could you do this terribly wrong\", i.e. being off by 0.002% in my number forecasts. \r\n- Weird org structure. Your role can be technical in nature but be in a department/team where everyone else is non-technical. Hence, the lack of mentorship/guidance and support system, I suppose.\r\n\r\nThis company scarred me and destroyed my confidence in myself. I wish I never joined Circles. I've been to terrible companies before Circles but this company is something else. I should've taken the past reviews here on Glassdoor as a warning."}, {"review_title": "Great vision and hypergrowth experience", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "6 Feb 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- The company is driven by a great vision\r\n- Senior management is very transparent when sharing the company progress, revenue, business plans\r\n- Great opportunities to learn and grow.\r\n- Latest tech stacks are used for development\r\n- Hypergrowth trajectory and employees are given stock options", "cons": "- Processes can be improved further\r\n- Onboarding needs to be improved further to train newcomers."}, {"review_title": "Decent", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "31 Mar 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Sg based Mvno. Decent pay", "cons": "No direction. Bad middle management."}, {"review_title": "n/a", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "24 Mar 2022", "job_title": "Operations Manager in Manila, Manila", "duration": "N/A", "pros": "- they have big visions for the company", "cons": "Very hectic and lot to improve on tools for employees to make the job easier"}, {"review_title": "Growth Intern", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "30 Mar 2022", "job_title": "Internship", "duration": "N/A", "pros": "Hands on and great experience to explore relevant skills", "cons": "Mid to High Turnover for company"}, {"review_title": "Analyst", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "22 Mar 2022", "job_title": "Analyst", "duration": "N/A", "pros": "Great place to work, lots of ownership", "cons": "Progression might be slow, very busy"}, {"review_title": "Good growth if you push yourself", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "8 Feb 2022", "job_title": "Creative Designer", "duration": "N/A", "pros": "Exponential growth if you put your mind to it and really work towards a clear goal\r\n\r\nSupportive team members", "cons": "Lack of leadership and structure; you're kind of exploring a bit blindly"}], [{"review_title": "Good work life balance", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "9 Mar 2022", "job_title": "Anonymous Employee in Jakarta", "duration": "N/A", "pros": "Good work-life balance, open to new idea", "cons": "Too focus on sales target, not brand building"}, {"review_title": "Nothing", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "3 Mar 2022", "job_title": "Senior SysOps Engineer", "duration": "N/A", "pros": "Nothing to say about the company", "cons": "Perfect place to work as an employee"}, {"review_title": "Terrible leadership and staff attrition", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "6 Mar 2022", "job_title": "Anonymous Employee in Sydney", "duration": "N/A", "pros": "Stock options and ability to be a great company", "cons": "Terrible leadership lots of fake promises and not much collaborative leadership"}, {"review_title": "Decent experience", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "24 Jan 2022", "job_title": "Senior Automation QA Engineer in Bangalore", "duration": "N/A", "pros": "Singapore work timings was convenient", "cons": "Too many confusions on the product side"}, {"review_title": "OK", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "25 Feb 2022", "job_title": "Senior Software Engineer", "duration": "N/A", "pros": "Telco tech, fast paced, ownership", "cons": "No pay rise, less bonus"}, {"review_title": "Does not walk the talk", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "20 Sept 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- Employees know what they are doing. \n- Friendly and approachable people. \n- Flexitime", "cons": "- Poor onboarding. No adjustment/transition period. People just expect you to automatically know what to do without proper briefings or any context. \n\n- Quantity over quality. Lots of last minute work. No proper quality checks in outputs because everything is rushed. This results to unreasonable deadlines. Poor project timelines. People seem to be allergic to proper planning. They just want to keep on churning out campaigns and projects even if concerns are raised about the timelines and planning. Poor project management. \n\n- People are too focused on unrealistic numbers/goals (OKRs), which makes the quality of wok subpar. \n\n- They fire people just like that, without thinking of proper turnover. Teammates end up panicking or bombarded with additional work they have no idea about, because it was handled by the fired employee. \n\n- Long work hours. Expect work messages after work hours and on weekends. Working on weekends seem to be considered normal. \n\n- Too many unnecessary meetings."}, {"review_title": "Not the best place", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "2 Nov 2021", "job_title": "Software Engineer in Bangalore", "duration": "N/A", "pros": "Free beer and onsite visits", "cons": "The management is pathetic. They have a hire and fire culture."}, {"review_title": "Low pay, csop is a joke... will delay payout as much as they can", "rating": "3.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "13 Sept 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Steep learning curve, great for workaholics", "cons": "a lot of people who love to blame others for their mistakes"}, {"review_title": "Have officially become one of the owners of Circles.Life!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "5 Jul 2021", "job_title": "Marketing Administrative Assistant in Manila, Manila", "duration": "N/A", "pros": "Have finally fully vested my stocks! Always thrilling to know that I have so much more things to learn and realize as I go through this journey with the most bold, innovative individuals!", "cons": "I would say it's a bit sad that most of my co-workers are based outside of the Philippines, as I won't get to know more about them."}, {"review_title": "Circles.Life Review", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "6 Jul 2021", "job_title": "Lead Customer Happiness in New Delhi", "duration": "N/A", "pros": "Open culture, strong vision and values, employee is considered as an asset", "cons": "sometimes things break and it happens in a super fast growing start up.. but its all to be managed."}], [{"review_title": "New Domain", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "9 Sept 2021", "job_title": "Software Engineer I in Colombo, Western", "duration": "N/A", "pros": "There is much to explore", "cons": "There is nothing to highlight as of now"}, {"review_title": "I grew 3x faster in my role here! It wasn't easy, most of the time it was challenging but a rewarding at the same time.", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "9 Nov 2020", "job_title": "Talent Acquisition in Manila, Manila", "duration": "N/A", "pros": "You have ownership of your growth since there's a lot to do and processes to put in place\r\n\r\nYou will learn how to be resilient as this a fast-paced environment; You have to toughen up here to survive!\r\n\r\nI love working with my colleagues and stakeholders - they are professional and they have world class skills!\r\n\r\nI learned to step up my game and go out of my comfort zone and discovered more about my strengths!\r\n\r\nHigh potential industry (digital telco) and the products they introduce will definitely fly!", "cons": "Fast-paced (not for all esp you are used to a very structured and slow paced org)\r\n\r\nDecisions are made really fast - need to be flexible\r\n\r\nCan improve in the benefits, although understandable at this point. Hoping we can have improved employee-centric benefits"}, {"review_title": "Innovative Company", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "29 Aug 2021", "job_title": "Senior Site Reliability Engineer in Colombo, Western", "duration": "N/A", "pros": "Open to try new technologies\r\nInnovative", "cons": "On calls are compulsory and can get very hectic"}, {"review_title": "\"Great place to work\"", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "26 Jul 2021", "job_title": "Recruitment Coordinator in Makati City", "duration": "N/A", "pros": "Lots of growth opportunities and professional development\nApproachable and objective feedback from manager", "cons": "Intense / working for a start-up\nCompensation"}, {"review_title": "A vicious cycle(circle)", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "15 Jun 2021", "job_title": "Software Engineer in Bangalore", "duration": "N/A", "pros": "None at all except maybe some events that are celebrated with cakes and drinks", "cons": "-Distrust\r\n-Lack of transparency\r\n-Best practices is no practices\r\n-Work without respect of boundaries\r\n-Segregated people with some pockets of happiness in some departments but mostly hate their jobs\r\n-Challenges are set not to challenge but as marketing gimmicks to staff"}, {"review_title": "A humane organization", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "6 Dec 2020", "job_title": "Customer Happiness Manager in Manila, Manila", "duration": "N/A", "pros": "A lot of us were adversely impacted in a big by the recent typhoon in Phillipines. Our homes were flooded and we had no electricity. In these trying times, it was great to know that the company leadership thought about us and took meaningful steps to help out. Our salaries were credited ahead of time. Each one of us in the PH office got a care package. And, the leadership showed great empathy by relaxing timelines on things that had to be turned around or, catered to.", "cons": "we are growing fast and some of our processes are still trying to keep pace with the rate of change"}, {"review_title": "Salary review", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "31 May 2021", "job_title": "Operation Associate in Taipei", "duration": "N/A", "pros": "colleagues and environment are great.", "cons": "Promoted is not easy in this company"}, {"review_title": "Pre Covid", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "2 Mar 2021", "job_title": "Senior Software Engineering Manager", "duration": "N/A", "pros": "Heti is amazing, what he wants to accomplish, is the way to go", "cons": "Founders do not allow the people they hire to work, it's waterfall, micromanaged."}, {"review_title": "Great place to work with highly skilled professionals.", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "7 Feb 2021", "job_title": "Software Engineer II in Colombo, Western", "duration": "N/A", "pros": "- have sprit to grow in terms of all the apects\r\n- well organised\r\n- have good vision", "cons": "i don't see anything serious"}, {"review_title": "I think I'm in the right place now :)", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "18 Jan 2021", "job_title": "Customer Happiness Manager in Jakarta", "duration": "N/A", "pros": "Great place to work and grow.", "cons": "In this hectic period, the Work/Life Balance is something that needs to be taking care carefully."}], [{"review_title": "Full of policitcs and waste of time", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "4 Feb 2021", "job_title": "Senior DevOps Engineer in Bangalore", "duration": "N/A", "pros": "no work, so you can work on your skills by doing any POC", "cons": "Fired you any time without reason"}, {"review_title": "Culture", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "4 Dec 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- Founder is also a good motivator", "cons": "- The company is struggling and their management strategy is bad"}, {"review_title": "Poor Work Culture", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "21 Jan 2021", "job_title": "Technical Lead", "duration": "N/A", "pros": "Little to none pros for this company.", "cons": "Everyone is overworked and there is clear favouritism shown to certain groups of employees"}, {"review_title": "Good experience", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "9 Aug 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Diverse team to work with", "cons": "None I can think of!"}, {"review_title": "Axed employees who helped launch internationally then called them redundant", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "1. My team respected work-life balance and helps each other out with on-call events even during weekends or holidays. Team also respected the fact that members are scattered across countries.\n2. That’s about it.", "cons": "1. Other departments in SG office seem to not care about demographics of other countries and appear to believe that what succeeded in SG will “surely” succeed in other countries.\n2. Lack of information sharing between teams, sometimes even among team members, where as long as you weren’t in SG office, you were considered as “must comply by all or any means.” Often creating last-minute requests and calling said requests as “urgent.” Mind you, this didn’t happen in my team but has happened to another colleague in another team.\n3. High-level management sets up SLA for alerts then creates alert policies that are shorter than said SLAs, thus showing lower MTTA numbers. \n4. Some managers, when asked questions or criticized in monthly town halls, choose to give light answers or ignore the questions entirely.\n5. Axed the people who helped launched locally in TW and AU, then called them redundant. Hey, at least show them the gratitude they deserve for helping Circles.Life come “The first international telco.”\n6. Made it look as if the most recent lay-off move was to let go of the bottom 10% performers. That wasn’t the real reason we were given when we were let go."}, {"review_title": "Pathetic Company to work for", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "30 May 2020", "job_title": "Senior Software Engineer in Bangalore", "duration": "N/A", "pros": "1) Less work. People do try to follow 9am-5pm schedule\r\n2) Good compensation\r\n3) Business trips to Singapore", "cons": "1) Company has a lost vision\r\n2) Peers are pretty much average from local colleges\r\n3) The biggest issue with this company is the senior management. They can fire you anyday without giving any prior notice or warning. They will take you to a meeting room and will ask to submit your laptop and leave immediately. Such is the unprofessional behaviour of the management. And it was happening for people from entry level to Director level.\r\n4) I was part of the Bengaluru office which had about 35 employees when I joined. During my tenure of 3 months, I saw about 10 people quitting themselves and 15 people getting fired. I was not any of the fired ones, but I quit myself seeing the unstable nature of this company. Nobody was sure what is going to happen next. \r\n5) During my tenure I also saw office boys and talent acquisition people getting fired. It was like nobody was spared.\r\n6) Looks like they were planning to close off the Bengaluru office, but the way it was done was terrible.\r\n7) All this started happening after the new CTO joined the company. Any questions related to firing were termed as organisational changes. Really a bad CTO from my perspective.\r\n8) Overall they had a very buggy system in place, where even monthly bills of customers had huge errors reported every month."}, {"review_title": "Recommended Workplace", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "22 Jun 2020", "job_title": "Customer Happiness Manager in Jakarta", "duration": "N/A", "pros": "Culture and People, its make me enjoy working there", "cons": "The communication style too rigid"}, {"review_title": "Great team to work and grow with. You get opportunities to learn from and work with highly experienced people.", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "No hierarchy- you can approach the leadership team and the founders anytime with ideas or concerns. \n\nProject ownership - you will be given the opportunity to lead projects if you perform well. \n\nHigh standards - they expect quality work and high output pushing you to work and deliver better (great opportunity to grow)", "cons": "Sometimes you might lack direction in the project. In which case, you have to test your assumptions frequently (ask fundamental questions)."}, {"review_title": "Lot to learn....Good Working Env!", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "20 Feb 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "We get to work with a bunch of intelligent people\r\nPeople belong from all parts of Asia , so we actually get to experience unity in Diversity. People are very supportive and encouraging and always ready to help.\r\n\r\nLot of scope to learn new things and up-skill ourselves.", "cons": "Nothing much. Only few here and there which are of low priority\r\n\r\nNo transport facility\r\nWe won't find a dormitory in any Circles office"}, {"review_title": "Running around in circles without much progress", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "16 Jan 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Trying to infuse some new ideas into the stagnant telecom industry\r\nSome very enthusiastic people in the company", "cons": "Projects get shelved too often before launch\r\nPeople in top management give you all the responsibility but none of the credit\r\nFear-driven culture"}], [{"review_title": "Dont believe anything that the company or HR or management says", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "22 Aug 2019", "job_title": "Software Engineer in Bangalore", "duration": "N/A", "pros": "1. Start up culture, no concrete process\r\n2. No normalization\r\n3. Will get to experience what a back office is in name of full fledged development center", "cons": "1. HR deceives in terms of stocks and salary.\r\n2. No clear vision of the management for India Center\r\n3. Development teams get work like support team for Singapore office\r\n4. Micromanagement till the core"}, {"review_title": "Immature, rude and pretentious management, but company has great potential", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "7 Feb 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great people in the team. Some truly passionate people to work with.\r\nIf you can shout out loud and show off, then great opportunity to climb the ladder fastly.", "cons": "This company has always had some immature people like recruiters sending out wrong messages in terms of salary and stocks to new joiners. Interviewers\r\nselecting overqualified people without knowing what is the role and responsibility \r\nthey are hiring for etc.\r\n\r\nBut from mid-September, an unprecedented downturn is going on. It all started with the sudden unexplained firing of pioners who helped set up the company in the first place. This followed by layoffs and overdoing things to do the damage control.\r\n\r\nTheir sole objective is now to quantify profits in every aspect with zero people management skills. This quantification is so much so that they even quantified bonuses and appraisals breaking clauses in offer letters which guaranteed a minimum bonus, which is illegal and the company deserves to be sued for this. What they don't realize is this can create a hostile environment as people can start firefighting to gain promotions and appraisal by hook or crook. \r\nWith people being let go, credits for work not being given if their work doesn't seem to contribute to the company's profit. A lot of people feel beaten down, cornered and uncertain about what is the next turn going to be.\r\nAmidst all these, they are still punting it back to the employees calling it \"If you don't believe in leadership then you are not the right fit\". Leadership has no clue how to uplift the morale of the employees lacks empathy. They want people to completely surrender and suck up to the management and make them feel miserable so that they can be easily controlled or rather enslaved. Nobody is happy with newly appointed leaders who have made everything about themselves(some happy people are either naive or also among those who lack empathy, very few in number ), crushing everyone on their way, they are on spree to weed out every possible threat to secure their job. All this can only go on till the point when people raise their voices and fight for their rights which can be dangerous."}, {"review_title": "Senior Recruiter", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "4 Oct 2019", "job_title": "Senior Recruiter in Bangalore", "duration": "N/A", "pros": "Excellent institution to learn with team and grow with the company. \r\nVery open environment have access to senior-level people \r\nInnovative workplace\r\nTaking risks are encouraged\r\nFlexible work timing, work-life balance is encouraged.", "cons": "Very few which is common in most of the companies in India, but the pros outlay the cons by a huge margin."}, {"review_title": "Great place to Learn and Work", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "3 Oct 2019", "job_title": "Senior Recruiter in Bangalore", "duration": "N/A", "pros": "Great opportunities, benefits, pay and work life balance\r\nExcellence in management and Technology development\r\nThe best organization to work. Wonderful work culture. Great place to learn. An university to learn. A heaven for newcomers.", "cons": "No major cons, it is one of the best employers"}, {"review_title": "Circles.Life will make you run in Circles.", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "2 Mar 2020", "job_title": "SDE2 in Bangalore", "duration": "N/A", "pros": "Bangalore office had good leaders before they moved on.", "cons": "Poor communication with head office in Singapore.\r\nThey don't care for the lives of their employees."}, {"review_title": "Can be a better workplace", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "22 Feb 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Good salary, flexible work hours", "cons": "Management in Singapore doesn't sync with teams in other geographies"}, {"review_title": "Great place to work & learn", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "15 Oct 2019", "job_title": "Customer Happiness in Jakarta", "duration": "N/A", "pros": "No hassle bureaucracy\r\nOngoing support from the founder\r\nStrong and solid team", "cons": "Snack is draining fast in the Jakarta Office"}, {"review_title": "Startup Process not good", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "3 May 2020", "job_title": "Customer Service Agent", "duration": "N/A", "pros": "Free food in the pantry", "cons": "Leaders treat employees as dispensable items"}, {"review_title": "nice place to work, learn, and grow", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "17 Sept 2019", "job_title": "Senior Operations Associate in Jakarta", "duration": "N/A", "pros": "visionary leaders, positive employees, and learning opportunity", "cons": "I don't find one and any"}, {"review_title": "Product Engineer", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "13 Nov 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Fast paced and electric workplace, ready to try new technologies", "cons": "Lack of competent leadership team"}], [{"review_title": "on of the best working environment", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "24 Jun 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Supportive working environment. Accept failures", "cons": "Need to manage the end-to-end task with tight deadline"}, {"review_title": "Inter", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "4 Nov 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Fun people, free food, activities", "cons": "Lot of work, a big turnover"}, {"review_title": "DON'T JOIN", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "28 Feb 2020", "job_title": "Operations", "duration": "N/A", "pros": "1. pantry full of snacks and fruit 2. fast-paced culture", "cons": "the management team are disrespectful and enforce team to solve the issues with OT on weekends."}, {"review_title": "How can you sustain operation with average 30 orders per day", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "21 Apr 2020", "job_title": "Operations in Taipei", "duration": "N/A", "pros": "Good package. Free drinks. Free lunch", "cons": "No competitive products in tw."}]]