[[{"review_title": "Amazing company, amazing people, just a little ADD", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "12 Mar 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "I joined Twilio not knowing where my career was headed, and I've found clarity and had an amazing journey along the way. Twilio took so many chances on me, and I'm grateful for that. \r\n\r\nI love the people I work with and feel like I've found a workplace where I can fully be myself and be appreciated for me. While there's a bit of hierarchy and politics day to day, people genuinely want to help each other and make the company more successful. There's a spirit of togetherness that I love seeing every day. \r\n\r\nAnd an amazing culture of innovation. My coworkers are constantly thinking through how we can make products, processes, and people more efficient. They genuinely care about what they do, and our follow through as a company for what we commit to is incredible.\r\n\r\nOur sales team is killing it, support is doing a whole lot with very little, facilities are my favorite people, and product keeps coming up with brand new ideas to make cool things happen.\r\n\r\nTwilio treats its employees well. We may complain about the lunch line and so-so benefits, but the sheer amount of care that's put into things like our company all hands and our new hire training experience shows the company's dedication to its people. \r\n\r\nJeff is an great leader and sets an amazing example. Management, on the whole, are caring and well intentioned. We've had some really incredible new managers from internal promotions who I enjoy working with.", "cons": "Ok, so some of the less glamorous aspects:\r\n\r\nTwilio's model for designing and shipping new products has... shall we say... some areas for improvement. There's an almost exhausting race to find the next biggest, brightest thing to go after. As a result we have a lot of floundering old projects because we're bad at retiring products but really good at running at breakneck speed towards the next new announcement. Churning our products quickly creates engineering issues. Also, it's just plain exhausting for our engineers and it drives marketing to insanity for every launch.\r\n\r\nAnd we preach wearing the customer's shoes, but the shoes we try to wear are a tiny group of customers who will generate the most revenue. Product Managers are missing exposure to a larger set of customer issues that literally prohibit some users from adopting Twilio, and there's no easy way for them to get more expansive qualitative feedback.\r\n\r\nAlso, most importantly, Twilio is essentially propped up by a subset of really, really amazing executors. We know informally who a lot of these people are. Lots of them are employees who have been at the company for many years, like myself. They have a lot of institutional knowledge. And they are quitting. In droves. It's not unexpected in a post-IPO world, but the company seems highly reactive when a valued hard worker with tons of tribal knowledge announces plans to leave. I hope HR has plans for retaining what small long-standing talent remains or keeping people who've been around for a while more united. Especially within our sales force, where the majority of employees are new and reorgs are not uncommon."}, {"review_title": "Chaotic process, lacking product leadership", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Comp\nBenefits\nTypical tech company perks", "cons": "Very chaotic process for choosing what to invest in, little objectivity and customer input despite these being core values.\nStill a founder led company, all decisions go through him which is not scaling well at all.\nPress/event driven product roadmaps with little customer value shipped.\nMassive number of betas and products in market with a handful of customers on them, unclear how they can continue to innovate without systems and processes that enable it.\nCEO will agree with an idea or product until he doesn’t, not clear how long you’ll have alignment or how to get it again."}, {"review_title": "Best employment experience to date", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "23 Nov 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- Tons of opportunity for ownership, leadership and advancement\r\n- Successful, stable company with clear growth trajectory \r\n- CEO and other executive leadership are down-to-earth, approachable, but also brilliant\r\n- International / Global presence and offices everywhere, easy to work remotely\r\n- Really yummy food on the days they feed us\r\n- Inclusive and rich company culture that looks for \"culture-add,\" not \"culture fit\"\r\n- People around you are Doers—they are leaders in their own right and  love to do and make and build\r\n- Extremely competitive compensation package", "cons": "- Pretty young design org - some growing pains in leveraging design methodologies across the company\r\n- Some silos among and between teams- that's not always bad tho"}, {"review_title": "New Hire Experience", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "2 Oct 2018", "job_title": "Anonymous Employee in San Francisco, CA", "duration": "N/A", "pros": "From the initial recruiting to interviews and on-boarding, the experience with Twilio is different. So much attention to detail and a lot of emphasis on making sure new hires align with the company's values. The interview process is not simple, yet it's enjoyable. Each person I met was consistently smart yet humble and approachable. Super welcoming team and just a really good vibe in the office. Growing a lot!", "cons": "It's not easy to get into Twilio - they really make sure one is a good fit. Beyond skills and intellect, it's all about making sure one is a good fit."}, {"review_title": "Encouraged to be your authentic self. Not big in hierarchy- Welcome to Twilio Dublin", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "24 May 2019", "job_title": "Accountant in Dublin, Dublin", "duration": "N/A", "pros": "Twilio is a great employer. I appreciate it especially when I compare myself to my peers in other tech companies. We get paid very competitively and the perks are amazing. The job itself is rather interesting as well. I love the very caring and chilled atmosphere in the office - coming from a financial background , the flexibility my managers give me and the autonomy is amazing and I for one am very appreciative of it , we are given the tools to succeed.  In no other company will you get so much 1:1 time with your manager and controller who will sit you down and ask what career path you're looking at and how they can help you get there.\r\n\r\nYou're always encouraged to be your authentic self. Not big in hierarchy. - Sense of belonging: The people working here are usually passionate about what they are doing. \r\n\r\nHR team very approachable and helpful when anytime advice was required. Always available :-)\r\n\r\nLot's of resources for learning and development while you work in making the world more open and connected", "cons": "- As in any company you will encounter issues and you will not be happy with many things, it's not Paradise.However , I found that the more we put in the more we get back. \r\n\r\n - Very fast paced environment. - You get a lot and you have to give back more."}, {"review_title": "Horrible especially HR", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "26 Jun 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Nothing much to say here", "cons": "It's about who you know and if you are well liked (especially the HR team). HR team is very transactional not transformational. Horrible leadership and immature. They say they embrace innovation  but when it comes to sharing a new idea or a different opinion you get called out for it. If it isn't \"Twiliozed\" you are in big trouble. It's very cliquey here and they steal your content (especially HR). I've attended conference calls/web ex meetings and they literally take photos of other external partners content so they can use it as their own. All they care about is executing and don't care how they go about. Talent Development and leadership programs and horrible."}, {"review_title": "Great place to be EMEA", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "16 Jan 2020", "job_title": "Account Executive in London, England", "duration": "N/A", "pros": "If you are looking for a place to challenge yourself, Twilio is the place to be. \r\nOur product is disrupting the market and any customer that engages with people, needs Twilio.\r\nOur management has succeed to grow the team while  keeping everyone happy.\r\nThe London office is truly diverse and makes you meet exceptional people from all around the world.", "cons": "Working in a hyper-growth company can make it difficult to have a good work life balance, but you can always work on yourself and communicate with your manager.\r\nAfter 1 year of acquisition, I was expecting a better integration with Sendgrid platform."}, {"review_title": "Twilio truly does live its values.", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "26 May 2018", "job_title": "Director in San Francisco, CA", "duration": "N/A", "pros": "- Inclusive and dynamic culture where open discussion is welcomed and company-wide information sharing sessions are regularly held. \n- Wicked smart people who are always well informed and ready to share their perspective. This generally makes every decision better. \n- A technically diverse product portfolio so there is always something new to learn if you feel so inclined. \n- The get out there and do it attitude really shines through and help our customers be successful.", "cons": "The diverse products and the product first philosophy means it’s sometimes difficult to tell a connected, more strategic, story across the business, both for sales and ultimately for customers."}, {"review_title": "Dynamic and growing company with inclusive culture", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "23 Jul 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "a lot of learning opportunities with the ability to move roles across the org in case a different business function a passion for you. They seem to care about people both their employees and customers. Good benefits and option to enroll in ESPP. My manager is both supportive and empowering to my day-to-day work.", "cons": "It's not a flashy company, budgets are a bit cheap. You won't get daily meals but there are catered meals a couple times a week. Then again one of the company values is to be frugal. Company is growing and hiring, making for a lot of waves/change. Could be an uncomfortable or exciting time for you depending."}, {"review_title": "I feel very lucky to have found a job at Twilio.", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "29 Jul 2014", "job_title": "Anonymous Employee in San Francisco, CA", "duration": "N/A", "pros": "I actually like going to work everyday.  The people I work with are dedicated to their jobs but not so single-minded that we can't have fun during the day.  I feel like I am appreciated and my input is valued.", "cons": "The commute to the city is a hike (but expected and a trade off for a higher salary).  At least it's not too far from Bart."}], [{"review_title": "A company that values employee experience", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "7 Jul 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- Twilio truly values creating an amazing employee experience. They don't just talk about it, they are constantly iterating and making it better and better.\r\n- Autonomy of employees.\r\n- Small teams.\r\n- Quarterly reviews.\r\n- Solid remote employee experience.", "cons": "Much of R&D is still not on board with remote employees. Twilio as a company has greatly improved the remote employee experience, but R&D specifically still strongly prefers on-site employees. Hopefully, that will change."}, {"review_title": "Great company to work at", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "25 Jul 2019", "job_title": "Senior Solutions Engineer", "duration": "N/A", "pros": "There is an actual sense of community in this company. The people are very helpful and there for you for any help you will need.  The culture of the company is very attractive and everyone is very optimistic. This has to do with the great products the company is offering.\r\nWhat i like the most is that the company is created by software devs and the main goal is to provide something great for other software devs. Not something that you see very often.", "cons": "The company has a huge growth and although this is great it can have some negative aspects."}, {"review_title": "Fast-paced, progressive, amazing place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "24 Oct 2019", "job_title": "People Team", "duration": "N/A", "pros": "Twilio has BY FAR the most wonderful culture out of all the companies I've ever worked for. Every employee lives by the Twilio values, and there is a lot of cross-department collaboration. The benefits and perks are also unparalleled. The company's success is growing also - the product is applicable to any customer. Twilio.org is also an entire department of the company that is dedicated to community service and involvement.", "cons": "Because the company is growing so fast, there are days that are chaotic, and there is a lot of ambiguity. However, everyone around you wants you to succeed, so they're open to helping out as much as possible."}, {"review_title": "Best tech company I've worked for!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "14 Sept 2015", "job_title": " in San Francisco, CA", "duration": "N/A", "pros": "-Great small teams environment\r\n-Management is very involved in all parts of the business\r\n-Awesome culture where everyone is very friendly and willing to help one another\r\n-Startup perks (flexible hours, free lunches, gym/cell phone reimbursement, unlimited vacation)\r\n-Exec team is accessible and listens to employees\r\n-Mid sized startup- small enough that you feel like you are making an impact but big enough that it has resources and structure in place\r\n-Culture around learning and encourages growth with employees", "cons": "-Some growing pains (like a lot of startups)\r\n-Doesn't have free lunch everyday like other startups"}, {"review_title": "Don't miss a chance to work here!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "5 Sept 2018", "job_title": "Software Engineer in San Francisco, CA", "duration": "N/A", "pros": "Awesome people! Hands down the best people I have worked for until now. CEO and the company on the whole is very energetic which makes you feel that your contributions actually matter. Definitely do not miss a chance to work here! People here think from the perspective of customers experience and actually strive to make it better (One of their core principles). I have never seen any company take this as serious as Twilio does.", "cons": "I cannot think of one, but if I have to say something, I would may be wish to have better employee benefits such as a better health insurance, commuter checks, etc"}, {"review_title": "People come first", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "23 May 2015", "job_title": "Business Development Representative in San Francisco, CA", "duration": "N/A", "pros": "- Dynamic company in a wide open field\r\n - Strong leadership and vision for the future\r\n - Commitment to ethical growth\r\n - Fun! Really does feel like a family. You want to do a good job because you like the people you're working with and are motivated by that bond.\r\n - Collaboration and learning are strongly valued", "cons": "No real cons. Typical growing pains concerns can crop up, although not felt as strongly as at other fast-growth startups. You can tell adults run the business."}, {"review_title": "Great product and not so great culture", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "5 Feb 2020", "job_title": "Director in San Francisco, CA", "duration": "N/A", "pros": "Awesome products to work on. C-level leadership pays close attention to all initiatives.", "cons": "I have worked at Google, FB and SF in the past, and the PMs at Twilio do not quite meet that bar. Most of the time is spent in politics versus paying attention to customers and tech details. And hence I went back to FB."}, {"review_title": "Sales", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "8 Nov 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Good product and great energy on the product and development side", "cons": "Poor sales leadership and very reactive.  Also forcing some good people out the door to competitors.  CEO is smart and savvy, but COO he brought in is in over his head."}, {"review_title": "Loved the culture, as well as the mission", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "17 Nov 2016", "job_title": " in San Francisco, CA", "duration": "N/A", "pros": "I really loved how much everyone within the company was behind what we were trying to solve in the space that we were in. The culture was really great, and their core values show you that they are not only a great group of people but stand for something great. Management was great.", "cons": "Work came home sometimes, although not a con for everyone.. it could be. Really not even that big of a con for me because they made up in other areas."}, {"review_title": "Account Executive", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Great product, awesome coworkers, free lunch and stock is doing very well.", "cons": "I’ve been one of the struggling reps for some time. I know this isn’t on account of my experience or effort level; I’ve worked at 3 other great companies in the Bay Area and left another company in hopes of a new opportunity to keep the trend upward. Regardless of how often I’ve made it clear and shown my hard work to management, it has been clearly overlooked.\n\nTerritory defines your success here and even if you work hard, management will seemingly give good territories to either brand new reps or promoted BDRs. Why not give it to reps who know how to sell and aren’t new to the gig? Maybe they would grow the deal size a bit more. If you ask for help on bettering your situation, don’t expect to get some actionable ideas on how to get better or improve your situation. They may as well say a blanketed statement like do better.\n\nOur comp plans have been a complete mess and are now capped so there isn’t an opportunity/incentive to overachieve in our department. Also as others have indicated, your comp plan changes quarter to quarter as they attempt to “improve it” so it’s hard to really know how you will end up doing in the end. \n\nMorale is at an all time low and management doesn’t really know how to improve it. They ask their teams to try and be positive and trust their direction. Well I’ve been trusting their direction and it hasn’t paid any dividends.\n\nIf you plan to work hard, expect some recognition, want to make money and are looking for a positive environment, this is not the place to do it. Experienced reps with great training don’t succeed here, it’s the ones who are on the top of the managers mind that do."}], [{"review_title": "Not what it professes to be", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "20 Dec 2019", "job_title": "Engineer", "duration": "N/A", "pros": "Some areas of strong talent.  Getting hard to find more pro's...", "cons": "Leadership matters...and really poor leadership will ultimately catch up with an org.  CEO is way over his head.  Exec team is really dysfunctional.  Wildly embarrassing earnings call, and it kept getting worse after the call.  Sounded like the 3 stooges - an embarrassing time to be at Twilio.  CFO lost huge credibility. Diversity issues are rampant.  Prod/engineering is a mess.  HR is now a complete joke - used to be impressive.  .org is the only impressive function left."}, {"review_title": "I <3 Twilio!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "11 Jun 2020", "job_title": "Solutions Architect in Dallas, TX", "duration": "N/A", "pros": "If I could have designed a company to be exactly what I wanted it to be, it would look a lot like Twilio. Pay is highly competitive, hard work is not only recognized, it's celebrated! Benefits are amazing, people are the best of the best, and the product we sell is the best in the market by a longshot. Couldn't be happier.", "cons": "Nothing worth noting on here."}, {"review_title": "Amazing Company", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "11 Sept 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Working at Twilio has been incredible. The people really care about what they are doing and the impact they are making.\r\nTwilio can be used by almost every individual in the world - and it's amazing to see the growth Twilio has achieved.\r\nManagers really empower you to think outside the box and help scale Twilio. \r\n\r\nPerks: \r\nCompany lunches 2-3 days a week.\r\nWednesday Night Dinners, every Wednesday! \r\nUnlimited PTO \r\nFlex work env. \r\nPlus many more..", "cons": "Company is still growing so their are some growth pains and some things that feel like bottlenecks at times. But overall, nothing earth shattering."}, {"review_title": "Horrible place to work if you are in sales", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "21 Mar 2018", "job_title": "Sales", "duration": "N/A", "pros": "Decent product with name recognition with an impressive list of customers.", "cons": "OMG where do I start? Twilio is an awful place to work as a salesperson.  They have been having a sales hiring surge over the last year after the new COO came to Twilio from Salesforce. He is trying to make Twilio into Salesforce's image and is making it a terrible sales culture. So much change in territories and comp plans that it was impossible to build a pipeline. The comp plan is so hard to understand that reps just give up trying to figure it out. (30 pages long) Twilio pays comp 4 times a year. 45 days after the end of the quarter. And when they do pay comp it is usually wrong. There are constant battles between sales, operations and legal. The processes are so arduous to follow and they are constantly changing. And you better watch out if you want anything done quickly.  The legal and operations teams have no sense of urgency. and if you do need something done outside of the process they will penalize you for it .  There are so many cliques at Twilio that if you are not in the \"cool crowd\" then you are isolated and ignored. Favoritism is rampant. Reps who are favored get all the good leads and opportunities. Executive sales leadership is the worst I have ever experienced.  They do not value salespeople who color outside the lines and if you upset the wrong person  you get fired for  some trumped up reason. If you don't fit into their sales model then they find ways to make you exit the company.  Cutting territories, moving people around and reassigning accounts and pipeline.  If you have a problem with management don't go to HR. All they do is tell your manager what you said. Bottom line-Twilio is a horrible place to work for salespeople."}, {"review_title": "Caring company", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "11 Mar 2020", "job_title": "Senior Software Engineering Manager in Tallinn", "duration": "N/A", "pros": "Really caring management, feeling of belonging. Great salary and stock grants! Nice colleges, friendly environment. Best office perks I have seen.  Really strong leadership, a lot to learn from great people.\r\nTech side: microservices, Kubernetes, and empowered autonomous teams.", "cons": "Lot of emails and information to process as a manager.  It can be challenging to make bigger changes, many dependency chains. Managers have evening meetings if you are not near the Pacific timezone."}, {"review_title": "The 9 Values are For Real!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "4 Aug 2014", "job_title": "Senior Technical Support Engineer", "duration": "N/A", "pros": "I love it here.  People care; about the product, about each other, about the customer. \n\nThe talent at every corner of this company is staggering. And everyone I have dealt with is willing to help and teach and make things work.", "cons": "A little process, but not too much, would be a great help as we grow."}, {"review_title": "Awesome leadership, office culture, teammates", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "30 Mar 2020", "job_title": "Account Executive in Denver, CO", "duration": "N/A", "pros": "I work with incredibly smart and talented people. It is absolutely the best part of my job. We have great leaders that respect us as individuals and have a great vision for the future of the company. I love the office, benefits, and work culture that has been instilled at Twilio.", "cons": "I am significantly underpaid for my job title in Denver, Colorado."}, {"review_title": "Good potential, the Bros are exhausting", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "The opportunities here were huge. Most of the people were smart and passionate and knew what they were doing. Twilio is also a well respected brand so that's great.", "cons": "Way too many bros. One guy (not based in San Francisco) that when ever he visited the office work would stop because you have to listen to how he stoked he is about everything. It wouldn't be so bad but he gets most peoples names wrong."}, {"review_title": "Great company to be a part of", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "3 May 2016", "job_title": "Software Engineer in San Francisco, CA", "duration": "N/A", "pros": "Great to place to work at. I have never really seen a place where employees understand and care about the product as much as at twilio. Strong focus on innovation and creative freedom. Plus small team sizes (5-7 per team) afford a lot of opportunities to learn and grow.", "cons": "Office space seems a little cramped up. Other than that none really."}, {"review_title": "Superb company, going places...", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "25 Sept 2019", "job_title": "Director, Product Marketing Management in San Francisco, CA", "duration": "N/A", "pros": "Leader in their space. They have the most mature technology by far and are innovating quickly.", "cons": "They are going through growth changes. This means they are growing up, and sometimes that means more process and change in culture. This is usually for the better, but it does create a little friction between the old staff who are not liking change and the new, energetic staff looking to drive greater growth."}], [{"review_title": "Strong Ownership Culture", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "24 Oct 2019", "job_title": "Engineering Manager in San Francisco, CA", "duration": "N/A", "pros": "The company is growing like gangbusters and so there is always more fun projects to tackle. If you see a problem and want to attack it, you have a ton of open road ahead fo you.", "cons": "A lot of legacy processes made sense when the company was smaller but have not scaled well. The product and process learning curve is still too steep for new employees. Everyone is super supportive but you really gotta go and get your answers."}, {"review_title": "Terrible place to work", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "20 Apr 2020", "job_title": "Engineer", "duration": "N/A", "pros": "Food, snacks, and tshirts are nice.", "cons": "No work life balance. The managers have zero people skills. There is no enablement and expectations are too high. Managers belittle their teams."}, {"review_title": "The best place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "3 Jun 2020", "job_title": "Software Engineer in Denver, CO", "duration": "N/A", "pros": "CEO has a very clear vision for company. This vision is potrayed everwhere within the company. People are very friendly to work with. Everything is properly planned and you have clear understanding of where your career is heading towards. Manager and leads are true mentors and believe in your success. People work in a team and everyone has goal to take company to the new highs. Twilio really takes care of their employees.", "cons": "None to be specific. Everything is perfect!"}, {"review_title": "Some good memories", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "28 Apr 2020", "job_title": "Designer in San Francisco, CA", "duration": "N/A", "pros": "Commitment to diversity\r\nStill early in growth - you can get in at a lower floor and try to make your mark\r\nSome very kind people and great executive leadership", "cons": "Occasional temper tantrums by certain management staff.\r\nStill figuring out a lot of process and suffering from growing pains.\r\nAlmost non-existent support on career path and development (I think they are working on it)"}, {"review_title": "Twilio is a great place to work, good people who care about the power of communications", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "26 Sept 2013", "job_title": "Anonymous Employee in San Francisco, CA", "duration": "N/A", "pros": "Twilio has a great company culture and is growing fast. It's an exciting time to be there, and a fun place to work. The nine core values shape the environment. It's a lesser known startup with a lot of big customers, and it's cool to watch our customers succeed with our product.", "cons": "Fast growth can come with a lot of awkward growth."}, {"review_title": "Best professional challenge, amazing wlb and perks, starting to feel bureaucracy", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "27 Jan 2020", "job_title": "Senior Software Engineer in Bogotá, Bogota", "duration": "N/A", "pros": "- Huge live products, used by important clients worldwide\r\n- Top level engineers to learn from\r\n- First-class engineering practices and products\r\n- Housing assistance (if you live close to the office)\r\n- Constant team building activities", "cons": "- Good local salary (in the middle-upper local range), but way too little compared to other offices, and even other local companies"}, {"review_title": "valley startup prepping for exit", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "loads of free stuff, very excitable environment, very talented crowd", "cons": "massive age gaps between operations and management, all processes aimed at exit, negligence of quality outside of US, unsustainable people management, unequal compensation and benefits, technocratic management, massive turnover, huge losses of culture and talent over last 24 months"}, {"review_title": "NOT a sales culture", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "25 Nov 2015", "job_title": "Senior Account Executive in San Francisco, CA", "duration": "N/A", "pros": "Great office, location and benefits.", "cons": "This is not a place for a direct sale rep.  This company is engineering driven and they don't understand the value of sales outside of Account Management for month to month and/or existing customers."}, {"review_title": "Great place to work... company vision is something you can really buy into", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "30 Jun 2014", "job_title": "Anonymous Employee in San Francisco, CA", "duration": "N/A", "pros": "Normal San Francisco Startup feeling.  People are great and work life is decent (not a 9-5 shop, but not a 15 hour day shop either).  Benefits are pretty standard for SF.", "cons": "No real cons - the reporting structure is pretty flat, and most everyone is pretty approachable.  It is a pretty development centric company, so depending on what you do, could be seen as either."}, {"review_title": "Great place for people who want to get things done", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "28 May 2015", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Employees are dedicated, talented people. Very high caliber team. If you are driven and want to grow the company and your own skills, you have ample opportunity to do so here.", "cons": "Because Twilio ships products and features frequently, it's easy to lose sight of the big picture if you aren't organized enough to manage your time very efficiently."}], [{"review_title": "Twilio", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "9 Sept 2015", "job_title": "Anonymous", "duration": "N/A", "pros": "Twilio is a company with many talented individuals who generally act as a family. That is what makes the company special. The people. They are nice, they are helpful and they always strive to be better.", "cons": "The general company benefits need a serious upgrade. Not as many \"perks\" as other start-ups. The company is growing so rapidly that it is losing the start up family feel."}, {"review_title": "Excellent culture", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "1 Feb 2019", "job_title": "Senior Software Engineer II in Temecula, CA", "duration": "N/A", "pros": "Twilio has an excellent culture, and is inclusive of everybody. Twilio's values are strongly adhered to throughout the company. As we expand globally, our remote presence is growing and our remote culture is booming. As leaders in communications software, we're figuring out how to do something that's never been done every day.", "cons": "My only gripe in the past was the limited 401k matching, but this has changed recently and is now very reasonable!"}, {"review_title": "Strong Future that you feel a part of.", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "16 Apr 2020", "job_title": "Customer Success Manager in London, England", "duration": "N/A", "pros": "They make their company and team goals super clear\r\nThey make you feel a part of the company and not just a number\r\nThey have fantastic products you can really get behind\r\nThey make you feel appreciated from the day one and throughout\r\nThey're transparent \r\nThey know what needs working on and actively work on it, without ignoring flaws", "cons": "So far, I havent come across any."}, {"review_title": "Professional Growth Opportunities and Happy People Abound!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "29 Jul 2013", "job_title": "Product Manager in San Francisco, CA", "duration": "N/A", "pros": "I've been given more opportunities to take on responsibility here than any job in the past.  When you deliver here, it is recognized and rewarded.  I am very proud to be a member of this amazing team of achievers and I'm excited to come into to work here each day.", "cons": "High growth can sometimes lead to growing pains.  Sometimes we can be a bit inefficient as we're figuring out responsibilities and onboarding new employees."}, {"review_title": "Working at Twilio means working with smart people to solve interesting problems for smart customers and developers", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "7 Feb 2015", "job_title": "Product in San Francisco, CA", "duration": "N/A", "pros": "Hiring has kept up with Twilio's hypergrowth, talent has continued to increase. \r\nOpenness and constant reassertion of the mission on a weekly basis, engagement with CEO Jeff Lawson and cross-team updates. \r\nStill small enough to offer individuals agility and autonomy in problem solving \"Draw the Owl\".", "cons": "Hyper-growth and rapid change has some disadvantages. \r\nWorking to identify company's post-start up identity and priorities."}, {"review_title": "Great company for the long term", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "7 Feb 2019", "job_title": "Sales Executive", "duration": "N/A", "pros": "Experienced leadership team that operates with integrity and sets a bold vision\r\nFun, inclusive culture \r\nIncredible financial results and growth trajectory\r\n\r\nI’ve had a great experience and grown so much by working here.  Management provides great opportunities for mobility, compensation and learning!", "cons": "Growing like crazy so there are challenges as we scale. Continue to do the right thing for employees versus being too stuck in the process."}, {"review_title": "Invigorating!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "21 Apr 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "The culture is bar none and the twilio values permeate through all departments.  CEO leads by example. \n\nThe company is growing quickly so there is a ton of opportunity, especially with the solid product base", "cons": "Depends on your perspective.  There are Growing pains with any company in high growth. I think it’s an opportunity to make an impact"}, {"review_title": "Lackluster Management", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "25 Sept 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "None that I can think of - would not recommend Twilio.", "cons": "The management lacks public company experience and is not able to scale the company as needed to ensure further growth. Executives and management do not take ownership of anything which leads to a very reactionary response versus being proactive and being set up to succeed."}, {"review_title": "Amazing Company!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "11 Oct 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "By far, the best company I've worked for.  Great culture that doesn't feel contrived or forced. A lot of smart people who are passionate about their work. You can tell that everyone is committed to making the company successful.", "cons": "Growing pains similar to that of any company scaling this fast. Lack of systems to support growth which leads to manual processes and duplicative work. Leadership is working to solve that problem."}, {"review_title": "Awesome company", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "19 Dec 2018", "job_title": "Architect in San Francisco, CA", "duration": "N/A", "pros": "This is just an awesome company. Great leaders, great products and friendly colleagues. The company is in a hyper growth time and the management knows where to put their efforts. Twilio has awesome benefits, great atmosphere and challenging problems to solve. Come join us!!", "cons": "Absolutely no cons. This is probably one company in Bay area that has got it right."}], [{"review_title": "Smart, Collaborative Environment", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "20 Mar 2018", "job_title": "Sales in San Francisco, CA", "duration": "N/A", "pros": "In my experience Twilio is a fantastic place to work. The environment is very collaborative and management is pretty accessible.  The values actually mean something here and the team works hard to do right both for customers and employees. Growth potential is massive, both for the company and for individuals.", "cons": "Lots of growth comes with some growing pains."}, {"review_title": "Commercial Account Executive", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "1 Jul 2018", "job_title": "Commercial Account Executive in Sydney", "duration": "N/A", "pros": "Great Leadership\r\nMore than just colleagues\r\nCollaborative and Creative environment \"We can't wait to see what you build!\"\r\nStrong Company Values\r\nHigh Remuneration \r\nThe sky is the limit!", "cons": "Growing like a weed, thus very fast paced environment. So, if you aren't flexible to adopt change quickly, that would be a challenge for in Twilio."}, {"review_title": "Strong Culture with Lots of Opportunity", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "13 Jan 2020", "job_title": "Solutions Engineer in San Francisco, CA", "duration": "N/A", "pros": "People really genuinely care about your onboarding here, they want you to be successful. There's a lot of push to hire the right people and a lot of investment in making sure you're successful.", "cons": "Twilio is moving really fast and a lot of the policies / process is being built while the rocketship is in the air."}, {"review_title": "Modern company with benefits of big corporation but soul of a startup", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "26 Sept 2018", "job_title": "Technical Lead in Tallinn", "duration": "N/A", "pros": "- People are focused of achieving real goals, not increasing KPIs or looking good in reviews\r\n- Friendly, highly professional and warm work environment\r\n- Evolving internal tools, processes and flows", "cons": "- With audits, GDPRs and overall growth formalities are being introduced. For now ordinary engineers are mostly being shielded by managers though."}, {"review_title": "Twilio Employee", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "7 Jun 2017", "job_title": "Anonymous Employee in San Francisco, CA", "duration": "N/A", "pros": "Twilio really cares about their customers, the community, the environment and their employees.  I have never worked for a company that is so involved in community events.", "cons": "the only con for me is the location because it's a long commute, but I'm getting used to it."}, {"review_title": "Fantastic company - once in a career opportunity to grow", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "15 May 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great company - truly values diversity and autonomy at every level of the business.  Supports employees through ongoing education, employee resource groups, volunteer opportunities, etc.", "cons": "Still ironing out some growing pains due to the rapid, post-IPO growth they've endured."}, {"review_title": "Great company culture, high learning potential", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "31 Jul 2019", "job_title": "Senior Marketing Manager in Munich, Bavaria", "duration": "N/A", "pros": "People - everyone is smart, active, well educated and happy to share their knowledge\r\nProduct - very strong offer for an array of customers across all industries, excellent development potential for future growth\r\nProcess - being a developer led company, everything we do is based on experience and best practices", "cons": "Workload - can vary, depending on projects and if you give, the company will take."}, {"review_title": "Great place to learn and grow your career", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "28 Oct 2015", "job_title": " in San Francisco, CA", "duration": "N/A", "pros": "We have an extremely supportive team! We are encouraged to find projects that we are passionate about and own them.", "cons": "We have a very talented team so the expectations are set pretty high which can lead to stressful times."}, {"review_title": "Awesome Company to work for", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Tons of growth, very smart peers, interesting problems to work on. Great compensation.", "cons": "Lunches are only 2-3 days a week, and dinner is only once a week. Other than that the only downside is the 401K matching program is in its infancy and nothing substantial"}, {"review_title": "Awesome company", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "21 Mar 2019", "job_title": "Operations Manager in Tallinn", "duration": "N/A", "pros": "One of the few companies in Tallinn where the company actually lives up to its culture.", "cons": "Growing pains of a fast growing company in a competitive environment. You can sometimes lose track of time and work too much."}], [{"review_title": "Sales", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "20 Oct 2016", "job_title": "Anonymous Employee in San Francisco, CA", "duration": "N/A", "pros": "Great product, great customers, limitless market opportunity.  Good people fun atmosphere", "cons": "Some senior management is experienced.  Market is still not defined and may not be for some time."}, {"review_title": "summer intern", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "27 Oct 2015", "job_title": "Software Engineer Intern", "duration": "N/A", "pros": "The engineering team was well organized and had managed to set up many best practices for their engineering. As an intern I was given valuable mentorship.", "cons": "Didn't have structure in place for getting up to speed with the tools being used. Tasks assigned sometimes didn't have much learning value and required lots of knowledge for the tool used."}, {"review_title": "Good company to grow up with", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "7 Oct 2016", "job_title": "G&A in San Francisco, CA", "duration": "N/A", "pros": "A lot of bright, motivated people who are supportive, and generally motivated to build a really good company.  Leadership (especially CEO) is very transparent about what's going on in the business. Twilio.org is doing some good charity work.", "cons": "Sometimes frugality wins over long term investments"}, {"review_title": "A Fast Growing Company That Will Change Everything", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "29 Jun 2018", "job_title": "Growth Marketing in San Francisco, CA", "duration": "N/A", "pros": "- Smart People\r\n- Fast Growth\r\n- Real Innovation\r\n- Great CEO, Management team", "cons": "- Pace of growth makes long-term strategies difficult, always venturing into new realms"}, {"review_title": "transformative cloud communications start up", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "11 Dec 2015", "job_title": "Anonymous Employee in San Francisco, CA", "duration": "N/A", "pros": "amazing engineering culture\r\nsmall, semi-autonomous teams\r\nfast iteration\r\nprogress over perfection", "cons": "somewhat typical growing pains experienced by fast growing start ups (nothing earth shattering nor systemically broken)"}, {"review_title": "Most amazing place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "18 Sept 2016", "job_title": "Lead Software Engineer in San Francisco, CA", "duration": "N/A", "pros": "- String engineering culture\r\n- Lot of opportunities for innovation\r\n- Engineers get a lot of autonomy", "cons": "- Growth opportunties are less.\r\n- Less perks when compared to other similar tech companies"}, {"review_title": "Facilities", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "27 Sept 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Twilio cares about its employees, great culture/perks, innovative and exciting", "cons": "Typical growing pains of a company whose scaling from small to big - things to still figure out but on the right path"}, {"review_title": "Disorganized", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "23 Feb 2020", "job_title": "Senior Engineering Manager in Denver, CO", "duration": "N/A", "pros": "Decent pay, and Mediocre benefits", "cons": "Poor leadership\nDisorganized\nPoor communication\nTerrible \"architecture\" team and planning - no strategy whatsoever"}, {"review_title": "Great company to work for!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "24 Apr 2019", "job_title": "Senior Talent Researcher in Austin, TX", "duration": "N/A", "pros": "Great company to work for! Great leadership team and the entire culture of the company is awesome.", "cons": "I don't have any. This company pays fair, promotes internal growth, has great managers and takes care of its employees."}, {"review_title": "Bureaucractic , non-technical managers need to be weeded out.", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "8 Apr 2020", "job_title": "Principal Software Engineer in San Francisco, CA", "duration": "N/A", "pros": "Mostly a kind, caring company. Management tries to do things right.", "cons": "Smart, thoughtful ideas are sometimes shut down. Managers do show favoritism."}], [{"review_title": "Senior Manager", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "17 Apr 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "The vision and strategy of the CEO is innovative and a learning culture.  The entire company is onboard to achieve the same goal.", "cons": "As the company grows,  continual focus on the fundamentals will be important."}, {"review_title": "Senior Technical Support Engineer", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "23 Oct 2017", "job_title": "Senior Technical Support Engineer in Herndon, VA", "duration": "N/A", "pros": "Company went public recently and a lot of new products being released and making life of both, developers and non-developers easy. Coming from a non-developer background, I learnt a lot of new technologies from Day 1.", "cons": "None I can think of."}, {"review_title": "A company that lives its values", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "1 Dec 2017", "job_title": "Senior Product Manager in San Francisco, CA", "duration": "N/A", "pros": "Twilio has clear, opinionated values that we really live by \r\nPeople are generally very sharp and hard working\r\nSmall teams gives everyone a lot of independence and ability to reach their own goals", "cons": "Small teams means that coordination of large products is very difficult"}, {"review_title": "Sales", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Great product, bright future, great pay, benefits, fun people.", "cons": "A lot of turnover and leadership changes in sales/marketing and I have some doubts as to the path that's being taken."}, {"review_title": "Not for Experienced professionals", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "27 Jun 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Good products but no strategy around growth.", "cons": "Too many overconfident people with less experience making decisions"}, {"review_title": "Great", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "19 Aug 2015", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great culture here at the office. Love the energy of the team and what the overall goal of the company. Couldn't think of a better place to be at!", "cons": "Some growing pains come along as the company expands out, but to me that's normal in any fast growing environment."}, {"review_title": "Kind, inclusive culture", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "20 Jul 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- Inclusive company culture\r\n- Lots of fun events\r\n- Thoughtful recruiting process that really stood out. You will never feel forgotten!\r\n- Great office!", "cons": "Truly nothing that I could think of :)"}, {"review_title": "Struggle for words", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "6 Dec 2018", "job_title": "Senior Software Engineer", "duration": "N/A", "pros": "A sales driven company that needs workers.", "cons": "Unfortunately, preaching openness and encouraging ownership but not actually living up to it.\r\n\r\nSelf organizes into a seniority or position based hierarchy. Management style can be patronizing and passive aggressive. \r\n\r\nNew employees and contractors share the burden of the work and responsibility."}, {"review_title": "Awesome.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "2 Sept 2015", "job_title": "Account Manager in San Francisco, CA", "duration": "N/A", "pros": "The best part of working at Twilio is that you're surrounded by very intelligent coworkers and they push you to continue learning on a daily basis.", "cons": "The downside of have a solid work life balance is that some of your colleagues take advantage of vacation policies."}, {"review_title": "Generally a good place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "12 Nov 2019", "job_title": "Technical Support Manager", "duration": "N/A", "pros": "The culture has been amazing and seems to be getting better!", "cons": "People are working so fast and so hard, they sometimes forget to slow down and document for the future."}], [{"review_title": "This is the best company", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "2 Apr 2020", "job_title": "Senior Product Security Engineer in Madrid", "duration": "N/A", "pros": "They care a lot about the worker, I have not seen anything similar before", "cons": "nothing so far, everything is great"}, {"review_title": "The Best Company I've Ever Worked for", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "- Great culture + values\r\n- Opportunity for growth \r\n- Company strongly believes in a good work/life balance", "cons": "- Fast paced growth takes away from awesome/ unique culture"}, {"review_title": "One of the best places to work in Tallinn", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "30 Apr 2018", "job_title": "Senior Software Engineer in Tallinn", "duration": "N/A", "pros": "Nice team, interesting projects to work on, I like working here in overall.", "cons": "I think company slowly becomes more corporate, but this didn't really spread to Tallinn office and projects yet."}, {"review_title": "Great company", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "13 Aug 2015", "job_title": "Finance in San Francisco, CA", "duration": "N/A", "pros": "Fun place to work with lots of energy.  Exciting environment with a focus on innovation.  Super smart people.  Great on-boarding process with lots of involvement from senior management.  Open communication.", "cons": "None that I can think of"}, {"review_title": "Great people, fun challenges, exciting to be a part of a rapidly growing company in technology", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "29 Jul 2013", "job_title": "Business Development Representative in San Francisco, CA", "duration": "N/A", "pros": "You are not limited by bureaucracy; if you have an idea that would improve your work, you are generally always encouraged to execute it", "cons": "Company is huge, slowly losing its startup feel"}, {"review_title": "Great place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "6 Feb 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great culture within the office I have a pleasure working at.\r\nGreat perks, and Benefits.\r\nGetting both Sameer (CEO of SendGrid) and Jeff CEO of Twilio around.", "cons": "Growing pains that naturally comes with any acquisition. \r\nLack of process and documentation"}, {"review_title": "This company is outstanding", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "24 Sept 2019", "job_title": "Sales", "duration": "N/A", "pros": "Work life balance is amazing, and each manager I've had has been extremely reasonable with expectations. Coworkers for the most part are great.\r\n\r\nBenefits are phenomenal", "cons": "There is nothing to say negative about the company right now"}, {"review_title": "Fun, Hardworking, Open", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "21 Oct 2018", "job_title": "Anonymous Employee in San Francisco, CA", "duration": "N/A", "pros": "Hard-working and smart people, they are nice, team oriented, and believe in the purpose of Twilio.", "cons": "Not enough infrastructure in place yet to keep up with growth, but that is changing."}, {"review_title": "Excited and motivated everyday", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "8 Mar 2019", "job_title": "Talent Acquisition in San Francisco, CA", "duration": "N/A", "pros": "Best job I've ever had.\r\nExplosive and demanding hiring goals.\r\nTeamwork makes the dream work.\r\nTransparency and growth \r\nWell resourced", "cons": "Explosive growth is leading long hours for the TA team."}, {"review_title": "Technical Support Engineer", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "15 Aug 2017", "job_title": "Technical Support Engineer in San Francisco, CA", "duration": "N/A", "pros": "Twilio is family! At Twilio, you are not just a number or a body, you are a person with actual feelings and opinions and every single person matters.", "cons": "Literally no cons at all!"}], [{"review_title": "Actually disruptive", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "4 Apr 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "CEO with a clear vision for companies strengths/selling points and target audience\r\nGreat culture/people", "cons": "Product and sales do not work very well together\r\nLack of forecasting/predictability on sales side"}, {"review_title": "Healthy and rewarding culture for software engineers", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "17 Jul 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "engineering culture, corporate values, experimentation", "cons": "constantly evolving / changing ways to document and discuss priorities"}, {"review_title": "Love Twilio!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "19 Apr 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great people\r\nGreat benefits, PTO policy\r\nGreat values", "cons": "Company is experiencing a growth spurt, so the usual lack of processes can cause some frustration but also get the opportunity to establish these processes."}, {"review_title": "Lean start-up, google-like culture. Great place to work.", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "7 Feb 2013", "job_title": "Senior QA Engineer in San Francisco, CA", "duration": "N/A", "pros": "Lean start-up culture. Everyone's approachable. Great place if you love to work in start-up environments & do your own innovation.", "cons": "Nothing yet. May be after staying for some more months."}, {"review_title": "Great company", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "29 Aug 2019", "job_title": "Account Executive", "duration": "N/A", "pros": "great products, culture, benefits, career track, stock, rapid growth means tons of opportunity, servant leadership, great CEOs, like my colleagues", "cons": "growing pains, but you want to be at a growing company, not a shrinking one"}, {"review_title": "Fabulous place to work!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "12 Nov 2019", "job_title": "Anonymous Employee in Dublin, Dublin", "duration": "N/A", "pros": "Work from home\r\nTravel (All expensed)\r\nPersonal Laptop (MAC pro)\r\nBenefits - healthcare,pension,phone,gym\r\nFree lunches \r\nFree snacks/drinks (Alcohol too)\r\nGreat people", "cons": "Literally can't think of one"}, {"review_title": "It's ok to work", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "28 Jan 2016", "job_title": "Anonymous Employee in Tallinn", "duration": "N/A", "pros": "Nice benefits, good work/life balance", "cons": "Small company, so you don't have much career opportunities, tasks diversity, etc. For such small division as tallinn office the environment is surprisingly conservative."}, {"review_title": "It's a great place to work", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "11 Dec 2017", "job_title": "Software Engineer in San Francisco, CA", "duration": "N/A", "pros": "Good overall culture working here.", "cons": "Sometimes there is a disconnect between managers and workers"}, {"review_title": "Very satisfied with Twilio", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "10 Oct 2018", "job_title": "Onsite Tech Lead in Tallinn", "duration": "N/A", "pros": "Strong culture, Twilio values, Twilio Leadership principles, global, growing and inspiring company, impressive future perspective, Benefits, Diversity", "cons": "Communication throughout Europe, sometimes difficult multicultural aspects, growing quite fast"}, {"review_title": "Nerd heaven- Sales Hell", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "2 May 2020", "job_title": "Account Executive", "duration": "N/A", "pros": "great office location and setup", "cons": "Will be a Dev company forever. Sales is an alien species. 70% ex Salesforce people, Micromanagement to the most excessive point. Hard and complex to sell unless your customer has developers . Channel is being built but ways too late..."}], [{"review_title": "Good growing company", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "19 Jul 2019", "job_title": "Senior Physical Security Manager", "duration": "N/A", "pros": "Great leadership and the pay is nice.", "cons": "No work-life balance, you will just work all the time."}, {"review_title": "Dynamic, innovative place for doers", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Truly agile environment, intense focus on getting things done, high tolerance for mistakes", "cons": "Plenty of duplicate effort: some is unavoidable in Twilio's small team model"}, {"review_title": "Good opportunity to grow", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "20 Nov 2017", "job_title": "Recruiter in San Francisco, CA", "duration": "N/A", "pros": "Revenue Growth and Hiring \r\nTalented team and Clear Management Direction\r\nDisruptive technology and leader in the industry\r\nGood work-life balance and culture\r\nGenuine and Nice People", "cons": "Growing Competition\r\nManaging Wall Street Expectations"}, {"review_title": "Good place to build a career!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "31 Mar 2020", "job_title": "BDR in Atlanta, GA", "duration": "N/A", "pros": "Awesome career paths available if you show interest.", "cons": "No cons for me, great place to work!"}, {"review_title": "engineer", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "corporate office is in the city", "cons": "overworked, underpaid, the team there is difficult to work with"}, {"review_title": "Rock-solid product, Strong Leadership", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "16 Apr 2020", "job_title": "Commercial Account Executive in San Francisco, CA", "duration": "N/A", "pros": "Best in class product, fingers in many pies and each pie is growing", "cons": "Growing to a larger company, shifting to a more corporate structure"}, {"review_title": "Total Rewards", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "22 Aug 2019", "job_title": "Total Rewards in Dublin, Dublin", "duration": "N/A", "pros": "Great atmosphere and constant new opportunities", "cons": "Any cons, I would say the company is still learning so is just matter of time to improve internal processes"}, {"review_title": "Best company that I've worked for thus far.", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "21 Apr 2020", "job_title": "Anonymous Employee in New York, NY", "duration": "N/A", "pros": "The support and culture is amazing!", "cons": "As of yet none."}, {"review_title": "So-So", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "11 Nov 2019", "job_title": "Finance Director in San Francisco, CA", "duration": "N/A", "pros": "Cool Culture and genuinely nice colleagues", "cons": "Chaotic environment with little objectivity"}, {"review_title": "Incredible first job", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "27 Jan 2020", "job_title": "Associate Support Engineer in Denver, CO", "duration": "N/A", "pros": "Great office culture, immense flexibility, awesome benefits", "cons": "Lower comparable salaries than most tech companies"}], [{"review_title": "Great place to work.", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "10 Mar 2015", "job_title": "Software Engineer in San Francisco, CA", "duration": "N/A", "pros": "People, culture of openness and the opportunity to solve real problems.", "cons": "Flexibility in moving across teams."}, {"review_title": "Manager", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "22 Feb 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "The employees are passionate about the products. We value diversity and give flexibility to employees", "cons": "Company directions and priorities are always  changing which could be frustrating"}, {"review_title": "Best company ever", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "14 Aug 2018", "job_title": "Senior Software Engineer in Bogotá, Bogota", "duration": "N/A", "pros": "- It's a SV startup located in Colombia, meaning we have best of two countries.", "cons": "They do not offer remote positions in Colombia"}, {"review_title": "Amazing Company To Work For", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "31 Jan 2020", "job_title": "Partner in New York, NY", "duration": "N/A", "pros": "Great management team\r\nInnovative products\r\nCompetitive pay", "cons": "Fast growing so back-office is having a tough time catching up."}, {"review_title": "Great company", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "24 Oct 2017", "job_title": "Senior Software Engineer in San Francisco, CA", "duration": "N/A", "pros": "Great, inclusive culture. Lots of fun team events. Direct management cares deeply about our team's personal success.", "cons": "Lack of accountability for poor performers."}, {"review_title": "Culture is everything!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "23 Oct 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Enthusiasm and follow-up is the biggest difference maker. Twilions truly care!!", "cons": "Sometimes too focused on feature function instead of business impact"}, {"review_title": "CX operations manager", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "13 Dec 2017", "job_title": "Cx Operations Manager in San Francisco, CA", "duration": "N/A", "pros": "Company has great values. Sales org led by a strong, reputable leader", "cons": "Go to market focus taking away focus on product"}, {"review_title": "Exciting technology up & comer", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "7 Jan 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Unique company with high growth potential", "cons": "Growing pains that come with rapid expansion"}, {"review_title": "Great Job!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "23 Apr 2019", "job_title": "Talent Acquisition in San Francisco, CA", "duration": "N/A", "pros": "Love it here! Smart people, an teams, flexible working hours and managers, great company values and culture!", "cons": "Nothing bad to say!"}, {"review_title": "Descent", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "12 Feb 2020", "job_title": "Senior Software Engineer", "duration": "N/A", "pros": "Work/life balance, good tech stack", "cons": "Trying to be the next Salesforce"}], [{"review_title": "Best place ever!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "16 Nov 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "-Great management\r\n-Doing cool stuff\r\n-Taking care of employees' goals and career path", "cons": "-Medical coverage could be better"}, {"review_title": "Customer Account Executive", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "21 Sept 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great onboarding experience. Good benefits. Good comp. Great culture.", "cons": "Still figuring things out, so constant change; and minimal processes."}, {"review_title": "So many other places to consider....", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "19 Jan 2020", "job_title": "Marketing", "duration": "N/A", "pros": "There are so many opportunities for great talent in the Bay Area and beyond.  Work somewhere incredible .", "cons": "Not a place deserving of great talent.  Do your research and go elsewhere."}, {"review_title": "Recruiting", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "30 Aug 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Open and transparent communication and enthusiastic, 'one team' attitude and drive to succeed", "cons": "none apparent to me that need highlighting"}, {"review_title": "Fast growing company with great culture", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "17 Oct 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "A tremendous amount of ownership  \r\nDraw the owl", "cons": "not that I can think of"}, {"review_title": "Black women beware", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "10 Dec 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Some great people here. Not the worst place you could work I guess.", "cons": "I would not recommend Twilio to black women."}, {"review_title": "Operations", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Awesome company with great, passionate and brilliant people.", "cons": "Need a larger office space?"}, {"review_title": "Engineer", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "-the best colleagues\n-amazing culture \n-exciting environment \n-fantastic product \n-career growth and development", "cons": "None that I can think of"}, {"review_title": "Great company", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "13 Aug 2019", "job_title": "Attorney in South San Francisco, CA", "duration": "N/A", "pros": "Such a great company to work for.", "cons": "None. Truly a great company."}, {"review_title": "Amazing company to work for!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "6 Dec 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Inclusion & Diversity program is flawless.", "cons": "There really aren't very many."}], [{"review_title": "Smoke and Mirrors", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "2 Apr 2019", "job_title": "Sales Representative in New York, NY", "duration": "N/A", "pros": "Flexible work locations and decent salaries", "cons": "Products not very stable and support for Customers was very poor."}, {"review_title": "Good", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "30 Aug 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "It's a good company to work for", "cons": "They are growing a little too fast"}, {"review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "5 Mar 2019", "job_title": "Senior Technical Support Engineer", "duration": "N/A", "pros": "Not one bad thing to say", "cons": "Working remote can be tough"}, {"review_title": "Best Company", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "18 May 2020", "job_title": "Product Operations Analyst", "duration": "N/A", "pros": "Benefits\r\nUnlimited PTO\r\nFamily oriented \r\nGreat Culture", "cons": "Got nothing bad to say!"}, {"review_title": "Nice place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Tons of perks and benefits", "cons": "No career growth, nor opportunities abroad."}, {"review_title": "Supportive but demanding", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "12 Jun 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Good profit sharing, company culture, innovation", "cons": "Demanding, long hours, high expectations"}, {"review_title": "Join Twilio!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "16 Oct 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "High Energy, Innovative, Very Smart", "cons": "Higher degrees of messy and/or ambiguous"}, {"review_title": "Good to work", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "29 Apr 2019", "job_title": "Anonymous Employee in San Francisco, CA", "duration": "N/A", "pros": "good tech good benefits good people", "cons": "nothing to  add, good food"}, {"review_title": "N/A", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "21 Jan 2019", "job_title": "Intern in San Francisco, CA", "duration": "N/A", "pros": "Good place to work at.", "cons": "It really gets boring sometimes."}, {"review_title": "Good product but terrible culture", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "6 Jun 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "really great product, smart executive team", "cons": "too much stress, no reliable source to give real feedback, no growth for employees"}], [{"review_title": "Great", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "People, ambition, perks, vision, dedication", "cons": "Growing pains with distributed teams."}, {"review_title": "startup", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "7 Mar 2016", "job_title": " in San Francisco, CA", "duration": "N/A", "pros": "upbeat climate, great technology, great people, great business", "cons": "ceo-centric, cliques, weak hr, cultural growing pains, politics wins"}]]