[[{"review_title": "Hands-down, the best Open Source company on the planet", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "28 Dec 2017", "job_title": "Success Manager", "duration": "N/A", "pros": "Great work environment. Collaborative, open, receptive, flexible. Great benefits. Competitive technology.", "cons": "In some roles, you might find lack of mobility. In some roles, salary isn't as competitive as it should be. YOU own your future at Red Hat. If you don't take the bull by the horns and make your role into what you need/want, then you will stay where you're at."}, {"review_title": "Solution Architecture", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "19 Sept 2018", "job_title": "Anonymous Employee in Raleigh, NC", "duration": "N/A", "pros": "Flexibility with schedule and work:life balance.", "cons": "Increasingly shrinking market; open source is not a 'thing' any longer and has been largely adopted by enterprises. No industry or business differentiation value-add on top of product offerings limits value prop for customers. Very limited solution-oriented focus within sales motion. With many public cloud options privately owned and managed infrastructure is increasingly decreasing in need."}, {"review_title": "An inspiring place to work while contributing to the common good", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "6 Aug 2014", "job_title": "Senior Software Engineer", "duration": "N/A", "pros": "Red Hat has a winning business model that is built on open source software so you'll get to contribute to the community and the company at the same time.  This growing company has employees around the world (including lots of remote folks).  Rewards and opportunity are ripe for those willing to work hard.", "cons": "Just like any company at this stage of growth, Red Hat is experiencing some growing pains.  Fortunately, the open culture places decision making in the open and employees are encouraged to weigh in on important issues."}, {"review_title": "storage", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "4 Jul 2015", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Good culture, great folks in RHEL, KVM etc.", "cons": "Storage BU sucks. Clueless management without good storage background  that always goes overboard with open source culture. 2-4 year experienced developers hold company ransom to their demands. Abuse of real redhat culture by some developers who only want more money, goodies and travel....and don't like to be questioned on deliverables. If you want free money join red hat storage especially Bangalore..."}, {"review_title": "Politics and Politics in GBD Pune team", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "13 Oct 2017", "job_title": "Consultant in Pune", "duration": "N/A", "pros": "Product base company so future is predictable.\r\nWork is good.", "cons": "Too much politics by the people who are here since 5-10 years. They don't accept new comer and do not support him in terms of Knowledge transfer, process.\r\n\r\nThey won't even tell you process on which they have worked/coded. \r\nToo much Gossips.\r\nButtering to OLDER guys can help you survive in GBD Pune."}, {"review_title": "A great place to work!!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "24 Aug 2018", "job_title": "Senior Systems Administrator in Raleigh, NC", "duration": "N/A", "pros": "The company really does a great job using meritocracy.  They are very open about decisions being made, and when they forget the employees remind them loud and clear.  I even witnessed the CEO apologize when it was called out that they should have been more transparent about a change that most were happy about.  You don't see that often anywhere else I have worked.", "cons": "A lot of opinions and ways to voice them sometimes make it noisy about really minor things.  Salary adjustments/raises are not clearly planned and seem to be an after thought."}, {"review_title": "Great company, great leadership, demanding work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "26 Nov 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "I've worked at Red Hat for well over a decade in a large variety of roles with the Customer Experience and Engagement organization and Customer Content Services team. Red Hat is lucky to have a highly engaged and approachable senior leadership team that takes care to  explain strategy and get buy in from across the company. In general, I find working at Red Hat to be exciting, challenging and rewarding.", "cons": "The open culture we are famous for has downsides. It takes a lot of work and patience to listen to and engage with so many opinions, especially when we have aggressive and tight deadlines."}, {"review_title": "Very very busy", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "20 Sept 2012", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Engineers are very bright and very dedicated.  Really fun to work with them.  Sales and Marketing are above average.  Administrative staff are fine.", "cons": "A lot of work.  Product lines are expanding and people are not being hired fast enough.  While Red Hat has become a big company but internal processes and procedures are more geared to a small company.  It is nice for a large company to try to be nimble and agile like a small company but it is not possible."}, {"review_title": "Big words about community, free, and open, but it's all about money - always one more cent.", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "27 Jun 2014", "job_title": "Sales in Munich, Bavaria", "duration": "N/A", "pros": "Good pay, interesting technology, lots of clients everywhere - users just don't know it.\r\nThey say they are open, encourage suggestions and change...", "cons": "But they're not. It's an old company, most managers have been around some time and don't want change.\r\nExtremly focused on short term cash. No real local precense, only sales offices. They cannot even sign an employee contract in country. The play a lot of games to avoid legal precense in countries, to avoid taxes."}, {"review_title": "Great perks/office environment, poor management and morale in HR", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "7 Jul 2015", "job_title": "Human Resources in Raleigh, NC", "duration": "N/A", "pros": "Fun/upbeat office environments, company events, encouragement for employees to collaborate and grow.", "cons": "Work/life balance. Expectation to be \"on call\" 24/7, but not paid accordingly. When employees leave, management talks poorly of them. \"Open\" culture is praised, but only if you agree with upper management and \"drink the Kool-Aid.\" Turnover is high, and they blame it on \"not being a good culture fit.\""}], [{"review_title": "Mixed bag at Red Hat Israel", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "15 Aug 2016", "job_title": "QA Engineer in Ra`ananna", "duration": "N/A", "pros": "Red Hat is a proven leader in the Open Source community, it attracts a lot of bright people from the Linux realm. There are some extremely talented people at Red Hat, and they will gladly share their knowledge with you. Certification courses and other training courses are readily available to all employees", "cons": "Red Hat  encourages hiring based on \"friend brings a friend\" policy. This works for the most part but when managers bring in friends that do a poor job, this creates issues for the other employees"}, {"review_title": "Great employer & a good office culture", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "15 Aug 2018", "job_title": "Principal Software Engineer in Waterford", "duration": "N/A", "pros": "Plenty of career opportunities besides the predominant mobile dating back to the FeedHenry acquisition.\r\nGreat benefits package, salary, bonus, stock options.\r\nA lot of great people that are always up for a chat.", "cons": "The Red Hat culture definitely has its own flavour in this office compared to working remote or in other offices. Probably a throwback to the startup days and senior leadership. It's certainly improving.\r\nNeeds some more food places nearby, and a pedestrian crossing."}, {"review_title": "Sounds Great Until You Meet Your Egomaniac Co-workers", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "24 Mar 2011", "job_title": "User Experience in Westford, MA", "duration": "N/A", "pros": "Probably the most outstanding positive I can say about Red Hat is its commitment to Open Source technologies.  Many of the people that work here and are happy working here succeed because they believe passionately in the idea of Open Source.  Even though the company makes its profit from community-developed software, it adds many resources to that development and actively works with the community to create a meritocracy of ideas.\r\n\r\nIt is also a place where you'll find some of the best minds in the business.  Great engineers work here and you are in great company when developing products and planning releases.\r\n\r\nRed Hat is an international company that really does its best to let that personality flavor operations.  Currently there are more associates employed outside the US than in the US.  This means there is a great deal of work on an international scale, which can be engaging and exciting.", "cons": "Because Red Hat hires some of the best minds in engineering, the atmosphere is one of the most egotistical and entitled in the business.  The tone is one of having too many chefs in the kitchen.  Projects can take ages to move along because there are too many experts.  Personalities are constantly in battle.  People openly judge each other based on ridiculous standard such as what OS's they prefer or what hardware they use. \r\n\r\nThe company spent many years as an engineer-only workforce, so much of the interfaces that have been designed for the 'public' are antiquated, outdated and (frankly) embarrassing.  While the company is trying very hard to engage the Enterprise-leaning public with their technology, opinions from non-engineers are sometimes sneered at, misunderstood, or not taken seriously.  This is exemplified in the fact that software developers have been hired for lead management positions in the Usability side of Red Hat. \r\n\r\nThe on-boarding and entry process is very confusing.  There is very little of the technical and HR support that one is usually used to when starting at a company.  You're left on your own when you start, and if you have a busy manager, you're even more in the dark.  It takes a solid 2-3 months to get the basic gist of what's going on at Red Hat, and by that time you're expected to know every product inside and out.\r\n\r\nWhen basic concepts about products and services are discussed, there are multiple contradictory answers provided from every realm of the company.  It gives the associate the sense that no one is really at the helm of the ship.\r\n\r\nSenior management really does do well to be vocal and to be available to people in the company.  The open source 'way' more or less demands that there is open communication.  However, when it comes to individual managers, it's anybody's guess what you'll get stuck with.  There is little 'management of the mangers' so you can end up in a dictator's ivory tower with hardly any support to help you feel supported."}, {"review_title": "General", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "23 Jul 2015", "job_title": "Sales in Bangalore", "duration": "N/A", "pros": "Good work culture, friendly team and good compensation. This is a perfect place to learn and build career on team management and how to collaborate. Provided, you are lucky enough to be working with a focused and disciplined leader or team lead or Manager.", "cons": "Management keeps changing, global team not focused on employee support and what is missing that can make ones life easier and help company grow in a particular geography. Once people climb the ladder they tend to forget good deeds and team efforts that existed ."}, {"review_title": "Avoid consulting", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "16 Aug 2015", "job_title": "Associate Consultant in Tysons Corner, VA", "duration": "N/A", "pros": "- There is a lot to learn and some of the senior consultants will do their best to take you under their wing and teach you everything they know.\r\n- There is a lot of room to grow here professionally. If you are constantly on short stent projects you will learn a lot in a very short time, much more than other jobs\r\n- Travel can be a plus, especially in the short term.", "cons": "- Salary is below market and expect to be making what you started with until you leave. If they like you they will give you stock every 6 months but it is only to try and retain you as it vests a little every year.\r\n- They seem to be a lot more focused on people who are good at BSing to clients than those who are excellent coders and get work done. There is a lot of favoritism toward the first half so the doers tend to get screwed over and treated like crap while the others get promoted straight up the chain.\r\n- Work-life balance is extremely poor, especially if you are traveling. You should expect to live out of a suit case for most of the time you work here and expect to be putting in long hours all the time as Red Hat tends to take on very demanding clients.\r\n- It is very easy to get lost in the system. I ended up on a project where the client kept extending my contract and because of that my managers seemed to forget about me. I no longer had my yearly review, salary discussions, etc. It was also impossible to get off of the project because it was bringing in too much revenue despite the fact I wasn't learning anything and was completely bored.\r\n- Getting promoted is next to impossible unless you are a favorite"}, {"review_title": "Great place to work overall but some true cons as well.", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "17 Nov 2016", "job_title": "Senior Marketing Manager in Raleigh, NC", "duration": "N/A", "pros": "The people and the culture.", "cons": "Managers get little direction from the VPs and CLT and it impacts everyone negatively.\r\nNew CFO has brought about changes (like outsourcing to India) that are most unwelcomed"}, {"review_title": "What they say is true", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "15 Jul 2019", "job_title": "Consultant in North Sydney", "duration": "N/A", "pros": "The best company i have worked for. The open culture that everybody was talking about is real.  Great colleagues, great products, transparency, good training opportunities, clearly defined career path with many different variations tailored to you, stock options, travel, you can transfer to any other office anywhere in the world.\r\n+ Red Hat Rewards program\r\n+ Free breakfasts\r\n+ Red Hat Week\r\n+ The best CEO in the world", "cons": "I cannot say anything bad about Red Hat, except for maybe middle management seems disorganised sometimes and our office is too \"sales\" for my liking."}, {"review_title": "Company needs to mature", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "4 Aug 2016", "job_title": "Senior Channel Manager in Raleigh, NC", "duration": "N/A", "pros": "Good benefits, reasonable compensation, good products.   Free food.  Fun company events.  Good brand.  CEO is great.  Good acquisitions, especially Ansible and 3 Scale.", "cons": "Channel leadership is a mess.  Product leadership has a not invented here mentality.  Not a real enterprise software company. Leadership is clubby and parochial.  HR is a mess.  Stock appreciation doesn't keep pace with market peers."}, {"review_title": "I get to do what I love to do", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "28 Dec 2013", "job_title": "Principal Software Engineer", "duration": "N/A", "pros": "I work remote. They care more about results than hours worked. I get to work with the open source community. The managers have a high respect for their engineers. Everyone I work with is a team player, there's no dead weight. It's hard to write 20 words about the\"cons\" of working here ;-)", "cons": "They really want you to share hotel rooms when you travel. You have to give weekly status reports. You have to take ethics training once a year (via online)."}, {"review_title": "Awesome company to work ! Good opportunity to grow for beginners and mid-senior level !", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "8 Feb 2015", "job_title": "Technical Support Engineer in Pune", "duration": "N/A", "pros": "- Freedom in the work place\r\n- Great Opensource culture\r\n- Amazing people around the globe\r\n- Easy to reach any one with in the organization", "cons": "- Basic pay structure is very very low and not up to market standard. Need improvement to retain good people for long term growth of the company."}], [{"review_title": "Growth opportunities for software engineer", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "22 Mar 2017", "job_title": "Software Engineer in Bangalore", "duration": "N/A", "pros": "(1) Was mentored well by senior engineers. Good collaboration\r\n(2) Software decisions are documented - often asked for inputs and feedback\r\n(3) Recent projects like Ansible etc make it a very exciting growth opportunity\r\n(4) Regular technology sessions and meetups on Red Hat technologies and OpenStack\r\n(5) Good team meetings", "cons": "(1) Salary cycle and increases are unpredictable\r\n(2) Too much information is available and making sense is almost impossible\r\n(3) Would like to have more frequent discussions with HR and team\r\n(4) Site provides not enough facilities in terms of relaxation\r\n(5) Senior developers play favorites - that is known to everyone but no one says anything"}, {"review_title": "Great!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "First of all, it's great to work in open source. Besides that, dev employees usually work remotely, which gives them much freedom. For sure you need discipline, but being allowed to work when and where you want effectively improves productivity (for the company) and satisfaction (of the employee).", "cons": "If you work remotely, you need to get used to the way of effectively synchronizing with colleagues, meetings on the phone / hangout / skype. You might end up having your manager in a different timezone and meet him/her in person after years, etc."}, {"review_title": "Not All Good.....", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "6 May 2016", "job_title": "Anonymous Employee in Westford, MA", "duration": "N/A", "pros": "Food, resume fodder, nice computers, good benefits, flexibility, work life balance", "cons": "Developers are treated like gods, everyone else is a lackey. One of these god-like developers actually did my job very frequently, and no one could make him stop - not my manager, or his manager, or even the VP. I had to leave the company to find something else....evidently the sacred cow was too valuable to reign in...."}, {"review_title": "Software Engineer", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "7 Apr 2017", "job_title": "Anonymous Employee in Prague", "duration": "N/A", "pros": "Great culture, colleagues, management seems to genuinely care about employee workload and satisfaction. Very open minded and support personal development. Many training courses and certifications are offered for free.", "cons": "It's a large company so specifics heavily depend on the team/area of work. Sometimes it can seem like decisions are being made from the top, there is some lack of transparency/communication. Standard big company issues. I'd still say Red Hat has a largely positive culture, and there are more pros than cons."}, {"review_title": "Don't believe the hype", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "23 Jun 2018", "job_title": "Senior Consultant in Waterford", "duration": "N/A", "pros": "- great benefit package\r\n- regular opportunities for social activities", "cons": "- incompetent, old-fashioned management\r\n- lack of direction from leadership (no long-term strategy)\r\n- employees constantly need to be educated on how to use toilets in the proper manner (and not leave them in disgusting conditions)\r\n- lower than average salary\r\n- coworkers can't comprehend the concept of selective recycling"}, {"review_title": "Good, but low performing middle management in corporate functions not being addressed and dragging the company down", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Still a good place where you can make a difference to the world and to the company. Internal rules somewhat on the minimalist side, so there are empty spaces you can fill in with your initiative and invention.  A lot of very smart people, many people willing to go above and beyond and show the Red Hat culture at its best. Some excellent senior leaders, especially in PnT.", "cons": "Corporate functions in Red Hat do not keep up with the evolution of the company. Erratic decisions about internal tools and global vendors when IT, Finance, Ops and HR decide to change their tools in the same time without really making sure that there will be some kind of alignment and that the interactions between processes have been taken into account is worrying to say the least. I attribute that to the fact that the middle management in the corp functions is full of people who have been for a long time in the company and Red Hat's growth ascended them to senior manager levels or director+ levels - for which they are not apt in terms of competencies, leadership skills and ability to learn and understand the business and its needs. Because it is Red Hat, there is a very high tolerance for low performance in strategic thinking, planning and leadership - as long as you are the 'good olde sport/lady' with 'Red Hat in the hearth'. This increasing layer of incompetence is than reflected in situations when Red Hat's business is slowed down by non-performing internal processes, approval layers that exists only to justify existence of certain managers and by sales, services and engineering creating duplicit internal roles to substitute for the fact that the corporate support functions that should have been there to...eh...support...are not fulfilling their role and instead are running own agendas detached from where the business goes. It is needless to say that people in these middle management jobs seldom leave on their own - since they are not very likely to succeed outside of Red Hat.\nThis, together with increasing levels of empty corporate talks in these functions make it really difficult to be engaged when you work there."}, {"review_title": "Good place to work if you can handle pressure", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "2 Sept 2010", "job_title": "Technical Support Engineer in Pune", "duration": "N/A", "pros": "Techincal Support Engineer roles are part of the Red Hat Global Support Service. It is a support job and you are exposed to a lot of different tecnical issues which require in-depth analysis and an understanding of low level system working. \r\nThe first line of support of Red Hat GSS would be equivalent to L2 and sometimes L3 positions in other organizations when it comes to the candidates required technical abilities. There is a very good scope of learning - both technical as well as non-technical things like team work and customer service.\r\nGrowth options from this role is to move to Senior TSE after which depending on your abilities you could move to become a Software Maintenance Engineer if you have/developed coding skills or else you can become a Technical Account Manager (TAM). However, TAM oppurtunities are limited in India region.", "cons": "There is considerable work pressure due to the high load of support requests. At L1 level the pressure can be very daunting initially and requires personal efforts to tide over.\r\nTraining is an issue as management cannot afford to take support engineers off the line for long periods due to work load. However, training is imparted through lunnch 'N learn sessions which help and recently engineers and experts from foreign locations have provided 2-3 day workshops for advanced topics. Most learning still happens on the job.\r\nCareer stagnation is another issue, if one does not improve and move up the value chain. People who develop skills on the job can look forward to good career progress within the organization. Python scripting skill is highly appreciated other than C language. Coding ability is necessary to move from purely support role to engineering roles which is not easy for most people that are recruited for support profiles."}, {"review_title": "Good people, good technology, bad compensation.", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "16 May 2013", "job_title": "Sales Engineer in Mountain View, CA", "duration": "N/A", "pros": "The open source culture is very nice as is the technology.  Most everyone I worked with was good.  Training was available both in classes and on the intranet.  Remote work opportunities were good, with plenty of support provided for remote employees.", "cons": "As an SE my commission was very poorly done, and completely unobtainable.   It seed like they promised X to make it look like a great position, but really only intended to pay out 75% of that."}, {"review_title": "Was initially optimistic, but RH is not upholding values they espouse", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "1 Jun 2015", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- Benefits seem to be in line with companies of similar size in the industry, e.g. (401k match up to 6%), reasonable employee contributions for medical/dental/vision \r\n- Good amount of PTO for new associates; however, you are required to use a few PTO days during the company-wide holiday shutdown, and you do not receive any separate sick days, floating days or bereavement days \r\n- Good brand equity on a resume for future employment opportunities", "cons": "- Claim culturual values of the company are 'meritocracy' and 'transparency.' However, I do not think this extends to the sales org. Many incompetent people have been promoted based on favoritism and internal politics. Yes, this happens everywhere, but other companies don't claim to have a transparent meritocracy. If RH is going to be like every other company, then don't claim you do one thing and not enforce it by your actions. Actions always speak louder than words. \r\n- Along with the above, the org sometimes feels a little incestuous for a publicly traded company. They have a lot of RH lifers that are now upper managers and execs that have been promoted WAY beyond their actual ability level solely because they've been with the company a long time. They are now simply coasting in their cushy roles and not motivating subordinates or implementing positive changes...they are content with the status quo so as not to interrupt their gravy trains! \r\n- Red Hat as a company, and especially sales, is very male dominated. Yes, this is true in technology, but it's especially evident at Red Hat. For example, there are very few women in the channel sales org and field/inside sales. How have they not been hit with a gender discrimination lawsuit? I have been on sales calls where it's more of a \"frat house\" type mentality, with profanity flying and no regard for professionalism, which made me uncomfortable and alienated. \r\n- Culture of secrecy, gossip & backstabbing is common in sales. For example, I don't know what my 1st line manager and \"director\" actually DO. Again, it seems they are just on a gravy train surfing the internet all day and flying around trying to \"look\" busy, but it's all a facade. I have never once been asked how I'm doing or what I think could be improved. It's very much a \"we don't want to know and don't need your feedback\" type scenario, because providing reasonable feedback would require work on management's part to actually address and make a change, which they've made clear through their actions and promotions they have no desire to do. The people who are promoted are the \"yes men\" types who say everything is great to management, even if they have complained about it in gossip with coworkers. \r\n- Lots of 'low rent' hires recently. Seems with Red Hat's growth, they are lowering their standards for the sales org and hiring anyone off the street in certain geos. I don't know if this is a talent acquisition team problem, but I've noticed management has an attidue of \"that person will do\" when the attitude should be \"is that person going to be a rockstar in this role & an asset to red hat?\" As a result, several chronically lazy people (to the point where it's laughable) have been hired and will probably be coasting in their current role indefinitely since there are often no repercussions for bad behavior. \r\n- Compensation is starting to lack. The execs are making out like bandits, but unless you have the right manager to advocate for you, do not expect raises beyond 3-5% (sometimes waiting for an 18 month cycle or longer). This can be frustrating if you are trying to be evaluated on a more regular cadence or are underpaid for your experience solely because you have a manager who doesn't want to advocate for you. \r\n- Can be very difficult to partner with internal departments to close business - much more so than many tech companies. RH is very legal-driven instead of sales & customer-driven. This creates kind of an arrogant attitude that prevents business from getting closed unless the client meets RH's sometimes absurd demands, even down to basic things like info listed on a PO, order form etc that RH will hold up closing deals for. Red Hat is NOT HP some huge conglomerate, they need to take a customer-centric sales approach and create win-win situations to close business where the CUSTOMER is first. Without the customer, where would the business be? This can be frustrating to navigate for folks coming from companies with more pro-sales mentalities and fully baked systems in place. \r\n- Too many disparate internal systems for sales org. The way they roll systems out, it's like you are working for a 20 person company based out of a Silicon Valley house. Half the stuff they roll out is broken and glitchy, then you have to do extra work just to accomplish the same task that was working fine before. The rest of the time, they system they deploy doesn't have the functionality the prior system does, so you're forced to use something that actually makes it more challenging to do their job simply because some manager or analyst was trying to justify their own job. \r\n- Really cheap with company expenses. For example, we went on a trip and the manager had to literally send out 5-10 \"reminders\" about watching expenses, trying to get free food, etc. It came across as \"we don't trust you to act like adults.\" They could have easily said, this is the per diem, don't exceed the per diem. Instead, it's like veiled reminders that you shouldn't spend any money (even though we are allotted the per diem), but they don't want to come out and say that directly. The ambiguity makes it stressful and makes it seem like you're not valued as an employee and part of the company, especially when other departments have more of a carte blance mindset."}, {"review_title": "Senior Solution Architect", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "28 Jun 2015", "job_title": "Senior Solutions Architect", "duration": "N/A", "pros": "Awesome environment with plenty of highly talented people, specially in technical roles. A lot of opportunities as the Company is growing. Amazing Cloud vision and new areas to innovate: PaaS, IaaS, DevOps.", "cons": "Management has grown from Linux and they know a lot that area but they struggle a little bit when talking about Middleware and some new topics more business related. Really IT and technical driven, has to improve on the UI experience."}], [{"review_title": "Red Hat, Pune, Magarpatta, GSS (ATSE / TSE / STSE) - Only for Interns, not for experienced Hires", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "23 Apr 2016", "job_title": "ATSE/TSE/STSE in Pune", "duration": "N/A", "pros": "- Very Stable company, if you are looking for stability, are married then this is the company for you.\r\n- All Salary is fixed, insurance, shift allowance (huge amount particularly for night shift) is really good\r\n- Location is great..\r\n- Certification are free (provided your manager approves them - big catch). All depends on how good your relation with your manager and who your manager is... (what king of person he/she is..)\r\n- Exposure to Red Hat product stack, especially emerging Technologies in the form of Technical meetups. This exposure is only undestanding of the product from industry scope and not from implementation perspective. But still to learn something, you need to know about it..", "cons": "- If you are an Experienced professional  from System Admin background and particularly hired for Technical Support Roles (Global Support Services), and your main passion in life is Highest degree of Technical Growth in multiple vendor Technologies like Linux, VMware, VCS, VxVM, Cloud, then Red Hat GSS is not the correct place for you. I have give Red Hat Pune a \r\n2 star rating (2 out of 5) mainly for this point. Incase you are looking for stability and peace in life with high Brand value (Red Hat), then it is 4 out of 5..\r\n\r\n- If your designation has \"support\" keyword in it, you will not get access to servers. Since Support roles are mainly to provide Technical Support and not system Admin support. Please understand this very carefully.\r\n\r\n- In Technical Support Role you will get high degree of exposure to few components of OS,\r\nso if you stay in Red Hat for more than 2 years, then your value for Red Hat will increase exponentially, but your value for Industry will reduce. As an example, Industry needs a 5 - 6 years experience System Admin to have exposure to multiple vendor products, server hardware knowledge, Scripting, automation exp, Clustering HA exp, VMware exposure. But being in Red Hat (vendor) you will only get exposure to Red Hat product stack, but that also in a few components, as the Teams are divided on per component basis (example Kernel Team, Ldap team, services team etc..\r\n\r\n- No formal training provided. As is for US employees when they join in probation period..\r\n\r\n- cultural divide between US employees and India Employees. \r\n\r\n- NO - onsite what so ever. if you ask manager, they may get stunned and may stun you..\r\n\r\n- Senior members who have been in organization for more than 5+ years have a lot to lose when they share more knowledge so play a lot of politics.."}, {"review_title": "Twas the best job ever!", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "16 May 2016", "job_title": "Platform Consultant in Chicago, IL", "duration": "N/A", "pros": "Amazing customers!  Red Hat staff generally are the friendliest people ever but the #1 benefit was actually the interesting customers.  Red Hat products are everywhere doing amazing things.  One day you can be at NASA and the next day you may be in silicon valley or NYC.  Opportunity is endless.  Red Hat truly loves to see customers succeed whether the customer uses community or enterprise solutions which is nice to see.\r\n\r\nRaleigh is great and Red Hat is worldwide.  I was lucky enough to do some international work which was fantastic - I was even able to arrange relocation to the UK when I married a Brit.  I built some of the best friendships I could have asked for and still keep in touch with several folks worldwide.  I'd definitely love to come back if the right offer came along some day but for now I've been lured away by cashy hipster startups.", "cons": "Red Hat has become less of a tech company and more of a sales company.  Unfortunately that means leadership sometimes takes the technical people in directions that they lack understanding of.  The latest acquisition or focus may be something that is technically infeasable or out of Red Hat's expertise which leads to the company being spread a little thin at times.  Also salary packages are fantastic but they can't always keep up with trendy startups these days.  Sometimes Red Hat's Open Source stream feels backwards - it's difficult to explain to a customer how they've paid for enterprise support on hardened supported Red Hat products containing bugs that were fixed in community releases a year ago.  Just make sure you pick a few products and learn them inside and out."}, {"review_title": "A very open organization with a great work culture", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "13 Dec 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Lots of opportunities to learn new technologies.", "cons": "Although a very open organization, it's very week on diversity which backed up by data publish on the company's job site. Only 3 percent black company wide, with 0 in management at all levels. Although a very open organization, it's very male centered and at times feels like you have to be with the right click to get ahead."}, {"review_title": "An open corporation", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "30 Jan 2018", "job_title": "Sales in Stockholm, Stockholm", "duration": "N/A", "pros": "Leading open source player, open culture discussed a lot, friendly coworkers, remote working supported, emerging technology products", "cons": "Salary below market rate, benefits not good in satellite offices, no career development programs, evolving into an open corporation in the sales organisations, some locations have problems with salary payment processes and local tax legislation, casual sexism/racism present"}, {"review_title": "A bloated company with an abusive culture", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "5 Oct 2018", "job_title": "Senior Global Product Marketing Manager in Westford, MA", "duration": "N/A", "pros": "- Lots of opportunities \r\n- There are some remnants of the old Red Hat culture (Open Org) but they are quickly disappearing", "cons": "- Red Hat is turning into the IBM of Open Source software\r\n- Work culture has become command and control, and abusive\r\n- People are generally overworked and underpaid"}, {"review_title": "Red Hat employees have unflinching passion for what they do.  It's exicting to work in an environment like that.", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "10 Apr 2010", "job_title": "Senior Software Developer", "duration": "N/A", "pros": "Each individual can make a difference because management is always listening and open to new ideas.  Creativity in problem-solving is encouraged.", "cons": "Micromanagement of deliverables.  Atmosphere is not condusive to feeling ownership of products / services.  Too much decision-making authority in the hands of non-technical people, even when the problem at hand is 100% technical."}, {"review_title": "Makes Work FUn", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Part of growing, successful company\r\nClean, important work\r\nHealthy work environment working with mostly smart, driven people who all want to make Red Hat succeed.\r\nOpen Source just feels good.", "cons": "Fast growing company who tends to keep employees who cannot make the adjustment from small to large.  Some employees confuse open source with charity and do not understand the necessity of profit making.  Everyone seems out to get us, I get paranoid at times."}, {"review_title": "Best work culture, knowledge sharing and learning", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "1 Feb 2015", "job_title": "Technical Support Engineer in Pune", "duration": "N/A", "pros": "- Work culture is awesome, engineers across the globe are smart and share knowledge very nicely. You will never feel like you are stuck somewhere during the work. \r\n- You are independent to work on anything you wish to, there are no restrictions on it. \r\n- If you are a linux savy then this is the best place to work, you will get lots n lots of learning opportunities here.", "cons": "- Compensation is less as compared to other good companies.  Best it won't matter that much if you love other things here which you don't get anywhere else. \r\n- No offshore opportunities"}, {"review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "25 May 2014", "job_title": "Anonymous Employee in London, England", "duration": "N/A", "pros": "Red Hat is a special place, with many special people working there and a very special company culture. Open source is the core of its business and if you like an open culture and environment, Red Hat is the place for you.", "cons": "Working outside of the HQ can sometimes feel to work in a satellite office, you are more or a receiver of orders from the HQ than the center. Also the culture has changed a lot the last years with share holder value being the top priority. Also they don't pay as much as competitors."}, {"review_title": "Used to be a great company but quickly going downhill.", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "7 Jul 2015", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Culture is relaxed.  Team bonds are close.  Great financial position as a company.  Takes an act of God to fire anyone so job stability is there.", "cons": "Low pay. Lack of appreciation for hard work. Politics. Terrible leadership in key functions.  Takes an act of God to terminate poor performers so overall productivity has gone down over years."}], [{"review_title": "Never seen anything like that in 15 years", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "19 Feb 2016", "job_title": "Inside Sales in Farnborough, England", "duration": "N/A", "pros": "The company growth is the only Pros in EMEA from my point of view. US management should follow a bit more what is going on in EMEA", "cons": "Incompetent EMEA sales management who got their role only because of some friendships, because they are not sales they are creating a very particular atmosphere that is not the reflect of US or countries atmosphere. \nUnfortunately these incompetent people are protected internally and will never move, but why moving when you are paid doing nothing!? \nWay too much admin and not enough sales, still want to think they are a startup, the world's biggest start up they say."}, {"review_title": "Great learning experience", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "11 Apr 2017", "job_title": "Software Engineer in Brno", "duration": "N/A", "pros": "Great work environment with capable and knowledgeable people. \nGreat balance with your personal life thanks to flexible work hours. \nCoworkers arrange several activities over the week, great to relax and have some fun.\nBesides coffee and snacks , you can get some free and healthy food a few times per week.\nMany interesting projects lacking people which makes it not so difficult to switch to another team if you are interested.", "cons": "The process to go up in your career is not so transparent as it could be. \nBonuses have decreased over the last few quarters.\nBesides promotions, non existing policies for salary upgrades."}, {"review_title": "Good Salary and Benefits but High Price to Pay.", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "29 Oct 2019", "job_title": "Senior Project Manager in Ciudad de Mexico", "duration": "N/A", "pros": "- Good Salary \r\n- Several Benefits (Major & Minior Medical Care, Tuition Reimbursement, Grocery and Restaurant Cards, Vacations 15 days + 5 per emergency, Bonus each Q, Saving Found)  \r\n- Learning about Emerging Technologies\r\n- Industry Recognition", "cons": "- Personal Life doesn't exist\r\n- Very Hostile Environment\r\n- Unstable Place to Work they fire anyone for any reason\r\n- Zero Growth when a position is open they bring someone from outside\r\n- Personal Bullying by your race, sexual orientation, or knowledge by older employees even by Senior Managers"}, {"review_title": "Great people,  senior leaders need to trust there staff more and not micromanage.  Processes and procedures need to solidify in order to be scalable to 5b $$ and beyond.", "rating": "3.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "29 Nov 2014", "job_title": "Director in Raleigh, NC", "duration": "N/A", "pros": "Nice people,  opportunity are there to explore.  Lots of young talent right.  Open to new ideas on occasion.  Good on site perks.", "cons": "Low focus on processes and scaling to be larger.  Although global,  mindset is not. Compensation is lower than market so they need to level the population to keep associates in the near future."}, {"review_title": "Sales Experience at Red Hat India", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "24 Dec 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Being part of growing organization with rich relevant portfolio and consultative approach. \r\nOpportunity to engage with organizations on almost all new age frameworks like DevOps, Analytics, API, etc ...", "cons": "Change of management at India level (happened a couple of years back)  has caused lot of attrition due to confluence of cultures.  \r\nSudden change in people has also introduced lot of politics which was non-existent before.\r\nNo ground level customer or partner engagement by the management."}, {"review_title": "Low pay", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "31 Jul 2015", "job_title": "Senior Human Resources Executive in Bangalore", "duration": "N/A", "pros": "Really good role, lonesome person handling entire location hiring and was responsible for building the storage unit for Red Hat in India.", "cons": "Salary is not paid according to the market standards, no market correction is done so far. No Retention strategy."}, {"review_title": "Bad for women in storage sales, harassment", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "5 Oct 2016", "job_title": "Enterprise Account Executive in San Jose, CA", "duration": "N/A", "pros": "Teammates were great, made good friends over my five year career in sales.  Company still gives out RSUs which is an added bonus.", "cons": "Male dominated environment in emerging product sales (storage, cloud, middleware).  About 50 people within emerging product sales team; only a handful of women.  Executive made numerous inappropriate comments to women directly, and relating to women in general.  Red Hat is aware but has not done anything to prevent the hostile work environment for women on this team."}, {"review_title": "Changing in a bad way", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "1 Sept 2017", "job_title": "Senior Software Engineer", "duration": "N/A", "pros": "Very nice and talented people.\r\nMany excellent Linux hackers inherited from the good days.\r\nAutonomous, remote work and can schedule your own time.", "cons": "Managers don't value upstream work like before, don't understand anymore the importance of upstream contributions and influence. Drift between upstream and in-house maintainership.\r\nCompany becomes highly bureaucratic. Managers only use bugzilla tickets as a metric to quantify employees work. \r\nOld school fear-based management relying on Performance improvement plans instead of motivation.\r\nLosing some of its best elements.\r\nVery low budget for engineers travelling for conferences. Need to beg for funding elsewhere (Linux foundation, etc...)."}, {"review_title": "Good Company", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "8 Jun 2020", "job_title": "Principal Software Engineer in Bangalore", "duration": "N/A", "pros": "I have no complaints with the company. Management puts employee's life as a priority and surprise you with benevolence when you least expect it. When Covid lockdown started, the employers gave us Rs 12000/- no questions asked for the infra we may have bought for wfh.\r\nWfh is the norm and remote workers also exist, so the culture is built in such a way that there isn't a lot of difference between someone who always comes to work and someone who prefers to wfh. One of my colleagues stayed at his hometown with his wife for the first 1 year of his daughter's birth.", "cons": "I personally didn't find any cons."}, {"review_title": "Not so good as Red Hat in US", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Strong growth in each quarter;\r\nFairly good working environment but exclude remote offices;", "cons": "I take this job when I saw so many good feedback from this website.  But I'm wrong because the business environment locally is not the same.  Political disruption makes the business not well.  Limited information sharing, bad communication and poor marketing.  It has not built up an effective platform to run business smoothly."}], [{"review_title": "Great Place to Work", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "2 Aug 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great benefits, competitive pay, company is growing fast, lots of room to grow as an employee, and more focused on open source than any other company I've come across.", "cons": "Some growing pains, specifically the lack of clear organization. They are quickly addressing this, but the network of who reports to whom and who is the go-to person for certain questions or actions  is not transparent and often requires directly asking multiple people for help just to find the right person for a question/job."}, {"review_title": "How much you'll like it depends on what you're looking for", "rating": "3.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "21 Nov 2019", "job_title": "Quality Engineer", "duration": "N/A", "pros": "If you like working remote 100% of the time, this is a great fit; most of the quality engineering team is distributed around the world and remote teaming is required.\r\n\r\nSolid benefits offerings and compensation.\r\n\r\nMost folks are engaged and highly opinionated about technology, sometimes ad-nauseum. This level of passion is a good thing for a company that is focused on technology and collaboration.\r\n\r\nThe variety of technologies and learning opportunities available mean that you'll have plenty of chances to brush up on the latest Red Hat sponsored open-source technologies. If you like to learn and grow, this is a good place to be.", "cons": "The remote work aspect is an impediment to collaboration between development and quality engineering; expect things to move much more slowly than an environment with co-located team members. Sometimes quality engineering work can feel like a \"rubber stamping\" charade at this company.\r\n\r\nHeavy emphasis on correspondence via e-mail. Conversations and decisions that would be made more effectively via a real-time discussion are often taken care of via e-mail or online chat. \r\n\r\nThere is an emphasis on being receptive to feedback, but this openness doesn't always extend to taking action, even if the benefits are obvious. Sometimes feedback is simply passively ignored. Some things can be changed. Some can't because of inertia.\r\n\r\nFor an open source company, the source code for test automation is strangely kept private. This is reflective of the internal structure of the company - quality engineering is not formally included in the engineering part of the organization."}, {"review_title": "The best place I ever worked.", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "11 Feb 2011", "job_title": "QA Engineer in Brno", "duration": "N/A", "pros": "Red Hat is the most ethical company I ever worked. Also, the open source mentality is seen everywhere, from Engineers to Management. If you are looking to work with Open Source, Red Hat is your best option.", "cons": "I cannot really point to a single issue as a big con. A small one would be that it's *my feeling* that some Sales people needs a better understanding of Open Source. Most of them do understand, though."}, {"review_title": "Do not work for Red Hat IT.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "19 Jan 2014", "job_title": "Linux Systems Administrator in Raleigh, NC", "duration": "N/A", "pros": "The company as a hole, has great people and some great goals. If you work in Engineering, fantastic place to work. People who believe in what they are doing and love it. When I first began working there, I really enjoyed it, but things really went down hill.", "cons": "The IT department is full of incompetent people and people who are there due to nepotism. I really feel sad at having to say this, but the current CIO has really dragged the place down. They implemented ITIL and have generally preferred closed source solutions over ones that Red Hat itself sells. Just completely insane that they would put in place closed source solutions that specifically compete with Red Hat products."}, {"review_title": "A Place To Grow", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "1 Dec 2015", "job_title": "Account Manager in Raleigh, NC", "duration": "N/A", "pros": "You won't find many companies like this. The culture is one that allows you to grow and do that things you are truly passionate about. You create your own path, your own career and all the resources are in place to get you there. Whether it is your first company out of college or your 5th company as an industry veteran, you'll find all you're looking for here.", "cons": "Nothing is handed to you. Work for what you want. The culture here doesn't deal with politics and for good reason.. the best idea and people win."}, {"review_title": "Not your average Corporation!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "15 Aug 2017", "job_title": "Senior Manager in Farnborough, England", "duration": "N/A", "pros": "Almost unlike any other company you've worked for before - in a GOOD way!\r\n\r\nVery open and approachable CEO who takes the time to listen to the opinions of his employees, no matter at what level in the company\r\n\r\nA true meritocracy, you're recognised and rewarded for your results\r\n\r\nTalented and passionate colleagues committed to the principles of Open Source", "cons": "Processes and systems still maturing\r\n\r\nCan sometimes be slow to decide on a course of action as we tend towards wide consultation - although this can also lead to better decisions!\r\n\r\nNot for you if you like rigid hierarchies!"}, {"review_title": "Two sides, one company", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "21 Dec 2012", "job_title": "Software Engineer", "duration": "N/A", "pros": "Enormously bright people -- more than anything else, everyone is _proactive_ and professional. The work is challenging, you are rarely pigeon-holed (confined to only one type of work/role) and lots of room for growth and new ideas.", "cons": "Red Hat is really, really political, especially on the engineering side -- sometimes, it almost feels like an academic atmosphere in that respect, which is good on the idea side, but bad on the political side."}, {"review_title": "Great company and people.", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "20 Mar 2015", "job_title": "Software Engineer Intern", "duration": "N/A", "pros": "* Gain experience in the fast moving world of open source development.\r\n* Free Red Hat training and certification courses.\r\n* Great people, everyone is really passionate about what they do and the people they work with.\r\n* Remote work, Red Hat has perfected the remote work experience.\r\n* Huge breadth of projects, from java desktop applications to cloud computing and kernel hacking projects.", "cons": "* Not really a con, but there's not too many perks, although they're not really necessary as the projects and work environment is very satisfying in its own right."}, {"review_title": "fractured hierarchy, fuzzy vision", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "29 Sept 2017", "job_title": "Software Engineer in Boston, MA", "duration": "N/A", "pros": "Commitment to the larger software community, freedom to define your role", "cons": "Red Hat is losing sight of their actual useful products as they attempt to grow as a company, and part of the attempts to shift some expensive also-rans to the forefront has been an amount of chaos in management. Also the recruiters will just straight up lie to you about benefits; get everything in writing."}, {"review_title": "Great place to work BUT senior management gets in the  way of progress.", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "19 Jan 2010", "job_title": "Senior Marketing Manager in Raleigh, NC", "duration": "N/A", "pros": "Culture drives proactive, results-driven behavior. Focus on independent actions and individual accountability. Reasonably flexible work environment.", "cons": "Need fresh blood esp in management. \"Old Guard\" is suffocating and has lead to nepotism.\r\nChange is slow coming and hard won. \r\nFor a still small-ish company, compared to competitors like Oracle, MSFT, and IBM, the politics are astounding. \r\nPoor, ineffective managers are allowed to continue in their rolls without being replaced or re-trained."}], [{"review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "8 Feb 2013", "job_title": "Project Manager in McLean, VA", "duration": "N/A", "pros": "The open culture at Red Hat is a real thing and is infused in all aspects of the business. Of course that does not mean that \"every\" decision is made by committee. Red Hat still has a business to run so this of course makes sense. The work Red Hat is doing is relevant, industry changing and innovative. Employees are passionate and willing to challenge one another to produce their best work.", "cons": "Perks frequently do not extend beyond headquarters; benefits package is standard though does not hold a candle to other hot technology companies"}, {"review_title": "RH is a very passionate place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "30 Jan 2015", "job_title": "Anonymous Employee in Washington, DC", "duration": "N/A", "pros": "I have the opportunity to work with people at all levels of the organization.  It offers me the ability to constantly learn new things.  Atmosphere is very friendly and I love being able to work remote.", "cons": "There are times when it is very challenging to get people to see a different point of view.  I work with lots of different personalities.  Some of whom have their way of doing things and that's it.  Things are constantly changing and getting people to follow the change is hard."}, {"review_title": "Technology is awesome, not much of a sales culture", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "6 Feb 2015", "job_title": "Senior Solution Architect in Los Angeles, CA", "duration": "N/A", "pros": "Pay is above average.  Lots of freedom in the job.  Strong technical leadership.   You make the job what it is.   Lots of great recognition in the IT world.", "cons": "Not a sales and product management culture.   Very close to cathedral and bazaar (the book).  Red Hat is the bazaar where Open Source software development is chaotic, lots of opinions and lots of teaming where it makes sense."}, {"review_title": "Excellent place to win", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "12 Aug 2015", "job_title": "Sales Representative", "duration": "N/A", "pros": "RHT has a suite of products that are taking over the entire data center, way beyond OS. Amazing mobile strategy. Some of the smartest people in the biz. Folks have the highest respect for technical and field resources. Comfortable travel policy. A \"family-like\" culture.", "cons": "Sometimes it's hard to find exactly what you need as there is a lot of tribal knowledge. Awful SSO for internal systems."}, {"review_title": "Your experience here depends on your manager", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Coworkers, flexibility, senior management is approachable, good benefits, internal mobility", "cons": "Immediate managers were horrible and incompetent and played favorites, Sales was a good ol boys club, company was still small enough that everyone knew everyone else's business (although environment was getting more corporate that this was reduced when I left)\r\n\r\nIf the bad manager component was taken out, Red Hat would be a great employer to work for. However, since I had to deal w/ my manager daily all day, the bad manager factor eventually overcame all of the other benefits."}, {"review_title": "Smart people and fun work!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "2 Sept 2013", "job_title": "Senior Software Engineer", "duration": "N/A", "pros": "Able to work remotely on flexible hours. Management does a good job of keeping the red tape off you plate and just wants you to succeed.", "cons": "If you are new to open source or just new to the company there are lot of things that should be listed in a beginners guide.  Like how we use git or maven central.  The knowledge is there it is just silo'ed. At least if you ask people are willing to share."}, {"review_title": "Region based consulting", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "14 Sept 2015", "job_title": "Middleware Consultant in Stockholm, Stockholm", "duration": "N/A", "pros": "- Technology company in the forefront of innovation. \r\n- Great support from developers themselves via IRC\r\n- Products are fully documented online\r\n- Easy to contact management and other employees via email \r\n- Possibility to attend Red Hat Certifications for free", "cons": "As as Middleware Consultant I got to travel about 80% of the time. This becomes very tiring after a year of continuous projects and traveling. However, In your off time without projects you get to work from home and assign time to what you think it is best for you. Depending on your life situation, traveling will be good/bad for you."}, {"review_title": "company review for redhat (from an intern pov)", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "28 Feb 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- Nice atmosphere, people from my team are very friendly\r\n- You are working together with very talented individuals and can learn a lot from them\r\n- Free food and drinks\r\n- Smash bros game with colleagues", "cons": "- At my place, a lot of teams work remotely, can be a bit annoying sometimes\r\n- a reorg can happen and that can change things..."}, {"review_title": "Great on the outside, sour on the inside", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "29 May 2012", "job_title": "Technical Support Engineer in Raleigh, NC", "duration": "N/A", "pros": "Technical employees are some of the best out there.\r\nWork is engaging.\r\nLots of perks to working there.", "cons": "Salary is dreadfully low.\r\nAlmost all of management are drones that seem to forget where they came from as soon as they step into the role.\r\nThe workload is enough for twice the number of employees they have.\r\nThey hire at a snail's pace, and people leave twice as fast."}, {"review_title": "Great place to grow a career", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "15 Feb 2016", "job_title": "Anonymous Employee in Raleigh, NC", "duration": "N/A", "pros": "Best corporate culture of any company I've ever seen. Development team building are strongly encouraged from the  highest levels. The work is challenging but not overwhelmingly so. However, the best part of working at Red Hat is the incredible people. Everyone is incredibly friendly, talented, and passionate about doing a great job.", "cons": "The culture isn't for everyone, if you're not comfortable with openness and transparency you should look elsewhere. It can take awhile to get work done because the culture encourages getting feedback from lots of people."}], [{"review_title": "Open Source licensing, marketing and support Company", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "31 Jul 2016", "job_title": "Senior Consultant in Alpharetta, GA", "duration": "N/A", "pros": "None for Professional Services organization employees.Learn technologies that pay lower in long run as well as Management not willing to pay competitive money to professional services employees, even if customer willing to pay for overtime .", "cons": "Constant power politics between Professional Services, Account Management teams spilling to client site consultant with disregard to client and causing distraction to onsite consultant."}, {"review_title": "Good company but culture is near gone.", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "27 Jan 2017", "job_title": "Account Manager", "duration": "N/A", "pros": "Good work/life balance, good benefits. Pay is comparable with other tech companies this size. And the portfolio should make RH a player for the foreseeable future.", "cons": "Lacking in diversity, tough to break into the good ol boy network that exists, especially at headquarters. Growth is tough as hiring from the outside seems to be the thing now."}, {"review_title": "Not good anymore", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "12 Sept 2018", "job_title": "Sales Person in Raleigh, NC", "duration": "N/A", "pros": "Can be a good stepping stone as the company still has some good reputation among customers as the leader of open source software.", "cons": "Red Hat became too much concerned of its performance against shareholders and then it forgot its real assets, which are its employees. Do not expect competitive salaries or benefits."}, {"review_title": "Excellent Place to Work", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "27 Dec 2009", "job_title": " in Raleigh, NC", "duration": "N/A", "pros": "Red Hat is still a growing company.  Though not in full start up mode any longer, it still maintains the sense of entrepreneurial-ship prevalent at most startups.  However, it also has enough process in place to prevent total chaos.", "cons": "The same reason that makes it a pro can also make it a con.  As a company grows, the ecosystem has to adjust to change, and many times those changes can be challenging."}, {"review_title": "Open source company ruled by sales drones", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "26 Feb 2013", "job_title": "Senior Technical Support Engineer in London, England", "duration": "N/A", "pros": "- technical challenges\r\n- Many very talented staff\r\n- A lot of free software guys like yourself.", "cons": "- No sales no good salary.\r\n- No sales little career path.\r\n- Average wages for technical staff.\r\n- Consulting, engineering and support are at the lower side of the chain.\r\n- Lots of unpaid overtime.\r\nAs a consequence many of the very skilled people in europe who raise the company to the $1B have left demotivated and tired of it."}, {"review_title": "Time to sell some salami", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "25 Apr 2013", "job_title": "Senior Consultant in Los Angeles, CA", "duration": "N/A", "pros": "Good salary, flexible work environment, some flexibility in job assignments, not too demanding with bench work. Management is responsive to your opinions and suggestions. Management generally asks if you are comfortable with assignments.", "cons": "Sometimes isolating fro remote employees. Management is not afraid to throw consultants into situations that are less than ideal. They can send you into an assignment alone where you have no experience with a product that they sold you on as an expert."}, {"review_title": "No better place for an employee than Red Hat.", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "21 Oct 2015", "job_title": "Safety and Security Manager in Raleigh, NC", "duration": "N/A", "pros": "Incredible focus on retaining top talent.  Amenities galore.  Very progressive workspace environment.  Leadership gets out of the way.  CEO is genuine and walks the walk.", "cons": "Only downside is an incredibly entitled workforce.  If the Global Workplace Solutions team switches from cheddar cheese to sharp cheddar cheese on the free crackers there is an explosion on par with a hydrogen bomb."}, {"review_title": "Red Hat is growing, and losing what made it special", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "30 Oct 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "There is still a fair amount of focus on F/LOSS involvement and unstream contributions.", "cons": "Management is becoming focused on quarterly results, and losing focus on the philosophical differences that made Red Hat an innovator, a leader, and a success to date."}, {"review_title": "Sales", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "11 Jun 2018", "job_title": "Sales Representative", "duration": "N/A", "pros": "Great culture, lots of opportunity for training and being included in a team approach to everything!", "cons": "Much of these roles are self directed and require self starters. The solution is technical and not one that folks can walk in off the street to begin executing against.  Don't minimize need for tech savy sales individuals as we continue to grow!"}, {"review_title": "These four and five star reviews seem like they are fake or written by management to give falsely positive testimony.", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "4 Jan 2020", "job_title": "Anonymous Employee in Raleigh, NC", "duration": "N/A", "pros": "Bi-weekly pay cycle.\nLame but available health insurance.", "cons": "Terrible pay.\nVery toxic culture.\nRampant sexism.\nRampant racism.\nRampant ageism.\nUnrepentant favoritism often crossing into nepotistic territory.\nAssociate managers all seem to lack both experience and humanity.\nManagers are clueless and proud of it, they love to rubber stamp anything a fellow manager says.\nCommunication failures between all levels of management are so consistent that meetings discussing anything in the company feel schizophrenic.\nSexual harassment from male and female managers is so prevalent and intentionally unaddressed it is alarming.\nTerminally un-inclusive.  If you are a woman or person of color, get ready to be marginalized and overlooked.\nHigh levels of attrition.\nZero time is provided for training and professional development.\nHR will side with management 100% of the time and tell employees point blank that only a managers word matters.\nUnless you happen to be on one of the two or three teams with managers who can walk and chew gum simultaneously, do not expect meaningful performance reviews.\nManagement openly mocks employees when they think no one is listening.\nEmployees are harshly critiqued if they point out problems or issues but do not also supply the immediate fix to management.  \nManagement habitually lies about their concerns for everyone’s work-life balance.\nMany managers and associate managers are in meetings from the moment they walk in the door until the end of day, preventing any management from actually occurring.\nIt’s a “do your job and your managers job and some of your colleagues jobs too for good measure” sort of place to work.\nUntruthful management.\nInconsistent management.\nCostly misguided pet projects that waste employees time and ultimately produce no viable product are the norm.\nWhat was important last week will like not be important next week and employees will be punished for not anticipating the changes.\nBudget freezes and undisclosed overruns will affect employees salaries repeatedly.\nSalary actions are abysmal, almost humorously so.\nFrequent management advances mean employees get to have a revolving door of mostly inexperienced and unqualified associate managers throughout their career.\nMerit is not appreciated or recommend.\nRed Hat kool-aid must be consumed or there ARE repercussions.\nHyper-cliquey.\nPeople with inconvenient health conditions will be fired.\nPerformance is actually irrelevant, but how an employee is perceived is paramount.\nAll of an employees knowledge and good will absolutely will be abused by most managers.\nCareer advancement is time locked,  rather than taking ability into the equation at all.\nHard work and dedication are ignored."}], [{"review_title": "It was great experience.", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "23 Oct 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great work culture and employee benefit.", "cons": "Facilities are getting slashed day by day."}, {"review_title": "Engineering Partner Manager", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "5 Nov 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Good place to work. flat and reasonable organization.", "cons": "Basically, member are expected to be self-motivated."}, {"review_title": "It is a nice working environment.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "11 Feb 2020", "job_title": "Event Coordinator", "duration": "N/A", "pros": "Culture is very good, fosters growth.", "cons": "Pay scale/grade is not great."}, {"review_title": "Awesome", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "27 Feb 2020", "job_title": "Senior Consultant in Washington, DC", "duration": "N/A", "pros": "open culture,  awesome people and great learning opportunities", "cons": "I don't see and cons working at Redhat"}, {"review_title": "Good company, less people, less pressure", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "25 Jun 2012", "job_title": "Sales", "duration": "N/A", "pros": "good worklife balance. \r\nCulture is good", "cons": "not very structured\r\nstart up"}, {"review_title": "quality engineering @ Red Hat", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "16 Oct 2012", "job_title": "Quality Assurance Engineer", "duration": "N/A", "pros": "Open source culture, flexiable work environment.", "cons": "Some unprofessional management and inexperience superivsor."}, {"review_title": "Great and rewarding experience", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "25 Mar 2013", "job_title": "Software Engineer in Brno", "duration": "N/A", "pros": "- great colleagues\r\n- pleasant atmosphere\r\n- freedom culture", "cons": "- a bit chaotic at times"}, {"review_title": "Good Company", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Work from Home, Free dom to work in your style", "cons": "Not much interaction with other teams"}, {"review_title": "Balanced but Intense", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "22 Mar 2016", "job_title": "Software Engineer in Groningen", "duration": "N/A", "pros": "open source, training, intense, bleeding edge, compensation", "cons": "intense, bleeding edge, stressful, lower pay"}, {"review_title": "Solution architect", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "5 May 2016", "job_title": " in Mountain View, CA", "duration": "N/A", "pros": "Fast paced innovative company. Good place to grow professionally.", "cons": "None at the moment yet"}], [{"review_title": "Data scientist", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Great place to work! Great culture. open communication", "cons": "no cons. potential layoff next year..."}, {"review_title": "Sales Manager", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "4 May 2017", "job_title": "Sales Manager in Bangalore", "duration": "N/A", "pros": "Great work life balance.\r\nFast pace, high growth environment.", "cons": "High churn with in the company."}, {"review_title": "Management", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "12 Aug 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Stable company and good products", "cons": "Culture changed quite a bit."}, {"review_title": "RH Review", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "26 Feb 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "flexibility, linux, open source, latest technology", "cons": "lower salaries, problems with promotions"}, {"review_title": "Great Company", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "26 Aug 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Flexible company with great benefits and openness to associate opinions", "cons": "Lack of organizational direction"}, {"review_title": "Good Company", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "26 Sept 2018", "job_title": "Anonymous Employee in Bangalore", "duration": "N/A", "pros": "Awesome work culture , amazing people", "cons": "Pay is less than is standard at this level"}, {"review_title": "Average pay + Good work", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "23 Nov 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Flexible working hours and good company culture", "cons": "Average or below average compensation"}, {"review_title": "Awesome place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "3 Dec 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- Open source projects\r\n- Community contributions\r\n- Exploring teachnilogies", "cons": "- None (Nothing as such)"}, {"review_title": "Great Place to Work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "7 Feb 2019", "job_title": "Anonymous Employee in Raleigh, NC", "duration": "N/A", "pros": "Smart peers, Innovative Work, Good Work/Life Balance", "cons": "No Cons in my opinion"}, {"review_title": "Great", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "26 Feb 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Incredible company very collaborative and empowered", "cons": "Management is old school and may affect culture"}], [{"review_title": "Great!", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "10 May 2019", "job_title": "Intern", "duration": "N/A", "pros": "Flexible hours, great office, independent working, friendly workers", "cons": "There was little direction throughout the internship"}, {"review_title": "Good culture", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "15 Jun 2019", "job_title": "Manager", "duration": "N/A", "pros": "Communicative, small sized, good people", "cons": "Rare promotion chance, not competitive salary"}, {"review_title": "I love it here!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "1 Jul 2019", "job_title": "Senior Systems Administrator in Raleigh, NC", "duration": "N/A", "pros": "Flexibility, Opportunities, Awesome culture, Great benefits", "cons": "Low salary, Noisy office, budget restrictions"}, {"review_title": "One of the best op source company", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "19 Sept 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Work Culture \r\nFlexibility\r\nSenior Management", "cons": "haven't come across many till now"}, {"review_title": "N/A", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "2 Oct 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Best place to work at.", "cons": "IBM merger makes it difficult"}, {"review_title": "Best Employer", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "16 Jan 2020", "job_title": "Software Engineer in Toronto, ON", "duration": "N/A", "pros": "Work life balance, flexibility, positive work environment, challenging work.", "cons": "nothing much , all good"}, {"review_title": "nice company", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "26 Mar 2020", "job_title": "Inside Sales in Farnborough, England", "duration": "N/A", "pros": "Great atmosphere and the possibility of growing", "cons": "A lot of politics in the middle-level management"}, {"review_title": "Good, but growing fast", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Good work environment for starting out", "cons": "Can get lost in the mix"}, {"review_title": "marketing", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "29 Mar 2016", "job_title": "Marketing Consultant in Raleigh, NC", "duration": "N/A", "pros": "Great people to wok with. Very friendly.", "cons": "Processes slow things down. Too many review cycles."}, {"review_title": "Director", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Great open source culture and learning environment", "cons": "Growing fast and difficult to navigate at times"}], [{"review_title": "Director", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "16 Aug 2016", "job_title": "Director", "duration": "N/A", "pros": "Fast paced innovative culture. Lots of opportunity", "cons": "Fast paced innovative culture. Collaboration is critical."}, {"review_title": "What", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "1 Nov 2017", "job_title": "Software Engineer in Brno", "duration": "N/A", "pros": "Open source company, great people.", "cons": "Getting too big, hard to make some things happen."}, {"review_title": "Excelent culture", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "6 Nov 2017", "job_title": "Software Engineer", "duration": "N/A", "pros": "People are passionate on working with opensource tech.", "cons": "Some benefits are not worth"}, {"review_title": "Average", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "2 Feb 2018", "job_title": "Software Engineer in Bangalore", "duration": "N/A", "pros": "Compensation is average but there are opportunities fro personal growth", "cons": "Compensation is average over here"}, {"review_title": "Senior Manager", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "2 Mar 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great culture and several IT opportunities", "cons": "I can't think of any major cons."}, {"review_title": "Good Company", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "12 Mar 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "benefits are good\r\nEncourage employees to better themselves", "cons": "Team building can be better or improved"}, {"review_title": "Good", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Good, growth potentially, team player, positive environment, best features", "cons": "No problem, no problem, no problem,no problem"}, {"review_title": "have work life balance", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "6 Dec 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "good place to start your career", "cons": "none,open source is the best"}, {"review_title": "ATSE - platform", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "11 Mar 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "good work culture\r\nopen environment unlike most IT companies", "cons": "less salary than market\r\nshift duty"}, {"review_title": "Manager", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "20 Mar 2019", "job_title": "Manager", "duration": "N/A", "pros": "Open culture and great people.", "cons": "Flexible work environment, not applicable"}], [{"review_title": "ATSE", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "29 May 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "great company to work in your initial phase", "cons": "depends where you belong in org tree"}, {"review_title": "Best place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "12 Jun 2019", "job_title": "Senior Software Applications Engineer", "duration": "N/A", "pros": "Open culture , meritocracy, continued learning", "cons": "Lower pay and IBM merger"}, {"review_title": "Great culture", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "17 Jul 2019", "job_title": "Software Developer", "duration": "N/A", "pros": "Well paid and enjoyable for the most part", "cons": "Not much free time every weekend"}, {"review_title": "Great Place", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "17 Oct 2019", "job_title": "Senior Technical Account Manager", "duration": "N/A", "pros": "Smart people, meritocracy , work from home", "cons": "Some inside politic may affect decisions/career opportunities"}, {"review_title": "Work culture", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "5 Nov 2019", "job_title": "Senior Software Engineer", "duration": "N/A", "pros": "Best work culture I have seen", "cons": "Nothing I can think of right now"}, {"review_title": "Awesome", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "It's a big company\nMore innovative\nCareer growth", "cons": "Salary expectations\nGood culture\nLearning ability\nNothing else"}, {"review_title": "Great", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "28 Dec 2013", "job_title": "Sales Account Manager in São Paulo, São Paulo", "duration": "N/A", "pros": "technology, products, growth, people, opportunities", "cons": "some old minded sales directors"}, {"review_title": "Great Company for engineers", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "2 Jul 2015", "job_title": "Principal Software Engineer in Westford, MA", "duration": "N/A", "pros": "Free speach and free to innovate", "cons": "Compensation could be slightly better."}, {"review_title": "working for Red Hat", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "technology vision future open source", "cons": "I did not notice any"}, {"review_title": "Company review", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "innovative open source company, works on latest technologies.", "cons": "Not so good compensation benefits"}], [{"review_title": "Awesome company!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "4 Mar 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great Culture and full of smart people!", "cons": "None that come to mind!"}, {"review_title": "Systems Infrastructure Intern", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "28 Nov 2016", "job_title": "Intern in Raleigh, NC", "duration": "N/A", "pros": "Culture, environment, work life balance, future prospects", "cons": "Management, hierarchy, perks, intern benefits"}, {"review_title": "Amazing place to work", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "10 Mar 2017", "job_title": "Inter in Raleigh, NC", "duration": "N/A", "pros": "Open source contribution, good technology", "cons": "Budget, compensation is less, concentrated power"}, {"review_title": "Operations Specialist", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Culture of the company and the employees", "cons": "management, no work-life balance,"}, {"review_title": "Recommended", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "16 Oct 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "many benefits, nice people, opensource company", "cons": "lower salary than in other IT companies"}, {"review_title": "Good company to work.", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "19 Nov 2017", "job_title": "ATSE in Pune", "duration": "N/A", "pros": "good professional and personal life balance.", "cons": "need improvement in  management"}, {"review_title": "Senior Technical Account Manager", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "16 Mar 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great company\r\nGood mentality\r\nTop in technology", "cons": "Some process or organization management"}, {"review_title": "Software Engineer", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "30 Apr 2018", "job_title": "Software Engineer in Beijing, Beijing", "duration": "N/A", "pros": "Flexible working style and work life balance", "cons": "salary is not that competitive"}, {"review_title": "Red Hat", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "9 May 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great company culture, collaboration, open communication", "cons": "No specific cons at the moment"}, {"review_title": "Support Engineer", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "10 Oct 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Awesome place to learn and collaborate.", "cons": "None that I can think of."}], [{"review_title": "Great company", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "6 Nov 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Fantastic colleagues, very friendly and open environment", "cons": "Sometimes it can be process heavy"}, {"review_title": "Intern", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "1 Jan 2019", "job_title": "Internship in Raleigh, NC", "duration": "N/A", "pros": "Best team mates, Flexible hours, Good support", "cons": "No cons as such to say"}, {"review_title": "Love it here", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "31 Jul 2019", "job_title": "Business", "duration": "N/A", "pros": "Everyone loves coming into work", "cons": "Feedback slows down the process improvement"}, {"review_title": "Inside sales", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "21 Oct 2019", "job_title": "Inside Sales Representative", "duration": "N/A", "pros": "Great spot to work. Good salary.", "cons": "Management lack knowledge of processes"}, {"review_title": "Good place for growth", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "21 Oct 2019", "job_title": "Director", "duration": "N/A", "pros": "Really good place for growth.", "cons": "Keeping up with astronomical growth"}, {"review_title": "Feedback", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "17 Jan 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great colleagues and good work environment", "cons": "I cant think about any negative elements"}, {"review_title": "Great overall!", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "13 Feb 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Flexible working hours, WFH policy, open environment", "cons": "Get promoted, communications with other teams"}, {"review_title": "Red", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "10 Mar 2020", "job_title": "Inside Sales Representative", "duration": "N/A", "pros": "Great culture and product, good people", "cons": "salary not good, could be improved"}, {"review_title": "Quality engineering work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "7 May 2020", "job_title": "Senior Quality Engineer in Brno", "duration": "N/A", "pros": "Very good place to work.", "cons": "A lot of mails and pressure"}, {"review_title": "Really sattisfied.", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "30 Mar 2015", "job_title": "Associate Quality Engineer in Brno", "duration": "N/A", "pros": "- benefits, community, culture, social events, education", "cons": "- sometimes boring job, job"}], [{"review_title": "good", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "6 Jan 2016", "job_title": "Systems Engineer in Pune", "duration": "N/A", "pros": "Best company for learning. management is good", "cons": "reqired location only for pune office"}, {"review_title": "Review", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "31 Aug 2016", "job_title": "Anonymous Employee in Buenos Aires", "duration": "N/A", "pros": "Culture, Open, Trendy, Techie, Innovate", "cons": "Friendly Business Relationship, Sometimes No Alignment Between Geos"}, {"review_title": "Redhat", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "24 Jan 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Good place to enjoy linux", "cons": "Salary is low. Other thing is not bad."}, {"review_title": "Quality Engineer", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Working hours are very flexiable", "cons": "Down Town far distance, long drive"}, {"review_title": "HR intern", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "20 Apr 2017", "job_title": " in Beijing, Beijing", "duration": "N/A", "pros": "good place to work , workmates are friendly", "cons": "May hard to promotion"}, {"review_title": "Awesome company", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "13 Sept 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Open Source, amazing culture, amazing people", "cons": "No real cons, excellent company"}, {"review_title": "great company", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "great work with benefits and oportunities", "cons": "Big company with enterprise stance"}, {"review_title": "Marketing Specialist", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "great culture and working environment.", "cons": "There is overcapacity in the office."}, {"review_title": "Good Company", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Great benefits and decent salary", "cons": "The location is a little far out"}, {"review_title": "GOOD company", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "15 May 2018", "job_title": "Senior Software Engineer in Bangalore", "duration": "N/A", "pros": "get a new chance to learn", "cons": "nothing i find as cons"}], [{"review_title": "Software Engineer", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "16 Jun 2018", "job_title": "Software Engineer", "duration": "N/A", "pros": "Great place to work at. Great team.", "cons": "Pays less. Otherwise no cons"}, {"review_title": "Channel Manager", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "1 Jul 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "great culture, people, career path", "cons": "growing pains and management is aware"}, {"review_title": "Software Engineer", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "20 Dec 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great technical challenges. Pleasent people.", "cons": "None that I can think of."}, {"review_title": "Good environment, Good salary", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "6 Feb 2019", "job_title": "Anonymous Employee in Ấp Long Hoa, Hồ Chí Minh", "duration": "N/A", "pros": "Good environment for new hire", "cons": "A lot of sales training"}, {"review_title": "Growing company", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "13 Aug 2019", "job_title": "Marketing Team", "duration": "N/A", "pros": "Great working experience in the company", "cons": "Not much of cons to mention"}, {"review_title": "Great place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "21 Dec 2019", "job_title": "Consultant in Madrid", "duration": "N/A", "pros": "Travel, phone, laptop, openness, coworkers.", "cons": "Travel time, salary, poor organization."}, {"review_title": "Yassss", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "2 Mar 2020", "job_title": "Architect in London, England", "duration": "N/A", "pros": "Fun, great culture, lovely people, challenging technology", "cons": "Can involve lots of travel,"}, {"review_title": "Engagement Manager", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "28 Aug 2014", "job_title": "Anonymous Employee in Rome", "duration": "N/A", "pros": "open source culture, flexible work ,", "cons": "poor partner management, financial constraints,"}, {"review_title": "Great company", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "23 May 2016", "job_title": "Security Response Specialist in Brno", "duration": "N/A", "pros": "Benefits, colleagues, flexibility, management, opportunities", "cons": "Salary, none, none, none, none :)"}, {"review_title": "Good Company", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Great corporate culture and office environment", "cons": "career development could be improved"}], [{"review_title": "Partnership intern", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "3 Dec 2016", "job_title": "Intern in Austin, TX", "duration": "N/A", "pros": "Great working environment and company culture", "cons": "Locate in a small city"}, {"review_title": "Senior Director", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "3 Jul 2017", "job_title": "Senior Director", "duration": "N/A", "pros": "Great free snack and drinks program", "cons": "Meritocracy is abused.  The loudest voices are heard not necessarily the important ones.  Very immature organization.   Weak and inexperienced leadership"}, {"review_title": "Consulting is slavery here in Italy", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "19 Dec 2017", "job_title": "Middleware Consultant in Milan", "duration": "N/A", "pros": "Good benefits like notebook, smartphone, credit card an health insurance", "cons": "Management arrogant and greedy\r\nBalance work/life terrible for consultants\r\nNo career opportunities\r\nSalary not appropriate to the work/life\r\nFull time business trip"}, {"review_title": "AE", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "14 Jun 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "collaboration and good portafolio for customers", "cons": "lack of process and fluent comunication"}, {"review_title": "Good Company", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "4 Sept 2018", "job_title": "Devops Engineer in Bangalore", "duration": "N/A", "pros": "It is a good company", "cons": "Work environment is sometimes hectic"}, {"review_title": "Great place", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "8 Apr 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Collaboration,  cutting edge technology", "cons": "None, i like working here"}, {"review_title": "Great company", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "26 Aug 2019", "job_title": "Manager", "duration": "N/A", "pros": "Awesome culture, great management, flexibility", "cons": "High pressure environment, highly competitive"}, {"review_title": "Good", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Good work life balance culture", "cons": "product quality needs further development"}, {"review_title": "CTAM", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Great company, great culture and environment", "cons": "Hard to sell beyond RHEL"}, {"review_title": "Marketing", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "11 Dec 2015", "job_title": "Marketing Manager in Raleigh, NC", "duration": "N/A", "pros": "Collaborative CEO meritocracy transparency", "cons": "Politics, growing pains, no workout classes"}], [{"review_title": "TAM", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "26 Apr 2016", "job_title": "Technical Account Manager in São Paulo, São Paulo", "duration": "N/A", "pros": "Culture, best place to work, opportunities", "cons": "I do not know one"}, {"review_title": "Good", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Good work life balance.", "cons": "As such there are no cons."}, {"review_title": "Review", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "3 Sept 2018", "job_title": "Solutions Architect in London, England", "duration": "N/A", "pros": "Good direction, growth, strategy, culture.", "cons": "Growing a bit too fast."}, {"review_title": "Innovation and Accountability", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "15 Jan 2013", "job_title": "Key Account Manager in Atlanta, GA", "duration": "N/A", "pros": "Great technology.  Leaders that mentor.", "cons": "Internal systems can be VERY complex."}, {"review_title": "Interesting", "rating": "3.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "30 Jan 2014", "job_title": "Consultant in Bowie, MD", "duration": "N/A", "pros": "Great Technology and training. great resources", "cons": "No loyalty or job security"}, {"review_title": "intern", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "good place to work at", "cons": "not much negative to say"}, {"review_title": "Operations", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "24 Feb 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great culture, teamwork, fun, enjoyable", "cons": "Low pay, difficult to advance"}, {"review_title": "Mgr", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Pay pay pay pay pay", "cons": "Schedule dog ran up the hill"}, {"review_title": "nyc", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "29 May 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "nyc place to work with", "cons": "bad custom involvement to work"}, {"review_title": "Intern", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Enjoyed my time there last year", "cons": "Not too much else to add"}], [{"review_title": "To much politices", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Work from home option. other than this nothing is good here", "cons": "IF you are hiring for frontend guys. dont join this company\r\nSome of backend guys not respect the frontend guys."}, {"review_title": "Nice place to work five", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Good place to learn five", "cons": "Support is high pressure five"}, {"review_title": "SENIOR MARKETING MANANGER", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "great company to work for , great culture , innovation of the product", "cons": "less free time /as the company is growing that fast the pressure to deliver is high ."}, {"review_title": "Negative", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "2 Apr 2014", "job_title": "Inside Sales Account Manager in Farnborough, England", "duration": "N/A", "pros": "Great reach to latest in IT", "cons": "In U.K. They use people as thermometers and make sure there are enough borderline characters within the Organization"}, {"review_title": "Very bad Experience", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "9 Oct 2017", "job_title": "Senior Software Engineer in Bangalore", "duration": "N/A", "pros": "1. Food.\r\n2. Good Work Environment.", "cons": "1. Politics.\r\n2. Again Politics.\r\n3. Politics was so great, I had to quit the company without an offer.\r\n4. Very Bad Compensation."}, {"review_title": "Not trustable", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "29 Apr 2020", "job_title": "Software Development Manager in New York, NY", "duration": "N/A", "pros": "Very manipulative managers and employees. How it looks is more important than what it does. Very bad.", "cons": "Worst, Bad, Manipulative, Not trustable, Lazy."}, {"review_title": "I am feeling disappointed since the acquisition", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "23 Dec 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "People, direct manager, atmosphere, offices", "cons": "Leadership and senior management"}, {"review_title": "Pass", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "14 Jun 2019", "job_title": "Senior Technical Account Manager", "duration": "N/A", "pros": "Remote, 40 hour work week, stock", "cons": "Goals are ever changing, mismanagement"}]]