[[{"review_title": "Energetic scale-up with great people and culture", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "28 Jul 2022", "job_title": "Operations in Singapore", "duration": "N/A", "pros": "Excellent culture, really focused on progress and on continuing to build in this crypto winter. Inspiring founders, new senior leadership hires are impressive. \r\nThis pros of startup without the politics thanks to information transparency and very approachable managers.", "cons": "Cake is evolving from startup to scaleup so some processes don't exist or need to be built out. For me this is also a good thing because you can take up responsibility and make proposals which are always appreciated."}, {"review_title": "Good Insurance, poor dismissal plan, favouritism", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "27 Jan 2023", "job_title": "Full Time in Singapore", "duration": "N/A", "pros": "Good insurance. Festive celebration. New office. Using MacBook", "cons": "In a recent round of retrenchment, staff was let go without PIP program despite an earlier promise."}, {"review_title": "Toxic engineering culture", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "19 Nov 2022", "job_title": "Software Engineer in Singapore", "duration": "N/A", "pros": "Good healthcare insurance (BUPA) \r\n\r\nFriendly work colleagues \r\n\r\nHybrid working arrangement but soon to be 5 day work in office week. \r\n\r\nTransparent on the funds they hold for the customer \r\n\r\nGood hardware for work", "cons": "Salary payment to central pension fund are late without explanation.\r\n\r\nSalary is not competitive as they claim on their hiring post.\r\n\r\nOperate like a developer sweatshop, overtime are common among team members. \r\n\r\nEngineering tickets most often are not well defined and have scope creep leading to swe doing overtime to meet deadlines. \r\n\r\nFail to retain tech leads (platform and blockchain), which leads to the lost of context knowledge. \r\n\r\nCrazy technical debt but CTO still expect existing features to work and new feature pushed out every sprint. \r\n\r\nCTO nerd rages \r\n\r\nInvested heavily in their open source blockchain but their stable coin got depeg and yet to recover for 6 months and ongoing. \r\n\r\nDoesn't have the correct environment to swe to grow \r\n\r\nCEO sometimes micromanage (but can be seen as taking ownership and shaping the correct outcome)"}, {"review_title": "Toxic CTO and engineering culture", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "10 Sept 2022", "job_title": "Software Engineer in Singapore", "duration": "N/A", "pros": "Flexible working arrangement \r\nGood hardware for work - MBP 16inch\r\nFriendly colleagues\r\nCeFI that does proper risk management", "cons": "-CTO nerd rage without the full picture and call out employees in public slack channels\r\n-CTO doesn't care about his team members opinions (his way or the highway type)\r\n-CTO is highly skilled in blockchain development but failed badly in architecting cake platform systems.  Yet he raged when the system is not functional due to technical debt\r\n-CTO doesn't take responsibility on fixing technical debt\r\n-CTO is bias towards blockchain (birthday research) department in resource allocation \r\n\r\nToxic engineering culture\r\n-All about quick wins, would not want to invest resources in fixing their technical debt\r\n-Crazy amount of technical debt \r\n-Gaslighting \r\n-Fail to retain tech lead which lead to lost of context knowledge \r\n-Overtime is common \r\n-Initiative and contribution is not rewarded\r\n-There are risk of trying to make an impact or lack of room to make an impact. Leads to dev adopting coasters mindset and chase quick wins to be on the good books of the CTO"}, {"review_title": "Bad management", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "28 Jan 2023", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "unlimited leave colleagues was good", "cons": "unprofessional COO poor management not transparent"}, {"review_title": "Poor management direction", "rating": "1.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "12 Aug 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Work from home and no micro management.", "cons": "- no unique value proposition of product (doing DeFi and Loans and Tokenisation of assets)\r\n- closed ecosystem without interoperability > basically they are just printing their own Internet money\r\n- low liquidity of DFI token as not listed on many CEX\r\n- miselling n poor explanation of their products > they claim its lending when in fact the underlying assets are derivatives (options) that gives the yields\r\n- CEO used to be from scam project TenX and now trying to rebrand himself with new project"}, {"review_title": "Results-oriented", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "20 Feb 2022", "job_title": "Finance", "duration": "N/A", "pros": "- Flat hierarchy\r\n- Management is solely focus on tasks and deliverables - empower employees to own the process\r\n- Transparency\r\n- Company trips and team-bonding", "cons": "Not really cons to me, but people may not like it\r\n- Starting overall pay may not be as high as desirable - but once you prove your worth, you can be damn sure management would pay above market rate for you. In short, you need to prove you are able to hustle - this is so that it is fair to the system.\r\n- Still a very young company, as such processes may not be mature yet - some people may not like it, but some may see this as an area to shine - its all about the right mindset, and being fair to the system."}, {"review_title": "Common mission that's fulfilling and great teammates", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "20 Feb 2022", "job_title": "Product Designer in Singapore", "duration": "N/A", "pros": "Talented and collaborative teammates.\r\nLeads do not micromanage.\r\nProduct-driven with strong collaboration with devs.\r\nClear team principles to abide by.\r\nFun work culture, minimal politics.\r\nClear short to medium term goals.\r\nSuper diverse team.\r\nGet paid in BTC!", "cons": "Product management is new, thus a lot of product debt. Expect to compromise a lot.\r\nLong term goals are a bit uncertain.\r\nMobile app engineers are not particularly strong in UI implementation. Designers spend energy creating beautiful mockups only to see half-assed implementations. We need UI devs with a penchant for details.\r\nThings move so fast, there's no time to do proper formative research. Everything feels like it's based on the gut feeling of the higher ups.\r\nSlight disconnect between Marketing and Product."}, {"review_title": "A great place to work at built around 7 team principles which the founders and colleagues live by", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "3 Apr 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "1. Highly passionate and forward thinking founders who care immensely about the company culture even as we grow at a breakneck pace\r\n\r\n2. Friendly and highly motivated team members and colleagues who are passionate about what we're doing and always willing to share their knowledge\r\n\r\n3. Great company benefits so we can focus on what we do and deliver optimal results", "cons": "Being a young start-up, there are a lot of processes that still need to be refined before it can become a well-oiled engine that matches larger more established companies. But at the rate we are growing, it is expected, and they are addressing this."}, {"review_title": "Great place", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "28 Apr 2022", "job_title": "Software Engineer", "duration": "N/A", "pros": "- A very open culture where even the CEO openly answers questions and seeks to address issues, at least during townhalls\r\n- Mingling with super talented, respectful people and pleasant folks\r\n- The choice to work remotely as of this moment\r\n- Knowing that your work is valued", "cons": "- Performance reviews can be a bit intense and it feels like we should constantly be performing at our best condition, can be stressful at times\r\n- There seems to be a slight disconnect between the engineering team vs the business team, interests need to be aligned. With that said, there is no perfect team\r\n- Presently, no major red flags"}], [{"review_title": "Fast-paced engineering centric scale-up", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "27 Jul 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Work is definitely not boring in the engineering teams. Great founder combination and leads that do give a lot of freedom. Ownership is important so if you want to turn off your brain and just tick off todo lists you want to look elsewhere.", "cons": "Sometimes too fast paced, lots of tasks with priority, so tech debt builds up and best practices are overlooked to get stuff out."}, {"review_title": "Extremely fast-paced", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "20 Feb 2022", "job_title": "Software Engineer", "duration": "N/A", "pros": "- Decent compensation package with good bonuses.\r\n- Work with fairly modern tech and smart people.\r\n- Exposure to decentralized finance and digital assets (incredibly new and exciting).\r\n- Understanding team leads.\r\n- Mostly flexible working conditions. Employees are free to adjust their schedule.\r\n- Remote work.\r\n- Allows self-growth.\r\n- Quite transparent.\r\n- Quite a flat hierarchy.\r\n- No micro-management.\r\n- Everyone has to pull their own weight or they will eventually be removed from the company.", "cons": "- Extremely fast-paced and is believed as a major reason for the company to grow rapidly with quick delivery of features.\r\n- The fast-pacing causes significant stress especially when trying to achieve major milestones.\r\n- Technical debt is accrued due to the fast-pacing with system performance and scalability being the debts that bite-back.\r\n- Extremely ambitious company goals (not for everyone).\r\n- Hard to bond with people outside your direct team."}, {"review_title": "Average", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "23 Aug 2022", "job_title": "Software Engineer", "duration": "N/A", "pros": "- flexible working time\r\n- friendly colleagues.", "cons": "- CTO does baby rage sometime over small issues without understand the whole picture.\r\n- average salary"}, {"review_title": "Love my experience so far", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "14 Jul 2022", "job_title": "Marketing", "duration": "N/A", "pros": "- Great culture and lovely people\r\n- Flexible schedule\r\n- Hybrid working\r\n- Recurring revenue from locked funds\r\n- CEO genuinely cares about employees (employees first, customers second and shareholders third)\r\n- Exciting work and many groundbreaking opportunities", "cons": "- Company has not proved that it can cross the chasm\r\n- Ok employee perks"}, {"review_title": "Purposeful and energetic team culture, exciting crypto startup", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "22 Mar 2022", "job_title": "General Counsel", "duration": "N/A", "pros": "The culture is what really drew me into this company and has kept me going thus far. It's fun, driven and everyone truly believes in what the company is trying to achieve in the DeFi crypto space. Leadership takes time to understand what each employee wants to achieve, and provides the support and tools they need to succeed. Compared to my past experiences in law firms and financial institutions, this company stands out as the most exciting venture that I have ever been a part of.", "cons": "Startups dictate that you come in having a game plan and knowing what to do from the get go. You will thrive here if you do not expect much hand holding and are confident in making independent decisions."}, {"review_title": "Moderate", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "11 Aug 2022", "job_title": "Software Engineer in Singapore", "duration": "N/A", "pros": "flexible working environments.\r\nFriendly colleagues.\r\ncompany hierarchy not as high.", "cons": "Salary not as competitive as they said they are. Beware.\r\nBoss rage sometime over small issues."}, {"review_title": "A tech-startup with an actual business", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "28 Feb 2022", "job_title": "Talent Acquisition in Singapore", "duration": "N/A", "pros": "Ownership. You own your job, your career, your hours, your holidays. Do your job, do it well, and it will take you as far as you want it to.\r\n\r\nFantastic culture. People here work hard because they want to, and because they see the value their work brings. This leads to a very good energy in the team, where people more often than not are willing to help each other out.\r\n\r\nVisibility. Everyone's work is important, visible, and impactful.", "cons": "You cannot remain stagnant, because others will nudge you forward with them. It's not for everyone.\r\n\r\nVisibility. Nowhere to hide if that's a thing."}, {"review_title": "Everything employment should be and more", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "3 Mar 2022", "job_title": "Senior Software Engineer", "duration": "N/A", "pros": "Top-shelf healthcare package\nRegular pay reviews and more than fair increases\nNo micromanagement\nQuarterly bonuses\nPleasant team culture throughout\nOpportunity to innovate and learn new skills\nFeeling of being valued and respected sincerely\nFreedom to work remotely or meet at the office", "cons": "No cons to report at this time"}, {"review_title": "Great work culture, leadership & high expectations", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "20 Feb 2022", "job_title": "Specialist", "duration": "N/A", "pros": "Great work culture - no micro-managing and v collaborative (start-up), strong leadership - supportive with a long term view, great benefits (medical, unlimited leave - although employees seldom take them).", "cons": "Overall not much of cons, really enjoyed the experience thus far. But there are high expectations, which may translate to long working hours (not imposed)."}, {"review_title": "Great culture made better by a talented group of team members", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "21 Feb 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "While we are ~100 strong at the time of writing, the company is close-knit and highly collaborative. Everyone is constantly pushing each other to punch above their weight, and cross-functional team members never hesitate to support and help one another. Fast-paced yet fulfilling environment", "cons": "A highly dynamic and complex industry with ever-shifting goals and roadmap. One must enjoy working in such an environment to find it satisfying."}], [{"review_title": "Fast Phase Startup Company", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "22 Mar 2022", "job_title": "Specialist", "duration": "N/A", "pros": "Great startup company and diversified culture. Flexible working hours and good for career growth (if you are up for it). Management are very transparent", "cons": "-very fast phased and if you don't like this type of environment, its not for everyone."}, {"review_title": "Great culture, steep leaning curve", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "22 Feb 2022", "job_title": "Talent Acquisition Specialist", "duration": "N/A", "pros": "- Everyone is willing to teach \n- Collaborative work environment\n- The founders are always working towards constant new innovations\n-  Opportunities to grow\n- Unlimited leaves,  yearly trips , quarterly yacht parties\n- Swanky new office", "cons": "- nothing I can think"}, {"review_title": "Fast paced results oriented startup", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "20 Feb 2022", "job_title": "Software Engineer in Singapore", "duration": "N/A", "pros": "Everyone get to voice out any constructive opinions.\r\nNo office politics despite head counts growing fast.", "cons": "Startup-ish, could be a pro depend on point of view."}, {"review_title": "Best Team and great culture", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "23 Feb 2022", "job_title": "Anonymous Employee in Singapore", "duration": "N/A", "pros": "Great culture and wonderful CEO , nice office space and good benefits", "cons": "None at the moment , great environment to work at"}, {"review_title": "Face pace startup", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "1 Mar 2022", "job_title": "Engineering Lead in Singapore", "duration": "N/A", "pros": "Flexible, result oriented, freedom as long as performing.", "cons": "Fast paced startup-ish environment, only for people who willing to move fast"}, {"review_title": "Fast Paced", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "5 Jan 2022", "job_title": "Software Engineering in Singapore", "duration": "N/A", "pros": "Friendly people, projects are relative small scaled.", "cons": "Engineering culture is not as free as other places, you don't get to touch everything"}, {"review_title": "Great Engineering Culture", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "22 Aug 2021", "job_title": "Software Engineer in Singapore", "duration": "N/A", "pros": "Some of the strongest and most capable software engineering talents are working in Cake. Engineers are punching above the status quo of industry standards.\n\nInsane coding culture, very transparent engineering and management decision.", "cons": "Very startup-oriented, fast-paced, things get prioritized and de-prioritized rather quickly. Good for where the company is heading, might not be suitable for everybody."}, {"review_title": "Fast growth, aggressive results, high work load", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "6 Aug 2020", "job_title": "Senior Recruiter in Singapore", "duration": "N/A", "pros": "The company is extremely fast growing.\r\nThe goals are very high.\r\nCulture is fantastic with a combo of remote and on-site work.\r\nLeadership is strong and dedicated.\r\nVery smart people.", "cons": "I left in 2020 due to personal reasons. The work load is really high. Everyone is fully committed, but it is long hours.\r\nSalary is fair, but not extremely high as for some other tech companies.\r\nWork at Cake if you enjoy working on something exciting and meaningful, but be ready to put in way more hours than at most other companies."}, {"review_title": "Good workplace - Bad management", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "10 Nov 2022", "job_title": "Software Engineer", "duration": "N/A", "pros": "Liked the brief time I was here. Reporting manager and colleagues were really friendly.", "cons": "They will terminate your contract without showing any valid reasons in the name of \"Logistics Issues\" even before you can contribute to the company. Don't make the mistake like me of leaving your job and joining them."}, {"review_title": "Great company", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "25 Nov 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great work culture, close collaboration between heads of departments and teams", "cons": "Need to have knowledge about DeFi eco-system"}], [{"review_title": "Great culture and Purposeful Work", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "15 Sept 2022", "job_title": "Product Manager", "duration": "N/A", "pros": "The work is interesting and you get to exhibit your creative faculties as much as you want.", "cons": "The workload is not light"}, {"review_title": "It's Such a Privilege to be Part of Cake DeFi!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "20 Feb 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Founders of the company are amazing people, so it's not a surprise that the company's team members are also great individuals. The working environment is perfect for me too - structured enough for you to know your accountabilities while also having enough flexibility for team members to fulfill their tasks at their own pace and approach.\r\n\r\nIt really is a privilege to be part of Cake DeFi!", "cons": "The company and the sector that it belongs to (DeFi) are relatively new - but that's, actually, the same reason why people like myself joined."}, {"review_title": "Fast paced, great company culture and work environment", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "20 Feb 2022", "job_title": "Software QA Engineer in San Fernando, Pampanga", "duration": "N/A", "pros": "Company has diverse employees and culture, but everyone is respected. Good pay and gives out benefits. Lots of things to learn which can be an advantage to expand own's knowledge and eventually apply it in the future.", "cons": "Nothing that I could think of. Although the company is growing really fast, as long as you're committed in what you do, you're good."}, {"review_title": "Amazing work culture and top notch environment", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "22 Mar 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- Very good benefits (for example, the healthcare package)\r\n- Flat hierarchy\r\n- Great culture and working environment (this one is hard to find)\r\n- Diversity of team members\r\n- Flexibility", "cons": "Nothing I can think of as of now."}, {"review_title": "Amazing Team Culture & fasted paced crypto start-up", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "26 Mar 2022", "job_title": "Head of Community in Leeuwarden", "duration": "N/A", "pros": "Team Culture\nSalary \nFexible work\nRemote work", "cons": "Start-up (chaotic at certain points)\nFast paced"}, {"review_title": "Great company", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "26 Feb 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Awesome team, freedom to do your work without being micromanaged", "cons": "It gets hrd to catch up on communication at times, because there are so many conversations going on simultaneously"}, {"review_title": "Great team, but quite some pressure", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "20 Feb 2022", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great culture\r\nEmbitous projects\r\nCan bring in your own ideas\r\nValue driven", "cons": "No regular working hours\r\nPayment not as good als elsewhere"}, {"review_title": "This is what I feel", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "27 Oct 2021", "job_title": "Software Engineer in Kuala Lumpur", "duration": "N/A", "pros": "A lot of things to learn", "cons": "There is a lot of things to do"}, {"review_title": "Great team - Fast paced", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "23 Jan 2021", "job_title": "Visual Designer", "duration": "N/A", "pros": "Really awesome people. Everything is done based on merit and there's a culture of team mates recognizing and appreciating other team mates.", "cons": "Sometimes, things get really fast because its startup that's growing very fast, so you have to move at the same pace to keep up."}]]