[[{"review_title": "Unique and special company", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "11 Jul 2022", "job_title": "Airline Pilot", "duration": "N/A", "pros": "Great people and great product", "cons": "Sold to Alaska airlines so no longer in existence."}, {"review_title": "Virgin America", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "20 Apr 2022", "job_title": "Senior Payroll Specialist", "duration": "N/A", "pros": "Flying Perks were great.  The best", "cons": "There are not cons with the company"}, {"review_title": "Best Airline to Work For...EVER", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "29 Nov 2021", "job_title": "Customer Service Representative", "duration": "N/A", "pros": "Best Company to work for, I never had a bad experience, I looked forward to going to work every day and I knew that my work family was behind me 100% for any situation that came up.", "cons": "Towards the end, those of us who were able to stick around until the full acquisition took place, was like watching your best friend leave you forever. Every day, more people had left, and what remained was just a skeleton of a company that had been the best in the industry."}, {"review_title": "Fun and great company, crappy job position", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "12 Aug 2021", "job_title": "Guest Service Agent in San Diego, CA", "duration": "N/A", "pros": "Flight Benefits, A-lot of camaraderie with staff and co-workers, Fun corporate events to attend", "cons": "Flight Benefits on STANDBY, dealing with the front lines of angry and rude people especially during weather delays which seemed constant, not great pay for all that you are responsible for"}, {"review_title": "Best Airline Ever.", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "1 Jul 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great teammates and great place to work.", "cons": "Sad VX was acquired by Alaska Airlines."}, {"review_title": "Best Culture", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "29 Apr 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Culture, teammate centric, innovative, great flight benefits", "cons": "Acquisition to Alaska Airlines eliminated HQ staff"}, {"review_title": "Once in a lifetime", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "9 Apr 2021", "job_title": "Supervisor", "duration": "N/A", "pros": "They created an airline people loved.", "cons": "They didn't have enough to survive."}, {"review_title": "BEST Airline!", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "28 Mar 2016", "job_title": "In Flight Team Member in Jf Kennedy Ap, NY", "duration": "N/A", "pros": "Close knit community\r\ngreat reserve schedules\r\n13-16 days off a month\r\ngreat teammate environment", "cons": "With the good comes the bad... \r\n\r\nIf you commute, it can be challenging since VX does not fly everywhere. Not being able to commute on your own airlines can pose some commuter problems.\r\nWatch out for burned out JFK flight Attendants that hate their job- they try to make new flight attendants miserable. Watch out for Megan and her click. ( it's a small base and they know they can get away with it)"}, {"review_title": "5-week training", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "12 Jul 2015", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Wonderful opportunity to met new people and bring your talents to the table.", "cons": "In flight Management."}, {"review_title": "Flight Attendant for 7 Years", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "13 Jul 2015", "job_title": "Flight Attendant in San Francisco, CA", "duration": "N/A", "pros": "-Amazing co-workers - the Inflight Teammates, GSTs and Pilots you see at work are funny, dynamic and really make the work worth it\r\n-Interesting passengers\r\n-work for the \"cool\" airline\r\n-decent vacation benefits \r\n-good hotels on layovers\r\n-passengers love VX. They don't come onto the plane with years worth of \"chips-on-shoulders\", IE, they don't have a long standing hatred of flying on Virgin. It makes our job easier.", "cons": "-zero flexibility\r\n-no accountability from management or scheduling for \"bending\" the rules\r\n-favoritism \r\n-no trust on their part (requiring sick notes for every single sick call? puh-leeze)\r\n-terrible, awful maternity policy\r\n-bases are in very expensive cities: JFK, LAX and SFO, and the pay doesn't bode well for living there. Basically, you have to have a ton of roommates or someone else supporting you if you want to live in base. Otherwise, you need to commute, which is tough since VX has no commuting policy.\r\n-they don't consider this a \"career\"; that's why they offer a \"career choice buy-out\" every year to senior flight attendants, it's basically, here's 20k, go get yourself a real career because we don't want you here anymore......"}], [{"review_title": "Amazing company!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "24 Apr 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Virgin America is a great company to work for! From the mood lighting, great uniforms (no ties!) and music at check-in and gates. But now Alaska Airlines are in the process of buying us which isnt a bad thing but I HOPE they bring over everything that makes us Virgin. The AS teammates seem very thirsty for our hip/cool style! I have never dreaded coming to work.", "cons": "Some small typical things of a newer and growing company but nothing unreasonable."}, {"review_title": "I love the company & my job, but I strongly dislike \"Reserve\".", "rating": "3.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "16 Jan 2014", "job_title": "In Flight Team Member (Flight Attendant) in Los Angeles, CA", "duration": "N/A", "pros": "You do not work a normal mon-fri 9-5 w/only 1 week off for (maybe) a paid vacation. As inflight, you can have a \"vacation\" practically every month without ever really taking an official vacation. You get travel perks for yourself, your companion, parents, & friends. Other industry discounts are included as well. We have paid sick days, health care, 401K plans & other benefits. The company is growing & doing very well.", "cons": "Although everything looks good on paper, it is a very competitive and challenging industry to work for. Since we are non-union, you really have to fight for your rights & the rules can change any time. The schedule is highly demanding and half of your time is volunteered. The hourly pay is decent, but you have to pretty much cut your wage in half for all the time you put into the job (it does not compensate what it should). The scheduling department is an absolute mess & unfortunately it does interfere with your overall quality of life. Being on \"reserve\" is the most difficult thing about the job & most will say that the company has the worst reserve program industry-wide."}, {"review_title": "Love the company- Think the Local Experience could be better", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "10 Sept 2011", "job_title": "Guest Services in Las Vegas, NV", "duration": "N/A", "pros": "Great brand- elite clientele... people love to fly Virgin ! We have the best customers that want us to suceed as an airline. Good health insurance and 401k benefits. Good uniforms-  You have some flexibility to change or swap some shifts. HQ is great -", "cons": "Super low pay for the industry!! This is a tough job both physically and mentally... we should be compensated accordingly!! ( making $11 an hr.. should be more like $15/$16) . Most everyone working here has more than this job to make ends meet :(  You bid for hours-- you can end up with hours that do NOT work for you or your family ( nothiing you can do about it-- you are stuck with it until the next bid 3-4 months later).  Not enough vacation time off.  Some of the older hires are just doing time and not interested in going the extra \"virgin\" mile.   Airport work environment (village) could be improved for a better work day and peaceful place to take breaks/lunch."}, {"review_title": "Good company but lots to work on.. like many others ;)   LA Based Inflight", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "14 Nov 2012", "job_title": "Flight Attendant in Los Angeles, CA", "duration": "N/A", "pros": "The People! Amazing! I've made friends that I seriously never though I would. Flight benefits are ok..I've had better.. But with inflight you've got jumpseat agreements which are great! Money is not bad..for a relatively new carrier.. 1st yr 20 ,2nd 22 ,3rd 24 and so on.. Im sure pay scales will change. Minimum hrs is 70 max is 130.. If you work your butt off you can make good money. You get incentive pay after I believe 80 or 85 hours. But tax deductions suck!! Get married or make some babies. Lol.  Its a different culture here which will, unfortunately, eventually die but great while it lasts..Easy job, good $$!", "cons": "Health insurance is expensive.. Stick to your spouses insurance or your parents and save money! Job security is not very good here at Virgin.. Five years and still no profit,, Now they are asking for voluntary leaves and cutting down flights.. like half. Its great that they're doing something about it but its worry some when your load factor is at 70% after all that. Honestly.. If I we're you consider Southwest or JetBlue before you come here until (if) we succeed.  Its a great job but not much room for growth.. Besides lead position. If you want to move up the later you have to brown nose A LOT! Again great company but do yourself a favor and consider looking else where for something stable."}, {"review_title": "Pros and Cons", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "16 Oct 2016", "job_title": "Guest Service Teammate in Chicago, IL", "duration": "N/A", "pros": "Lots of responsibility, trusted with high security stuff, very interesting people, fun culture at times, cool uniforms, standby flight perks, get inside perspective on airline industry, meet a ton of people, free food around Virgin anniversary celebrations, company-sponsored \"office\" parties, lots to learn, better than most hourly gigs, doesn't require schooling", "cons": "Customer service job, airports are the place where emotions are high and everything is a crisis for the customer, training takes you away from your life for 3 weeks straight - to another state, not much opportunity for career growth, lots of favoritism in how you're managed, fear-based management, not a great deal of trust with your bosses, sometimes they're younger and more immature than your peers, standby is not exactly a fun way to live when hoping to travel as almost everything is a maybe, airport work hours can be crap - 4 am start and 4 hour shifts for example, full-time or part-time isn't guaranteed and changing between the two is a whole process, wearing panty hose and required makeup everyday means you spend a lot of money month to month on them, you have to worry about how you look constantly, the pay is pretty crappy, the management doesn't trust the headquarters \"higher ups\" to be transparent either, it's an edgy environment sometimes because of this."}, {"review_title": "Amazing corporate culture is often just a facade.", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "23 Oct 2014", "job_title": "Anonymous in Burlingame, CA", "duration": "N/A", "pros": "* The company attracts talent who is very passionate about the industry and providing good customer service\r\n* Everyone believes in the future of the company (very few openly dissenting voices) and proud of the company's accomplishments", "cons": "* There is a culture where some groups of employees are looked down upon -- folks who work in the airports are treated with less respect than the in flight team (flight attendants)\r\n* Airport station mentality persists into the corporate headquarters offering no flexibility when it comes to scheduling work time for employees\r\n* Compensation for employees at HQ is not competitive when compared with other companies (non-airline) in the immediate area\r\n* Lack of provided PTO -- Only 10 days per year\r\n* Employees who work at the corporate headquarters usually cannot take full advantage of the non-rev (free) flights due to limited availability during non-work hours\r\n* Some managers are more concerned with maintaining appearances over delivering results--style over substance"}, {"review_title": "Okay but not the best", "rating": "3.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "19 Feb 2016", "job_title": "Guest Services Teammate", "duration": "N/A", "pros": "Excellent flight benefits \r\nExcellent insurance even for part time employees\r\nBetter starting pay than most other airlines\r\nNice working environment with all the music and lights at the check in counters\r\nThey train you to do almost every position", "cons": "Somewhat a high turnover rate\r\nDeal with some selfish team members who don't care about anyone, but themselves\r\nFavoritism, as management will give assignments to certain people who cant even do the job\r\nNo room for career opportunities, the only thing close to an advancement is going to headquarters\r\nLimited vacation time \r\nEverything goes by seniority\r\nBe aware of status changes as once you are part time its better to keep it, if you change your status to full time it will be SUPER difficult to change back to part time\r\nHard to find shift trades/coverage due to new airline and having low amount of staff compared to legacy carriers\r\n\r\nOverall i would only recommend this airline if you want to have fun, but if you are looking for an airline with many opportunities and a career advancement then this airline is not for you"}, {"review_title": "Jmo", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "19 Jan 2016", "job_title": "In-flight Team Member in Los Angeles, CA", "duration": "N/A", "pros": "Fun place and great teammates.  Training was thorough and professional. Awesome uniforms, amazing airplanes and destinations. Long vacation type layovers.  Very impressed with the CEO sitting down & speaking to employees one on one at the hands on meeting.", "cons": "The only 3 bases are in the most expensive cities SFO, LAX, JFK, thought to come out ahead if you don't already live in your base city.  Great destinations just not enough of them to commute on your own metal which makes you last priority on every other airline. Probation period is a whopping 6months!!! Don't get sick in those 6 months because they have a strict 2 strike police which means you only get 1 strike... Second one = separation.    Flying time is not balanced among reserves, while some blocked over 100 hrs, others didn't break 40."}, {"review_title": "Inflight Teammate", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "22 Nov 2016", "job_title": "In Flight Teammate in San Francisco, CA", "duration": "N/A", "pros": "Fun culture, guests love the airline which makes your days easier, flight benefits, great uniforms, recently acquired by Alaska Airlines, the company is really trying to make things better by negotiating a new contract for he inflight team before the merge even happens", "cons": "The lack of cities Virgin flies to (making it very difficult to commute), the DRAMA and gossip are unavoidable (no matter which crew I worked with, they were speaking negatively about the company or others who worked there), low pay especially when you consider that the only bases they have are in the 3 most expensive US cities, you often have to remind crew scheduling of the work rules when you're on reserve because they seem to forget and not give you enough rest/work you hours that are too long, on-demand ordering on the planes ALWAYS had issues and it was a pain to never get a break on a long day of flying because of it"}, {"review_title": "Love / Hate", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "3 Apr 2014", "job_title": "In-flight Team Member in Burlingame, CA", "duration": "N/A", "pros": "Always changing and innovative. Full of energy and a fun environment to work. The people who work on the ground in the airports and in the air are the salt of the Earth. Best people I know. The flight benefits are great and we stay in some pretty great layover hotels. The company is doing really well and it is exciting to see just how far it has come in a few short years. It is non-Union which I happen to like.", "cons": "Management. There is a disconnect between the people who carry out daily operations and those in HQ. They don't consider work-life balance and will stretch the law of \"legality\" when it comes to length of work day, etc. It's also really disappointing that they don't promote from within. Often times \"favorites\" are selected for special assignment and such. The CEO has cringe-worthy social skills and often disregards the needs of the in-flight team- until they threaten Unionizing, that is."}], [{"review_title": "The corporate culture has been a unique & diverse experience,yet can differ drastically from airport station to station.", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "29 Jan 2015", "job_title": "Guest Service Teammamte in Jamaica, NY", "duration": "N/A", "pros": "* Customer service is promoted via a teamwork environment.\r\n* Music playing is permitted and can greatly help elevate your mood.\r\n* Travel incentives are cool and extracurricular actives are fun.\r\n* Brand brings a sense of  pride.", "cons": "* West Coast based airline, target attention towards west coast stations. Other stations get neglected.\r\n* Every airport stations is managed differently and somewhat independently, leaving room for much management error.\r\n* Pay scale varies based on locality, however quality and quantity of work is the same . Company blames airport ordinances & state regulations, yet insist they care about employees. Some employees are living in poverty levels."}, {"review_title": "Pretty good...", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "30 Mar 2014", "job_title": "Flight Attendant in San Francisco, CA", "duration": "N/A", "pros": "The people that work here are young and happy(no bitching bitter Betty's that have been here since WW2)and love their job which makes the work environment fantastic. By far the hottest uniforms in the industry and we also get free matching luggage. We're the only airline that has California bases (LAX and SFO). You are able to have two weeks off a month, if you like. Once you are off reserve and can hold a line, your life is awesome.", "cons": "The pay is way below industry standard (we top out at less than $40 an hour while most carriers get well over $50), there is no union for protection, the work rules are a grey area and can change depending on the mood of crew scheduling, the ZED fare agreements are nowhere near as good as other airlines. There isn't a lot of room for upward growth/mobility."}, {"review_title": "Excellent Culture", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "22 Jun 2016", "job_title": "Flight Attendant in San Francisco, CA", "duration": "N/A", "pros": "Virgin America makes an effort to hire all people from a variety of ethnicities and backgrounds. I believe this contributes to a work environment where people truly make an effort to treat each other with kindness and support.", "cons": "For a publicly traded relatively large company I think VA is doing a lot of things right."}, {"review_title": "Used to be great, after takeover don’t bother.", "rating": "2.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "29 Oct 2017", "job_title": "Guest Service Teammate", "duration": "N/A", "pros": "Flight benefits. It used to be a great company.", "cons": "This used to be an excellent company, with a fabulous corporate culture. Coming to work was fun, and as a smaller airline, you quickly got to know everyone from the CEO down. We did things differently, and won a lot of awards for it. Enter: Alaska Airlines. The subpar legacy airline was struggling to retain customers with its lackluster fleet and limited relevant destinations. They have quickly started stripping down the once excellent virgin product, replacing it with their own boring and dated versions. Virgin employees have lost schedule flexibility, weeks of Vacations, competitive starting wages, and worst of all, our spirit. \r\n\r\nOnce they get the single operating certificate, Alaska will finish gutting the Virgin name, and it will look like ever other boring airline. If you want to work for an old fashion carrier, I’d go with a bigger one, because at least you’d get better destinations to fly to. RIP Virgin America."}, {"review_title": "Best Domestic Airline 8 Years in a Row. Great Culture!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "11 Aug 2015", "job_title": "Guest Services Teammate in Dallas, TX", "duration": "N/A", "pros": "Great young vibrant company with tons of room for growth and new destinations. It's a small airline so will know people from different stations and HQ. Company really looks out for the employees. Company parties and events throughout the year where you can fly in and attend. Free flying after 30 days and going to training at HQ in San Francisco is AWESOME and paid.", "cons": "Pay starts higher than other airlines, but then other airlines catch up and beat the rate after a while. The uniforms are expensive so replacing an item can be a bit costly mid-year before yearly allowance; Dress is $100!  The number of buddy passes is low compared to other airlines, only get 8 per year. Hard to advance unless you are willing to relocate to San Francisco"}, {"review_title": "VA Flight Attendant", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "28 Feb 2016", "job_title": "Flight Attendant", "duration": "N/A", "pros": "They are a forward thinking, progressive company. Coworkers are awesome, customers are usually awesome, and the uniforms are really, really great.", "cons": "The price of living in all of Virgin's bases (NYC, LA, SF) are way higher than the starting pay is, so save up your money before committing to a job with them. Unless you're working 40 hours a week, you might struggle to pay your rent."}, {"review_title": "Be Virgin, Create Wow, Elevate People!", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "6 Nov 2013", "job_title": "Guest Service Teammate in New York, NY", "duration": "N/A", "pros": "-Free flights on Virgin America. \r\n-Discounted flights on other airlines.\r\n-Starting pay is higher than other airlines.\r\n-Comfortable uniforms designed by Banana Republic.\r\n-Monthly incentives/prizes to sell upgrades or other services.\r\n-Yearly training (\"Refresh\") at Headquarters in San Francisco can be looked at as a quick company-paid getaway.\r\n-The company genuinely tries to make it a fun work environment and throws parties or other events throughout the year.", "cons": "-Yearly raises are very small.\r\n-Little room/opportunity for advancement.\r\n-Work schedules can be undesirable. Ex: 4am shift.\r\n-Each supervisor has their \"favorites\" who get priority when asking for days off and such.\r\n-Management style at each station varies, which can lead to each airport doing things differently or unequal."}, {"review_title": "InFlight Teammate", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "28 Jan 2016", "job_title": "In Flight Teammate in San Francisco, CA", "duration": "N/A", "pros": "This is a great company to work for! They care about their employees and have amazing benefits. If you are very flexible with your schedule and love to travel this is a blend of an amazing job and an amazing company.", "cons": "The biggest downside to this job is that you are away from home a lot.  This is very hard to juggle with a family.  You are on reserve for a while so you spend a lot of time sitting at the airport waiting for someone to call in sick."}, {"review_title": "I love my job!", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "11 Apr 2013", "job_title": "Flight Attendant in San Francisco, CA", "duration": "N/A", "pros": "Company culture is truly amazing, I've never experienced anything like it before. Fantastic uniforms that are young and fresh. An amazing product that is incomparable- whenever I tell people that I work for Virgin they always respond with, \"I love that airline!\" Coworkers that are genuinely happy to come to work. Open door policy regarding questions/concerns. We have been voted \"the best domestic carrier\" consistently year after year and I truly believe that is because of the people that work here.", "cons": "Virgin is still a baby compared to most airlines (we're going into our sixth year) so there are a few growing pains. I wish the pay scale was a bit higher considering our three bases are in some of the most expensive cities in the U.S. (San Francisco, Los Angeles, New York). Reserve sucks (but that's at every airline). I wish we had more zed fare agreements. Insurance can be a bit expensive."}, {"review_title": "Virgin America is different", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "19 Jan 2010", "job_title": "In Flight Team Member in San Francisco, CA", "duration": "N/A", "pros": "If you are looking to work in the US domestic airline industry, Virgin America is the place to be. If for no other reason, then just for the fact that the majority of the people here ENJOY working here... something I can't say for nearly any other airline that I or my friends have worked for. There is a much stronger team spirit, and although we're still learning, there seems to be a genuine effort on management's behalf to make it a great place to work.", "cons": "It's still small, so you can't non-rev all over the country for free... but that will come with time. It's also challenging working in a start-up environment without any full-year profits yet... It means that salaries and benefits all have to run fairly lean."}], [{"review_title": "Looks great on the outside but deeply flawed inside.", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "16 Jan 2015", "job_title": "In-flight Team Member in San Francisco, CA", "duration": "N/A", "pros": "Awesome people to work with, new aircraft, cute uniforms, flexibility with seniority (but this is depending whether or not you are on reserve), travel benefits for you and your family, mostly great layovers and hotel accommodations.", "cons": "Hardest working crew in the industry (with on demand ordering system) yet the lowest paid (with 3 bases in the 3 most expense US cities). Management is more focused on awards and image than employee needs and satisfaction which is why we voted for union. InFlight is grossly understaffed. The reserve program is inhumane (no flexibility, work twice as much, make very very very little money, forced to work into days off frequently)."}, {"review_title": "Inflight Team Member for 4 years", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "22 Jan 2018", "job_title": "In Flight Team Member in San Francisco, CA", "duration": "N/A", "pros": "Wow at the beginning this was THE place to work! And we all loved it! Best uniforms, great benefits, felt like a huge family and everyone loved being there! We felt pride in what we were doing even if it was a grueling red eye!\r\nBoy did that change when the company went public. It only took a few months after going public that you could tell that things were already starting to change. Then the offers to buy us started rolling in. Rumor after rumor and we finally sold out to Alaska and the rest is history. They essentially killed Virgin America even though they will say they want to implement what Virgin America stood for into their workplace, it will never be up to the standard that we created and worked towards!", "cons": "Sold out to Alaska... \r\nNot competitive pay scale, compared to other airlines"}, {"review_title": "Good place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "13 Sept 2016", "job_title": "Reservation Agent in Farmers Branch, TX", "duration": "N/A", "pros": "I have worked for Virgin America for 8 months and I really like it. The basic group of customers are rich and spoiled but it takes a lot of self control to speak with an irate customer and get them the help they need while they are demanding you to do it their way instead of the Company way. It's a great job great people and point system, they work with you well and the points drop off after 6 months.", "cons": "It can get loud with new agents coming in not understanding the concept, but, they soon learn to lower it down and be mindful of the other agents on the phone."}, {"review_title": "A wonderful place to get well-rounded experience", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "18 Oct 2014", "job_title": "Anonymous Employee in Burlingame, CA", "duration": "N/A", "pros": "The team culture at Virgin America is special. Most people are aligned with the idea of creating an airline people love (to fly, work for, root for, etc). New ideas and innovation are prized. It's a wonderful place to take risks and learn a lot about many different topics. Leadership tends to be collaborative, open-minded, and inspiring. Work/life balance is exceptional. Generally 9-5:30. Travel benefits are fantastic - free standby for you, spouse, children, and your parents!", "cons": "Career growth is limited, as it is a very flat organization (which is good in many ways). Promotions are tough to come by. Salaries are also on the lower side, as the airline industry is very competitive. It's tough to keep up with the cost of living."}, {"review_title": "Not what I thought it would be...", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "27 May 2014", "job_title": "GST in San Jose, CA", "duration": "N/A", "pros": "The people are great! It was my first time in the airlines industry the schedules are really flexible, great training, huge on TEAM! Great benefit incentives", "cons": "Upper Management are NOT experienced, being at the airports and being the part of the front lines was pretty rough, many times In-flight was pretty rude to GSTs and consistently complaining, Beware in the industry that lots of people are two-faced, and situations which occurred at stations was not really solved properly due to favoritism. Constantly promoting inside growth but always hiring from outside company."}, {"review_title": "Fun uniform & cool mood lighting but not a place to build a career", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "19 Mar 2012", "job_title": "Flight Attendant", "duration": "N/A", "pros": "Great uniform, fun and young coworkers, company is well-loved by passengers, lots of freedom to express yourself, the company is always hiring so you gain seniority very quickly", "cons": "The company plays favorites, flight attendant training was not in-depth enough (during first aid training we wrapped a coworker in bandages?), many GSTs in SFO are completely inept, flight benefits may seem good to those new to the airline industry but in reality they are weak compared to other airlines, many employees have serious hang-ups/bitterness about their previous airlines"}, {"review_title": "So proud to say I work for Virgin & being part of growing our record-breaking award-winning airline.", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "14 Aug 2014", "job_title": "Flight Attendant in San Francisco, CA", "duration": "N/A", "pros": "Wonderful group of flight attendants and pilots. Great blend of  backgrounds, personalities and demographics. Young airline, yet has won top awards for service and best domestic airline every year from the start to 7 year anniversary last week.  Upscale airline, yet friendly, energetic, saucy crew. Union voted in just today and once contract is approved, positive changes for the flight attendant group should follow.  The flight attendants are extremely proud of the recognition received for exceptional service from passengers, but are very frustrated with the lack of credit and compensation received from upper management based on those results considering the time and work put in to making and keeping this start up airline the award-winning airline it is. Beautiful planes, cabins, uniforms, headquarters, airport crew rooms, terminal (SFO), destinations, layover hotels and flight attendants (inside and out). Very green, progressive, high-tech, fun-loving, high-style airline .", "cons": "San Francisco is the most expensive city  and SFO has the third worst delay stats (ground delays mainly due to the rain/fog/low cloud cover).  Hardest working flight attendants in the industry due to at-seat ordering, nonstop personal service and attention to detail."}, {"review_title": "There is no better airline to work for", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "28 May 2016", "job_title": "Manager in Burlingame, CA", "duration": "N/A", "pros": "Lean HQ makes for entrepreneurial spirit and great collaboration. Each teammates work counts and has a visible impact across the organization. Very casual atmosphere, from the way people dress to interactions with each other and highest levels of leadership. A brand that resonates - teammates are proud to work for Virgin and it can be felt across the organization.", "cons": "Payed time-off and telecomuting policies need updating to be competitive in Bay Area. 2 weeks yearly PTO for HQ teammates is well below what peers at other Bay Area companies get - work life balance would be much better if it was not for that."}, {"review_title": "Not a good fit for me", "rating": "3.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "14 Dec 2015", "job_title": "In Flight Team Member in San Francisco, CA", "duration": "N/A", "pros": "Quick moving seniority, small company. Union contract in the works. great travel benefits, though this is true with nearly any airline job.", "cons": "Still a very young company, the management team needs far more experience. The training program is lacking and uninviting. Limited base options. The culture within the company does not promote a high level of customer service. (its totally OK to be rude to the passengers). The starting pay is terrible."}, {"review_title": "Cool job", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "25 Apr 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Virgin America is a fun company to work for. The free flight benefits are the absolute best! You will see many different cities very quickly once you start flying.", "cons": "Very tiring job in general. At first you will be on reserve, and so you must be mentally prepared for that. Training pay does not kick in until training is done. So do not expect to get paid after two weeks of training."}], [{"review_title": "Great Culture and Brand", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "7 Dec 2016", "job_title": "Anonymous Employee in Burlingame, CA", "duration": "N/A", "pros": "Virgin has major brand recognition and quite a following among consumers - great for the resume. They truly look out for the \"guest\" and make decisions in their best interest. For the most part, this includes their internal teammates. \r\n\r\nDue to the buyout by Alaska, I think their internal culture amongst teammates is even stronger. \r\n\r\nFlight benefits are awesome!", "cons": "There is a bit of a disparity between the internal and external brand. However, not much of that matters too much now since they were purchased by Alaska :( \r\n\r\nWas not much internal career growth and some senior level positions were filled with people that shouldn't be in them.\r\n\r\nLimited vacation time didn't allow for full use of flight benefits."}, {"review_title": "Guest Services Teammate", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "10 Jun 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Some of the best co-workers I've ever had. Sweet people who just have a list for people and adventure., Virgin America was really good at selecting people who were flexible, honest, and fun. I enjoyed going to work and even now I still go on trips and adventures with the people I've met here.", "cons": "Bought by Alaska Airlines. Boring, stuffy, old. Their managers are mean , they're associates are unnecessarily cold and rude to one another. The rift between guest facing and inflight positions is baffling. They are the most elitists people to work with."}, {"review_title": "An Incredible Company to Work For", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "12 Dec 2014", "job_title": "Guest Services Teammate in New York, NY", "duration": "N/A", "pros": "From training to actually working there, the experience has been amazing all along the way. The company culture follows the Richard Branson mindset: \"Screw it, Let's do it.\" They are really the leader in the industry and are constantly innovating. The company cares about its teammates, guests, and the experience more than money. There are also plenty of opportunities for movement and improvement in the company.", "cons": "Low pay but the companies provides plenty of benefits throughout the experience, from the little things like food vouchers to paid travel, training, and stipends. The company is still growing, however. It should get even better. \r\n\r\nIPO has already had a few negative effects on some teammates such as the in-flight."}, {"review_title": "Great place to work!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "4 Dec 2010", "job_title": " in San Francisco, CA", "duration": "N/A", "pros": "Virgin America is trying to \"make flying fun again\".  In the process they like for their own employees to have fun at their own jobs and as a result have a positive impact on those passengers who fly with us.  They look for positive outgoing people who are good at what they do, like working in teams and helping others.", "cons": "The only negative that I can think of is the airline is still relatively small....but we are growing fast.  So if you want extensive flying benefits it might be a while."}, {"review_title": "Great place if you want it to be!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "10 Sept 2014", "job_title": "In-flight Team Member in San Francisco, CA", "duration": "N/A", "pros": "Small enough to meet all 3000 employees at some point in time. \r\n\r\nGreat culture. \r\n\r\nForward thinking. \r\n\r\nListens to employees suggestions (it may take awhile for implementation).\r\n\r\nFree travel on airline, and discounts on many others (domestic and international). \r\n\r\nRefresh- Paid 2-day work retreat. \r\n\r\nMany promotional and marketing events you get invited to attend. \r\n\r\nThrows great party events. \r\n\r\n401k matching\r\n\r\nGreat medical benefits", "cons": "Being a newer airline means not all the kinks have been figured out. With that said, you could become a part of making it a better workplace. \r\n\r\nPay is slightly lower than average, yet if you only work 10 days a month don't expect 100k... \r\n\r\nA lot of bitter Betty's who think everyone is conspiring against them. They have this paranoia fixation that the HQ is worried about everything in their life bubble.  Also, most haven't had a real job like the rest of the world (From new graduates who have not established a real world work ethic to the crew members who just airline hop and complain how it's not like their last airline).\r\n\r\nOf those 45% bitter Betty's, 40% are the laziest people you would encounter OTJ. They are completely miserable with their personal lives and bring it everyday to work so that they can share their load of crap that they brought upon themselves.  \r\n\r\nReserve sucks and seniority rules. Welcome to the aviation industry.  With that said if you can't be on call for 22-23 days a month on a smaller salary like everyone before you did, then this is the wrong place. It may be a while before you hold a schedule, but at least it won't be 20 years later like southwest, American or united. Don't waste your time applying.  Ultimately you want this job because of the travel benefits."}, {"review_title": "Inexperienced leadership, and alot of favoritism", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "14 Jun 2013", "job_title": "Guest Services", "duration": "N/A", "pros": "You get to fly for free or at low cost", "cons": "Leadership in the stations lacks proper training, and there's plenty of favoritism. Policies and procedures are not properly explained to GST's, a manager will penalize you and the best they will say to you is it's company policy, what's even worse they don't understand the policies themselves, and constantly give you misinformation. ALOT of people quit while i worked there.\r\nThe pay is terrible, though the company tries to portray that its a nice place to work with their expensive uniforms and nice check-in stations. Please don't let the image fool you. Promotions are based on who you make friends with never hard work."}, {"review_title": "Great Perks, but bad management.", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "19 Mar 2014", "job_title": "Marketing in Burlingame, CA", "duration": "N/A", "pros": "Depending on your lifestyle, the travel benefits and the hotel discounts are amazing. If you're single, love to travel by yourself and bounce around from city to city on the weekends ... working at Virgin America can be a dream job.", "cons": "Zero work life balance. They don't believe in promoting internals employees. I've seen amazing people get overlooked for higher positions, and someone new brought in. Good luck on ever getting a significant raise, and they expect you to work 24/7 for very little pay."}, {"review_title": "Management has changed and Alaska isn't looking better", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "30 Sept 2017", "job_title": "Flight Attendant in San Francisco, CA", "duration": "N/A", "pros": "Great group of teammates in every department that still have the virgin spirit of running a great airline and having a good time while you do it. Nice benefits package.", "cons": "Management doesn't follow that code like it used to and has turned to micromanaging and taking away the empowerment that frontline teammates used to have to show our guests that this is the greatest airline. It's limited to individual teams who still exude the virgin brand of \"Screw it, Let's do it\""}, {"review_title": "Great company, still an airline, no cost of living for the Bay Area", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "27 Oct 2015", "job_title": "Aircraft Dispatcher in San Francisco, CA", "duration": "N/A", "pros": "Innovative products, truly customer experience focused, fun work atmosphere, good flight benefits, good medical, dental, 401K etc, great city to work in.", "cons": "Airlines are always volatile, San Francisco area is OUT OF CONTROL for housing cost and Virgin does not do any cost of living adjustment, newish company so pay and benefits are still being determined (no pay scale increase after the 10 year mark)"}, {"review_title": "If you're a true airline professional, keep looking", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "2 Oct 2017", "job_title": "Flight Attendant in San Francisco, CA", "duration": "N/A", "pros": "Amazing teammates, wonderful support among colleagues", "cons": "Awful pay, broken promises, terrible work rules and terrible management.  The only bright spot about working for this airline was the support we had from each other.  If you are a pilot or flight attendant do yourself a favor and work for a real airline.  Virgin's potential was squandered by bad management and inexperience.  The Eskimo will never allow the Virgin spirit to survive...brace yourselves."}], [{"review_title": "good fit for right person", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "13 Sept 2012", "job_title": "Pilot in Burlingame, CA", "duration": "N/A", "pros": "Energetic and exciting atmosphere for a young person especially. \"Hip\" culture. Massive room to grow.", "cons": "Spotty training department. Longer hours than established airlines, lower pay, and lack of good work rules or contract. Pilots only paid when aircraft is moving 5 mph or greater, unlike others. (no pay during pushback, or parked off the gate) Trip patterns do not take circadian rhythms into account at all. It is not unusual for a trip to end in the morning and be scheduled for a \"redeye\" the same night after a 12 hour \"rest\" at home base in mid-day. Frequent firings."}, {"review_title": "GREAT CO-WORKERS, HORRIBLE MANAGEMENT & HQ OPERATIONS", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "25 Sept 2012", "job_title": "Flight Attendant", "duration": "N/A", "pros": "will work with some of the most amazing flight attendants around\r\namazing product - best planes, great flying experience, great destinations", "cons": "low pay\r\nfavoritism\r\ninconsitent work rules\r\nmanagement as a whole\r\npoor financial management, company is slowly heading to bankrupcy \r\nOnly room to advance if you're at HQ or willing to move/stay in very $$$$ San Francisco area"}, {"review_title": "IPO & Pay", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "25 Nov 2014", "job_title": "Pilot in Los Angeles, CA", "duration": "N/A", "pros": "We just went public so we can expand.", "cons": "Lowest employee payout from IPO in recent history. Told us we would be getting much more $ if we held in there and worked hard. No stocks, but money ranging from $1,000-$3,000. Executives received millions. \r\nSalaries were supposed to be competitive but are not. Plenty of excuses. \r\nEmployees are shocked and morale is low. We have shelves of awards and feel undervalued."}, {"review_title": "Great place to work until it was acquired...", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "20 Nov 2017", "job_title": "Anonymous Employee in San Francisco, CA", "duration": "N/A", "pros": "Travel Benefits - Fly for almost free, Wonderful teammates and events", "cons": "Red Tape, some people aren't recognized till it's too late and some are promoted so quickly - just got worse post AS -VX acquisition."}, {"review_title": "Management still needs much improvement.  I don't think they realize this is a 24/7, 365/day operation. unanswered email", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "18 Jul 2010", "job_title": "Flight Attendant", "duration": "N/A", "pros": "Living and working in the San Francisco Bay Area.  New Planes to work in.  In-Flight Entertainment is great when properly working.", "cons": "Favoritism is big time here.   Management really needs more leadership experience dealing with employees.  Lack of support for front line females that are expecting children.  Think they want their employees to remain Virgin.  Hence  the name."}, {"review_title": "Bipolar Through and Through", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "29 Jan 2013", "job_title": "Business Systems Analyst in Burlingame, CA", "duration": "N/A", "pros": "Passionate colleagues, great brand, awesome product, challenging industry with lots of room for disruption.", "cons": "Senior leadership need to get their act together, lots of HR infractions by previous CIO, conniving and back-stabbing galore, lack of organization, highly political, rapidly losing the Virgin culture that really made the brand."}, {"review_title": "Could be better, should be better", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "8 Dec 2015", "job_title": "Guest Services Teammate in Fort Lauderdale, FL", "duration": "N/A", "pros": "Very open company, clear goals, job is fairly easy and better environment than most airlines", "cons": "- Pay structure isn't great but better than other airlines. But OT pay is next to impossible to get, even working 60 hrs.\r\n- Hard to get ahead and move up unless you are willing to move to another city to take a position, and even then favoritism with candidates inside and outside the company (most times managers know who they want for a position before even opening it up, so you interview without a real chance of getting it)\r\n- HQ in San Francisco is your best bet to get the best experience in this company as it's where the culture is stronger and more respected and open.\r\n- Culture varies station to station with managers doing things their way and interpreting rules to their benefit instead of system wide interpretation."}, {"review_title": "Make the reality match the vision. The work environment at the airports is discriminatory and therefore hypocritical.", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "12 Jul 2012", "job_title": "Guest Services in San Francisco, CA", "duration": "N/A", "pros": "Brand marketing is exceptional. The company's vision is readily apparent in all advertising campaigns.", "cons": "The work experience for employees at airports does not match the model touted by HQ. Airport management often ignores employees feedback despite Virgin's claims to put employees first. Management also engages in blatant favoritism which creates a divisive environment and leaves little to no room for promotion."}, {"review_title": "Not for everyone", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "2 Dec 2015", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Every day is different.  You meet new people, including the crews that you work with. Exploring new areas of the country is exciting if you are lucky enough to get layovers in great cities. \r\nPersonally I love it.", "cons": "If you are not a people person or have a thin skin, this might not be for you.  You also have to be very good at self management and dealing with a wide variety of personalities. \r\nThe pay scale, while standard for the industry, is low."}, {"review_title": "My past 10 years at Virgin America was a Dream come true! Getting to be part of a start up Airline in 2007 was Awesome.", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "I had the privilege to be involved in all aspects of opening up a station. VX became an Award winning Airline year after Year. The best experience I've ever been part of..", "cons": "Joining VX with 18 years of a Legacy Airline Leadership experience , it was hard starting from scratch. The Company's vision, and values, is what helped us all get through this rough patch."}], [{"review_title": "Best experience of my life.", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "7 May 2013", "job_title": "Marketing in Burlingame, CA", "duration": "N/A", "pros": "I had two unique job roles at VX and had an opportunity to get my hands dirty on a lot of projects and open myself up to a plethora of new opportunities. I had the opportunity to access experiences no one else would. It is a company that is growing and has so much potential, and the people are what also makes it a great place to work.", "cons": "The reason I left was growth. I could not go above where I was positioned at the time and I really needed more money and growth."}, {"review_title": "Love working for Virgin!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "13 Jul 2013", "job_title": "GST", "duration": "N/A", "pros": "Fun place to work and the company cares about its employees and it's customers. They like \"being Virgin\" and love to do things in a new funky way and challenge the airline status quo. Great flight benefits!", "cons": "Pay could be higher. Also, since the airline is newer there aren't as many cities from which to choose. It is a West Coast based airline so employees living on the East Coast miss out on a lot."}, {"review_title": "Great company, great people.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "9 May 2016", "job_title": "Guest Services Teammate in Boston, MA", "duration": "N/A", "pros": "Flexible schedule and good co workers make this job one that's easy to come to everyday. \nYou get to travel the world for next to nothing. \nIt's fun to hear about guest trips and meet many different types of people.", "cons": "Parking at the airport can get pricey, and traffic going to and from can definitely become annoying. You have to pay a toll every time you leave work..."}, {"review_title": "Great company culture but diluted at station level, open communication from HQ, flexibility for guest services teammates", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "6 May 2014", "job_title": "Guest Services Teammate in Sterling, VA", "duration": "N/A", "pros": "There's a great culture at HQ, it's sad that at the station level it's not as great. It seems to get more diluted the further away you are from HQ. Leadership is great at HQ however it seems to vary greatly station to station depending on the manager. \r\n\r\nIt's a great place to work as far as scheduling as it's extremely flexible for guest services teammates and it definitely is the best airline to work for as far as culture, especially as a first airline. It is a totally different airline. Best product, best planes, great teammates. \r\n\r\nBest of all, if you can work part time, like me, you can take advantage of the the travel benefits and work as little as 2 days a week (or 8 days a month) and you're done. Also, you get the option to switch from part time to full time almost every time the work schedule changes (about every 3-4 months). \r\n\r\nIt's growing rapidly and it has a lot of potential as far as continuing to be the best airline (to work for and to travel on).", "cons": "It is difficult to get ahead if local leadership doesn't  want to promote you. In general there are opportunities, however you have to be willing to move. If there is an opportunity at a local level your chances depend greatly  local leadership and how they feel about you. Since it varies station to station (which is normal) you could have a very supportive team or a very negative team (or leader/manager). You can put in a lot of work above and beyond what is expected of you as a guest services teammate, try to help out your station,  only to get back a lot of negativity. Morale is reviewed by HQ leadership once a year, yet is completely ignored by local leadership. \r\n\r\nTeammates that complain to HQ about every little thing, mundane or not, get special treatment/consideration from local leadership (seemingly out of fear)."}, {"review_title": "Very good experience overall.", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "5 Jun 2011", "job_title": "Intern", "duration": "N/A", "pros": "Good atmosphere at the headquarters. The culture that was amazing. People were amazing and they are motivate to work. Not only do they want you to succeed, they are interested in your career path as well.", "cons": "Location was not the most ideal. I would have liked to be located in the New York, Los Angeles, Miami, or Dallas office. The Bay Area was not the most ideal place to be."}, {"review_title": "Being new to the airline industry and working for such a well-liked airline, has truly been an honor.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "28 Aug 2013", "job_title": "Guest Services Teammate in San Francisco, CA", "duration": "N/A", "pros": "The employees and the guests are very friendly and have very interesting stories to share.  Working there has helped me learn how to handle different types of people and situations.  I feel like I am a more patient person.", "cons": "Having to give our guests any bad news such as letting them know that they have missed their flight and there isn't one until the next day, is a real drag."}, {"review_title": "Take-off with Virgin", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "8 Oct 2015", "job_title": "Anonymous Employee in Los Angeles, CA", "duration": "N/A", "pros": "You are a self managed work force.  You get to constantly travel and get great travel benefits.  There is a also a lot of opportunity to get involved in lots of different aspects.  The company does seem to genuinely care about it's employees.", "cons": "The initial is quite low due to how many hours you are legally allowed to work.  The job is also physically demanding and has a very atypical schedule."}, {"review_title": "Good work / life balance but limited career growth opps", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "21 Jun 2016", "job_title": "Senior Analyst in Burlingame, CA", "duration": "N/A", "pros": "Good work life balance due to telecommuter policy, everyone can work from home one day a week. Generally cool, interesting co-workers, great benefits, including unlimited flights, 401K, health insurance etc.", "cons": "Salaries on the lower end in the Bay Area, higher than standard in airline industry. Very limited support on career growth, rarely any opportunity for promotion to a manager role. Vacation policy poor, only 5 days in first year, two weeks after and 3 weeks after 5 years of service."}, {"review_title": "Inflight Teammate/Flight Attendant", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "27 Jan 2017", "job_title": "In Flight Teammate in San Francisco, CA", "duration": "N/A", "pros": "Co-workers were some of the best I have ever worked with, cared about guests, eco-friendly for an airline, flight benefits, great company culture.", "cons": "Some pretty big promises made in the beginning to employees were broken. Felt like some management was indifferent and the ones that weren't and really wanted to help would really try but had their hands tied. This was not necessarily how it felt in the early days."}, {"review_title": "Part Time Guest Services", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "8 Jan 2018", "job_title": "Guest Services", "duration": "N/A", "pros": "Flight benefits. Everyone is really nice. Its a great place to meet people. Benefits are offered for part timers which is great!", "cons": "Low, low pay. Union dues. This is a great job for someone who lives at home and doesn’t pay rent or is married and has a solid income from your significant other. No one can survive on this job as a living career. 5 (4 hour shifts) near impossible to find another flexible part time job as you bid on shifts by seniority. No time to use the flying benefits and when you do, you can’t afford anything!"}], [{"review_title": "Work Here!!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Great place to work. \r\nMost have a great time.\r\nOpen Door Policy allows access to everyone, incl CEO.\r\nFiguring how every other airline is going out of business, and we just got our 2nd pay increase in 2 years, I feel compensation is strong.", "cons": "Management needs more help.\r\nStart up atmosphere makes it hard to open up new positions.\r\nVacation time sucks for both front line and HQ positions."}, {"review_title": "Great company, lackluster department", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Positive overall corporate culture\r\nFlight benefits on Virgin and variety of airlines worldwide\r\nWillingness to negotiate with salaries most likely due to competitive bay area environment (not locked in to a company-wide annual merit increase)", "cons": "Finance takes a backseat to the operation as in the words of the CEO \"I don't care what finance says, you do what you need to do\"\r\nFeudalistic management style especially in groups where managers / directors have been with company since launch\r\nCorporate strategy not aligned across departments leading to redundant work, uncertain goals within departments and disillusionment with individual performance"}, {"review_title": "Disorganized company with inexperienced leadership", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "6 Apr 2013", "job_title": "Guest Services in Chicago, IL", "duration": "N/A", "pros": "The only real good thing about working for this company is a majority of the great people you will meet and the friends you will make.   Flexibility is good with being able to trade shifts, hours are not bad.", "cons": "There are so many things I don't like about this company.  The main things are they hire incompetent people to work for them because they care more about personality and looks than they do about how you can perform the job.  A lot of the people they hire at Virgin have strong personalities which causes a \"too many cooks in the kitchen\" atmosphere with strong opinions going left and right and nothing gets agreed upon or accomplished.  They like to hire inexperienced leadership, people with no experience to lead a team who have no social skills.  They promote egocentric people who get big heads after attaining a position of power.  On top of that the company itself is disorganized and they care more about doing what the passenger wants to be happy than abiding by company policies and procedures to make money.  Policies and procedures are inconsistent among the entire company as rules aren't ever consistently followed.  They aren't doing what they should be to be an airline that will be around for much longer.  Career growth/opportunities are null unless you want to relocate to corporate.  There is no growth for you at any of the airports.  If you want to come here for further career opportunities, think again because there won't be any unless you want to move to expensive San Francisco.  On top of that, compensation is low, benefits are not good like other airlines, senior leadership say they care about each of you, they don't."}, {"review_title": "Good temporary experience", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "12 Jul 2015", "job_title": "In Flight Teammate", "duration": "N/A", "pros": "Being able to travel anywhere was an amazing benefit, crews were fun and easy going to work with, having good seniority would get you the schedule you want (for the most part). It's a great job to experience for a couple of years. Innovative company willing to try new products and food companies to help other small businesses grow, especially Bay Area companies.", "cons": "Management was very difficult to work with. It really felt like they would not listen to what we had to say. The Scheduling Team was even more difficult to work with, it felt like there was a huge disconnection between scheduling and the inflight team. There was a lack of respect between the two departments. The work rules are very vague. There was so much grey area that even a supervisor didn't understand the work rules when I would bring up a work rule to their attention over a specific issue. There is very little room for growth. I left the company feeling very unappreciated. The management team always bloats about how Virgin America is the top airline and thanks us for it but doesn't treat their teammates like they're number one, especially in PAY. In the more recent times, there has been very little flexibility in scheduling due to low reserve coverage. If you call out sick, you are required to bring a doctors note, which made me feel like I was in a child in grade school again and it felt as if management did not trust us. They made promises and failed to keep them, especially when the company went public. Also, reserve life for inflight teammates is the worst. They need to come up with a policy to benefit their work/life balance. This company is huge on favoritism as well."}, {"review_title": "Virgin Experience", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "19 Aug 2015", "job_title": "Guest Service Agent in Irving, TX", "duration": "N/A", "pros": "Great company culture, and it's a growing airline with a promising future. Everyone in the company seems to carry a very easy going personality which is great for forming work relationships.", "cons": "It's one of the lowest paid in the industry, and understandably the operation is small compared to bigger airlines. But it is demoralizing at times. Also management tends to delegate bigger responsibilities to favored employees."}, {"review_title": "What you dream it to be, it might not be", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "14 Jan 2016", "job_title": "Anonymous Employee in Burlingame, CA", "duration": "N/A", "pros": "* Good experience for passengers\r\n\r\n* Free flying (when flights aren't full)\r\n\r\n* flexible hours", "cons": "* It's an airline\r\n\r\n* Limited vacation time\r\n\r\n* High turnover rate in some departments\r\n\r\n* Other departments may be different, but on the software development side:\r\n\r\n* Overall mood is quite somber and dull most times\r\n\r\n* Some projects get dropped on us with no warning or have lots of last minute changes thrown in\r\n\r\n* Engineers are not appreciated and supported. Leadership shows little interest in providing high quality projects. Instead of building talent and supporting continuous learning, there's more interest in outsourcing as much as possible. Some people get away with lots of mistakes and apathy. Want to show up at 11:30 and leave at 4:30 most days? No problem. Want to work erratically or break things without anyone caring? No problem.\r\n\r\n* The reward for doing good work is getting more work piled on you\r\n\r\n* No sincere effort to make it a good place to work–  If your idea of a good environment is having nerf guns to shoot at each other, you're all set. Otherwise you won't find perks like healthy snacks (there's a vending machine selling candy bars), or even basic meals offered after long hours on big projects. We don't have real team building events, or progressive things like electric vehicle charging. One of the strangest things is being charged money to attend the holiday party. That's right, you literally have to buy a ticket for the party.\r\n\r\n* If you like to be rewarded for hard work, feel your work is appreciated, that your opinion is heard and projects are well managed, then you might not feel the love here.\r\n\r\n* Real performance reviews are not done. You basically just fill out your own review."}, {"review_title": "Fun Company", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "12 Mar 2016", "job_title": "In Flight Team Leader in San Francisco, CA", "duration": "N/A", "pros": "This was a fun job since you get to travel a lot, I met so many amazing coworkers, schedule was somewhat flexible and it wasn't 9-5. Raises are pretty steep, which helps if you plan on staying with the company for more than 5 years.", "cons": "Disconnect between HQ/managers and people out in the field, managers don't have your backs at all time, low pay, sometimes you can get stranded with delays for hours and not get paid for it."}, {"review_title": "flight attendant", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "11 May 2015", "job_title": "Flight Attendant in Los Angeles, CA", "duration": "N/A", "pros": "great people to work with on the plane... great pilots and ground staff...", "cons": "eco sucks and so does managers... they don't care and try to fire you every chance they get... don't care how happy where are... treat us like dirt and don't give us time off.... blame us for world hunger and death in the world... we do no right by company.... we have amazing tech teams but can be fired for reading a kindal..."}, {"review_title": "Senior Management Change in 2008 Dramatically Changed Workplace Environment", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "18 Apr 2012", "job_title": "Director in Burlingame, CA", "duration": "N/A", "pros": "leading-edge product: low-fare and high-frills US domestic (limited international) air travel\r\nVirgin global brand: huge brand loyalty", "cons": "new CEO in 2008 dramatically changed workplace environment for senior management employees\r\nvery low pay scale for cabin crews and other customer-facing employees"}, {"review_title": "Working here was exciting and a great experience.", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "2 Jul 2015", "job_title": "In Flight Team Member in San Francisco, CA", "duration": "N/A", "pros": "The uniforms and the trench coat are very sexy. You feel proud to wear it and stand out.", "cons": "Upper management constantly looking for reasons to dismiss you than to keep a good, hard working person. No job security"}], [{"review_title": "Nice place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "16 Aug 2015", "job_title": "Tech Ops in Burlingame, CA", "duration": "N/A", "pros": "Excellent company to work full.  Aggressive and innovative leaders in the aviation field.  The people are friendly and open.  Plenty of growth opportunities.  Fun travel benefits.", "cons": "I have no complaints of the company as a whole but it is super expensive to live in the bay area.\r\nYou cannot buy a house on the peninsula, close to work, for under $500,000."}, {"review_title": "Awesomely Happy Place to Be!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "26 Jun 2016", "job_title": "HQ Contact Center Lead in Burlingame, CA", "duration": "N/A", "pros": "Going to work everyday is a joy! My team is made up of unique and hardworking people. The company gives its employees perks like complimentary tee shirts, celebration parties and worthy causes to participate in. Working for Virgin America has been a cause for much happiness in my life, and I will miss the laughter and camaraderie, as well as the hard but rewarding work of making sure our Virgin America guests have a wonderful flying experience!", "cons": "I cannot think of anything except to say, too bad we were bought out by another carrier."}, {"review_title": "Flight Attendant", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "23 Apr 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Virgin America hires AMAZING people and I will have life long friends from this company. I have also seen some beautiful places. They offer great health, dental and travel benefits and match our 401k 6%. The people team (human resources) is very helpful and reliable. As difficult of job as it is, I personally feel like a lot of the guests do appreciate my friendly nature and hard work.", "cons": "Management plays favorites. They promote who they like and put the wrong people in charge. The people above me and in charge of in flight schedules don't care about the front line at all! We are worked to the bone and extremely underpaid. We do not meet industry standards, from the pay to the schedules. Our raises are $1 a year.  Our gate agents raises are about 10 cents! Our QIP and Profit sharing are laughable. People work in the airlines for the flexibility of their schedules. You have zero flexibility here, unless it's a lucky day, and pretty much only at the SFO base. Vacation pay for us is worth 17 hours. We don't even have 4 day trips worth that credit. The only consistency here is inconsistency. Reserves are severely abused, working transcon red eye turns, worked into their days off, put on 24 hour rest on layovers to count as their days off, etc. We can't work 7 days in a row because of a 25.5 buffer rule the company put on us, where as the FAA has a 24/7 rule. The on demand ordering system has created a monster for us. I don't mind working hard, but pay me for it. The ordering never stops and neither does a long bathroom line clogging up the aisle. This company labels everything as a \"grey area.\" If you have a problem and need to refer to the work rules, everything is basically a grey area. Unfortunately my work group voted down our only chance at a contract and I think the pilots are still working on one. Don't ever work for an airline without a union. You have zero job security without one and sadly this company will just let you go like you never meant anything to them. They have been sued many times for as a result. Last thing, pep rallies at HQ that you are required to attend and paid for less than half the time you're there."}, {"review_title": "My experience at VIrgin America is above and beyond anything I could have imagine.", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "27 Oct 2011", "job_title": "Aircraft Mechanic in Jamaica, NY", "duration": "N/A", "pros": "Friendly atmosphere \r\nManagement cares about there employees and they are understandable when situation arises outside of work\r\nEveryone knows what's going on within the company because the CEO keeps everyone updated through emails and there is an all hands webcast that any employee cab listen in on live between the CEO and VPs", "cons": "There is Not enough flight destinations from JFK\r\nThere is not enough destinations to tourist locations\r\nMaintenance needs a larger maintenance office"}, {"review_title": "Best place I've ever worked", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "13 Jan 2014", "job_title": "Manager in Burlingame, CA", "duration": "N/A", "pros": "Virgin America is fun, vibrant, and energetic. The leaders of the company allow you to be creative in solving problems. The people who work at the company are great. The group is passionate about the company mission and each person is vital in achieving those goals.", "cons": "The company is rapidly growing. Wish some of the benefits could be a little more robust and creative (more vacation days to take advantage of the flight benefits, on-site child care, etc.)."}, {"review_title": "Inspiring company with little room for individuals to grow.", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "1 Jun 2014", "job_title": "Marketing in Burlingame, CA", "duration": "N/A", "pros": "The highs are very high--some exceptionally talented and ambitious teammates, exciting events and promotions, and an inspiring product that's providing a meaningful alternative in a broken industry.", "cons": "Because jobs are so coveted, there isn't much of an incentive for leadership to promote, reward, or in some cases, adequately appreciate the hard-working talent they employ."}, {"review_title": "I successfully completed the first step of the interview process but I am not employed currently", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "19 Dec 2017", "job_title": "Flight Attendant in San Francisco, CA", "duration": "N/A", "pros": "Great company to work for, great benefits, great people working for the company making it even better. I love working with people and this provides plenty of opportunity to meet many people from all walks of life.", "cons": "I have not successfully completed the interview process so I am unsure of the cons of working for the company. I hope to be employed very soon. From what I’ve heard the schedule can be challenging for some if they are not used to it."}, {"review_title": "Flight Attendant", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "6 Jan 2018", "job_title": "Flight Attendant in San Francisco, CA", "duration": "N/A", "pros": "Flexible Schedule, especially once holding a line. Flight benefits (domestic... international not as great as major airlines), nonroutine (I love it), new friends, chill culture, opportunity to make more money if you want!", "cons": "Supervisors are awful  and impossible to get a hold of, email, or get anything fixed. Pay could be better, but it will be changing soon with Alaska! Whoop!"}, {"review_title": "flight attendant", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "22 Jan 2016", "job_title": "Anonymous Employee in Burlingame, CA", "duration": "N/A", "pros": "The pros of working for this aviation company are that you can use the benefits to fly around the world, you get to meet interesting people and sometimes even celebrities on a daily basis, and the uniforms are nice.", "cons": "The cons to working at this aviation company are that there are many employees now, you may get lost in the herd. The company was run by a few \"popular\" kids and that made an interesting culture that, at my young age, I wasn't comfortable being a part of."}, {"review_title": "NOT as awesome as everyone thinks.............", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "13 Apr 2014", "job_title": "In-Flight Teammate in San Francisco, CA", "duration": "N/A", "pros": "Being a flight attendant was great!\r\nLearning about the aviation industry\r\nTraveling for fun at the last minute was awesome!", "cons": "What a scam because of favoritism and management sticking together from jetBlue\r\nEncouraging tattle tale work environment to be able to hire and fire so quick\r\nBeing a FA is hard enough but to be treated my management crappy too is worse!\r\nManagement is a joke! Most have been fired from other airlines.\r\nThe CEO, David Cush is trying to make it another American Airlines- #1 first city to serve Texas was Dallas #2 Terminal 2 serves both AA and VA #3 senior management are coming from AA"}], [{"review_title": "Great Place to Work!!! There's no loyalty when it comes to money", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "8 Jun 2016", "job_title": "Anonymous Employee in South Amboy, NJ", "duration": "N/A", "pros": "Great Atmosphere and work relationships! Every day is always something new and of course you have your flight benefits and you feel valued as part of the team.", "cons": "It is an airline so you're not guaranteed to leave on time. The pay could be a bit better but who doesn't want more money. Sadly it's being bought out by Alaska so it's to be no more so the ratings below will reflect that."}, {"review_title": "Upstart mentality, growing in to a full fledged airline", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "23 May 2014", "job_title": "In-flight Team Member in San Francisco, CA", "duration": "N/A", "pros": "Through the 6 years I have worked here, I have moved up the ladder on a few occasions.  Opportunities do come up and there is plenty of potential to build a career here. \r\nFun environment\r\nPilots and FA's work together", "cons": "little flexibility with swapping and dropping trips. \r\npay could be better, although it is constantly improving\r\nwork rules could be more consistent."}, {"review_title": "Inflight teammate", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "21 Jun 2016", "job_title": "Flight Attendant in San Francisco, CA", "duration": "N/A", "pros": "The guest facing co workers were a blast to work with. The perks were great and the aircraft models were a lot newer than other airlines.", "cons": "It was very difficult to communicate with management and expect timely professional responses. Effective communication would really help this bunch out. Guest facing positions here are one of the lowest paid in the industry."}, {"review_title": "Guest Services Teammate", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "13 Nov 2016", "job_title": "Guest Services in Austin, TX", "duration": "N/A", "pros": "The people who work for the company are some of the best people I have ever met. I instantly made life long friends from the very start. The benefits will open your eyes to worlds you never even dreamed of.", "cons": "The work rules change so often. The training process is very unstable and does not fully prepare you for the weeks, months, years ahead. Effective Communication is probably the weakest point of the company. Corporate has been very money hungry and even let Richard Branson out of his own brand."}, {"review_title": "VA teammates are amazing.", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "30 Nov 2015", "job_title": "Flight Attendant in San Francisco, CA", "duration": "N/A", "pros": "Amazing teammates who work on the front line. Fun cities to layover in. Amazing product that is easy to take pride in.", "cons": "Disorganized Headquarters and no real accountability in supervisor hierarchy when things go wrong. Front line teammates don't consistently have all the tools and supplies needed but are still expected to preform flawlessly."}, {"review_title": "Fun but need supplemental income", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "15 Dec 2015", "job_title": "In Flight Team Member in Los Angeles, CA", "duration": "N/A", "pros": "Not a typical 9-5. Great coworkers, fun atmosphere. Lots of time to travel. Travel benefits are a big perk. We're expanding quickly.", "cons": "You have no life when you're on reserve (about first 2 years of employment), always on call but reserve life is short compared to big airlines. Horrible pay. One of the lowest paid large domestic carriers but also the hardest working. Unless you're willing to be based in SFO not much opportunity for growth."}, {"review_title": "Great experience I will always take with me", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "- Benefits\r\n- Great HR department that looks into any complaints\r\n- Great teammates", "cons": "- Little room for growth\r\n- Some supervisors do not hide the fact they play favorites\r\n- leadership can be a bit disconnected at times (some hideout in the offices and come up only as flight is boarding)"}, {"review_title": "Virgin America (SFO)", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "11 Mar 2016", "job_title": "Guest Service Teammate in San Francisco, CA", "duration": "N/A", "pros": "Flight benefits\r\nLots of catering\r\nFun coworkers\r\nCute uniform\r\nIt's a new airline so lots of exciting new destinations being added\r\nRichard Branson occasionally stops in\r\nOfficial airline for the Giants\r\nProfit sharing\r\nSmall yearly raise", "cons": "You will not get promoted even if you are qualified to do so\r\nIf the manager doesn't want you promoted, you won't be\r\nManagement plays favorites\r\nIt seems as though only certain races get promoted\r\nYou bid for your shift every 3-4 months"}, {"review_title": "It was a mistake to leave my last job!", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "14 Oct 2014", "job_title": "Pilot in San Francisco, CA", "duration": "N/A", "pros": "Everyone you fly with are a really good group!", "cons": "Short and sweet, it's not what they advertise! Mgmt, goes out of their way to give off this fun, different, we care about people, if you take care of your people they will take care of your customers vibe. In reality, it's the same old, we need to cost less in your salary, make you work more for less, and give you less benefits only with a slightly hipper rap!"}, {"review_title": "Still enjoy going to work after 4 years.", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Good company to work for. Company culture is fun, interactive. Upper leadership are very approachable. Flight benefits are wonderful.", "cons": "Wish pay was more in line with the ever growing cost of living in the Bay area. Very difficult to live on as a single person. Company should offer more flex schedule to allow employees to live further away where it's affordable on their salary."}], [{"review_title": "You will LOVE your job. But. . .", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Amazing people work at this company. The culture is awesome and the experience is life changing. Very supportive and lots of room for growth if you want it.", "cons": "There's a lot of unrest and a lot of growing pains as a company between the workforce and corporate headquarters. You have to be very independent to be able to handle the stresses and politics."}, {"review_title": "Interview Process- Chicago 2015", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "15 Sept 2015", "job_title": "In Flight Team Member in Chicago, IL", "duration": "N/A", "pros": "Sounds like a great opportunity to work with a younger company and watch them grow", "cons": "Have to buy your own plane ticket and hotel for the face to face interview.  Anyone going to Chicago 10/26/15 let me know!"}, {"review_title": "Don't bother applying now if you want to be Virgin", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "2 Nov 2017", "job_title": "GST", "duration": "N/A", "pros": "A very fun airline to work for", "cons": "Virgin America is going away and Alaska Airlines as a brand is very different. Alaska isn't a bad airline, but if you're looking for the Virgin experience you won't find it with Alaska. Pay and hours are dreadful, and unless you have a second job or are otherwise supported, the only benefit to working here is the flight benefits."}, {"review_title": "Great airline", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "11 Sept 2018", "job_title": "Anonymous Employee in Burlingame, CA", "duration": "N/A", "pros": "Fun, fast paced environment, great teammates.", "cons": "senior managers:  For an innovative company they were pretty old school on managing.  really frowned on remote work.  Would not give titles/promotions due to being a \"flat organization\" which was baloney."}, {"review_title": "Inflight Team Leader", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "21 Sept 2015", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "They are a fun company that continue to put their employees first at all times.", "cons": "A lot of demand on our high seasons (summer and all holidays) and we used to have a shortage of employees, but now we are hiring so we shouldnt have this as an upcoming problem."}, {"review_title": "Memorable thanks to the people", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "7 Mar 2014", "job_title": "Anonymous Employee in Burlingame, CA", "duration": "N/A", "pros": "The people I worked with are some of the most talented and smartest I've ever worked with. Great brand to be a part of in terms of recognition as a disruptive force in an otherwise mundane industry.", "cons": "Lack of growth opportunity, low pay, sometimes long hours, lack of resources, short-staffed, organizational hierarchy can get to be a little tough to handle, flight benefits lose their magic after a while"}, {"review_title": "Guest Service Teammate", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "9 Sept 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "None unless you had a high seniority number.", "cons": "Zero up front communication regarding training and pay, fake personalities, upper management gossip, slander, and bullying.  In addition,  bidding experience for a reasonable schedule was a joke unless you had high seniority and those with high seniority would stalk and harass you so they could end up with the perfect schedule while you end up working over 35 hours as a part time teammate with zero benefits."}, {"review_title": "Awesome place to work if you enjoy a busy work environment & taking care of people all the time", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "27 May 2017", "job_title": "Pramugari in San Francisco, CA", "duration": "N/A", "pros": "Travel Benefits!, Amazing & FUN Co-workers, unpredictable daily tasks/challenges so you never feel bored.", "cons": "Hourly pay is below-standard and work rules are frustrating.  The schedule can be exhausting @ times & stressful.  People can be entitled, rude and/or mean."}, {"review_title": "Good company, chaotic department", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "20 Nov 2010", "job_title": "Crew Scheduler in Burlingame, CA", "duration": "N/A", "pros": "Decent benefits, fun environment.  The people  are very nice.  The flight benefits are really good and make it worthwhile to work here.", "cons": "There have been many changes in my department and most of them haven't been helpful.  It's very difficult to maintain a work life balance."}, {"review_title": "unless your 20 something you will have a very short lived time with them, if they even hire you...", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "10 Oct 2014", "job_title": "Supervisor in Las Vegas, NV", "duration": "N/A", "pros": "They started with a great concept, but its becoming Virgin AmericaN", "cons": "if your older you dont have a shot getting hired unless you know somwone and then you will still have trouble"}], [{"review_title": "In-Flight Team Member", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "4 Aug 2015", "job_title": "Flight Attendant in San Francisco, CA", "duration": "N/A", "pros": "Fantastic benefits, fresh, hip and forward thinking company that cares about the overall experience of their passengers.", "cons": "Pay, but thats for any airline :-)"}, {"review_title": "Airport Team Member", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "4 May 2016", "job_title": " in San Francisco, CA", "duration": "N/A", "pros": "Travel/Flight benefits-but that's with any airline", "cons": "There is much hype with \"hip\" culture.  Richard Branson is \"cool\" guy but he has nothing to do with how this\r\nairline is run on a  day to day basis.  This was a temporary stop for most of the training class, not thought of as career.  It's low paying, extremely political, unprofessional and the training department was horrible. Why would  you choose this as a career? The ones that did were arrogant, which I saw as extremely immature. Underneath it all there are deep problems at this company, thus the MERGE!!"}, {"review_title": "fun and customer oriented", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "4 Nov 2012", "job_title": "GST", "duration": "N/A", "pros": "- paradise for passangers\r\n- fun environment\r\n- innovative ideas \r\n-many young people fresh to the industry\r\n- constant boost and reminders of company culture and values", "cons": "- favoritism\r\n- putting guests needs way up high in the priority list\r\n- no internal guidelines or Policies and Procedures that leads to inconsistency in implementing company's policies throughout the company\r\n- expensive health benefit packages\r\n- no incentives"}, {"review_title": "Flight attendant", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "8 Oct 2015", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Awesome place to work for! Great benefits and people. Love to travel for free", "cons": "Not that many. Maybe pay could be more. Also, you have to be on reserve for 2 years when hired."}, {"review_title": "Guest Services Team Member", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "31 Aug 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "very upbeat, current with whats going on, friendly, enthusiastic, great planes, music at counter and gates", "cons": "at the time our current station manager was doing unethical things that eventually got her fired but everyone hated her.  also the name will be gone soon as they are now owned by Alaska Airlines."}, {"review_title": "Shocked at the good reviews", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Flight benefits (although they are somewhat limited due to Virgin's network alliances)", "cons": "Company is not doing well, has had a huge amount of turnover at the executive level and any culture that was there is eroding fast with financial pressures. It's truly a shame that the company is not more closely tied to the Virgin Group - I wish they had more sway here."}, {"review_title": "estimate bench mark statistics", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "16 Apr 2011", "job_title": "Intern Satistician", "duration": "N/A", "pros": "interesting and challenging problems are the key, the context of the problem is clear and I know what is expected of me.", "cons": "not enough man power to conduct the experiment even though the management initially promise they will hire another intern. Could be frustrating from time to time."}, {"review_title": "Disorganized. Dysfunctional. Disconnected. Delusional.", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "4 Feb 2015", "job_title": "Guest Service Teammate", "duration": "N/A", "pros": "Not what you think. \r\n\r\nIt is a unique type of work you have never worked in the airline industry and Virgin does have a well known and reputable brand. Each and everyday is different and faced with different challenges. Never a dull moment.\r\n\r\nI will give Virgin credit that after much internal criticism they did put together a “Work Rules Advisory Committee.” However, the committee has little confidence among GSTs as it is only advisory and many of the changes were already in the pipeline long before the committee was formed and do not address the core problems with the workplace culture. I will give them credit for trying on the committee but it is basically to tame the inevitable GST unionization.", "cons": "During my time with Virgin America, I tried so hard to like the company and rally around the brand but its breakdown in upper management, the naiveté HQ, culture of favoritism, and its cult of personality made it impossible.  \r\n\r\nVirgin has a great reputation externally but internally it is a category five disaster. Besides the below industry pay, lack of career growth, and breathtaking favoritism, Virgin America’s biggest problem is the disconnect between HQ and the stations. Each city runs as its own company with each having its own standards and policies. Those who work in California live in a bubble and it is worse the further you go. \r\n\r\nFor as small as Virgin is it can’t seem to get consistency. The GST Polices and Procedures have really done a big disfavor to the company as they write rules in a very complex and confusing way. Even if the rules are clear they are loosely enforced. HQ is bleeding with inexperienced individuals who truly don’t understand or want to understand the nature of the operation or the roles of others.  Virgin even has a policy that GSTs must get the permission of a manger or supervisor before the call of the police for any reason. This was even after the LAX shooting in our own terminal. My 5-year-old nephew knows to call 911 immediately in an emergency and not ask Mommy or Daddy for permission. \r\n\r\nAt first I thought Virgin was so edgy and innovative but that only lasted so long. It seems as if Virgin is stuck in 2007 and lacks vision to move into the future. In addition, every time you are in a group or in training all you hear is how Virgin is the best and how all our competitors suck. They force the Kool-aid and it turned into somewhat of a bully culture how they praised themselves by constantly bringing others down. Virgin will say how unique and special they are but when convenient they will revert  “ this is industry standard” when it comes to cutting health benefits or not raising pay.\r\n\r\nMy best advice is to keep a low profile and avoid stepping in the drama and corruption. After a certain point you may start acting like the child they treat you but still try to lay low. If you find yourself getting a seat at the table and being liked by your local managers, great! You have managed to do what many cannot. You will not be subject to the work rules and will have many exceptions made on your behalf. However, if that is not the case, I would use them like they use you and when a better job comes along….leave. This is not a career. Please, please don’t fall into the pit many do by holding out for advancement only to find yourself doing the same thing five years later and only having a pin to show for it."}, {"review_title": "Analyst", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "11 Apr 2016", "job_title": "Analyst in Burlingame, CA", "duration": "N/A", "pros": "The people and the environment make Virgin America the best company to work for. Everyone is excited to come and conquer the day and make people smile.", "cons": "I have nothing bad to share about working for Virgin America, Every guest I meet loves us, and it makes us love the company so much more every day.  The love shows in how people are treated on our planes and how people treat our teammates."}, {"review_title": "Best Place to Work", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "3 Aug 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "The culture that is formed here along with a love for the company by teammates is the best environment I've ever had in a workplace.", "cons": "It's harder to move to different departments if you wanted to experience different sides of the company."}], [{"review_title": "Creating WOW!!", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "24 Apr 2013", "job_title": "Pilot in San Francisco, CA", "duration": "N/A", "pros": "Changing the guest experience to become America's favorite airline.  Fun atmosphere, team oriented, and great brand recognition.  Very young fleet of aircraft with all the high tech amenities that business travelers need.", "cons": "We're still on the low side of the pay scale compared with our peers in the industry.  Still need some work on consistency of applying work rules."}, {"review_title": "Not what it seems.", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "30 Jan 2014", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "The caliber of people you work with, frontline peeps (pilots, flight attendants, gate agents, mechanics), are the best I have come across in the industry. Guests getting off the airplane rave at our service, our airplanes, our attitude. That is not common at other airlines, even the most successful airlines in terms of money generally tick off passengers off in great numbers on a daily basis.", "cons": "What you don't see... from the outside, is how inept management is at Virgin America. They started with a blank sheet of paper and has pretty much done everything they could do wrong in managing people, and done it in a big way.\r\n\r\n- Favoritism is rampant... snitch on a coworker? Well you just got a promotion!\r\n- Airlines are built on seniority, just like any other blue collar job. At VA, there are many examples in the Pilot and ITM ranks of seniority violations. Without a union, or honest management, there is nothing you can do about it.\r\n- The much vaunted \"open door policy\" that is talked so much about before you come on board or when you are new, is bunk. They don't want to hear your opinion or new idea. You end up being told that you don't understand the complexities and thanks but no thanks.\r\n- Management targets employees, threatens, intimidates, etc. Some of these managers are gone, but we have some new ones that still do the same.\r\n- Company will actually pay you to quit. They talk about building a family, a team. But what team will pay a member a portion of their salary to no longer work there after they are no longer useful to them? ITMs have had opportunities to get \"bought out\" after five years in exchange for resignation. \r\n- Pay is woefully under industry average. Pilots are 15-30% under industry average, ITMs (Flight Attendants) are even less.\r\n- Crew policy manuals are a \"guideline\" that is changed frequently to suit the company's needs.\r\n- Managers are able to apply any kind of punishment they feel necessary. Companies of this type generally have a roadmap, or a chain of events set forth so that all parties can see what can happen given a situation. Not at VA, managers can do whatever they want. If you are a favorite, then great, if not... \r\n- Company says money is tight and that they can't afford to pay standard rates for the industry, yet they spend money like drunken sailors (no offense to any sailors out there). Parties for the favorites are common. Company holds a yearly reprogramming seminar over two days called \"Refresh\". Takes two months, all employees MUST attend. Hotels, food, drinks, vouchers... all provided by the company. What do we do during this session? Let's see, ball room dancing, putting on car tires, assembling food (not cooking) in the theme of Iron Chef or something similar, act in skits, bang on drums. Yeah, that's worth two days away from my family and DEFINITELY teaches me how to fly or fix an airplane better."}, {"review_title": "Exciting time for growth", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "27 Aug 2010", "job_title": "Manager", "duration": "N/A", "pros": "Great company to work for. Very much a family atmosphere.  Always many activities going on and work is truly valued by management.", "cons": "Long hours with little vacation and personal time.  Pay and relocation package are below average, even for the airline industry."}, {"review_title": "Great coworkers...not so great pay and only 10/15 cents/hour annual raises.", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "6 Feb 2013", "job_title": "Guest Service in Los Angeles, CA", "duration": "N/A", "pros": "Free flights on Virgin America and some other local carriers. Able to trade shifts pretty easily.", "cons": "You pay an extremely high portion of your benefits out of pocket.  Very little room to advance, you likely will have to move to another city to get ahead."}, {"review_title": "Great Perks, inconsistent quality of management.", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "30 Mar 2014", "job_title": "Crew Scheduler in Burlingame, CA", "duration": "N/A", "pros": "Exciting place to work, and the company cares a lot about its customers! A lot of start-up, trial and error vibes internally.", "cons": "Most departments are underpaid compared to the industry. A good number of under-qualified people work at its Headquarters."}, {"review_title": "A lot of fun in a crazy environment.", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "4 Sept 2013", "job_title": "Airport Team Member in San Francisco, CA", "duration": "N/A", "pros": "Great co-workers.\r\nFun company environment.\r\nAwesome flight benefits.\r\nGood uniforms.\r\nGood opportunities for career advancement.\r\nFlexible schedule and shift trade opportunities.", "cons": "Inconsistencies with local station management.\r\nStill growing so sometimes TOO much change in policy when benefiting middle management.\r\nTough environment working with delayed or canceled flights."}, {"review_title": "Constantly Improving!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "2 Nov 2015", "job_title": "Guest Service Team Member", "duration": "N/A", "pros": "Constantly improving guest services (New IFE, New Planes, New Catering Options, New Destinations, etc). Medical/Dental/Vision cost didn't increase this year. Free flights on Virgin and ZED fares on other airlines. Lots of parties & celebrations during holidays/station openings.", "cons": "The compensation is much lower than all the other airlines. Not all stations are treated equal."}, {"review_title": "Can Mark research for Delta global services \nOffering online surveys to passengers. \nTh", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Only Monday-Friday you get delta flight benefits No weekend or holidays.  You work by yourself. \nI hated lying to people.", "cons": "You are working undercover spying on airlines.  You are working under a false company name. You are lie to passengers that you work for the airport when you work for delta. \nYou offering a survey card for upper management for delta. You are spying on all airlines. You travel every week to different airports."}, {"review_title": "Lots of Pros, More Cons", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "23 Nov 2014", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "The culture within the worker bees is awesome - flight benefits are great and hotel discounts are awesome BUT...", "cons": "Managers in place with very little airline knowledge.  They have no idea what lower level employees are doing"}, {"review_title": "Trying Real Hard", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Lots of really awesome people to work with.", "cons": "Lots of people that are niave and new to the airline industry. Some of the people in management have poor social skills, poor administrative skills, and have no airline experience that equips them for a job at an airline."}], [{"review_title": "Working here is a COMPLETE waste of your time, trust me!", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "23 Sept 2017", "job_title": "Guest Services Teammate in San Francisco, CA", "duration": "N/A", "pros": "- \"Travel Perks\" \r\n- \"nice\" coworkers \r\n\r\nWhy the quotations, I'll explain below", "cons": "-low pay ($14.47) for an overload of work and constant yelling from guests\r\n\r\n-hours are terrible, will have to work here for a long while until you can get the schedule that you want so expect to work either really early in the morning (4-6am) or late in the evening (3pm). \r\n\r\n-sure some of the coworkers are nice, BUT just when you think you're making good friends ha nobody is a friend here; it's almost laughable. \r\n\r\n-travel perks only good when you can go on your days off, which I can tell you will not be a weekend so good luck trying to travel with someone. AND WHAT THEY DON'T TELL YOU: If you're traveling with a travel companion (who is not your parents or spouse or children, i.e. domestic partner, significant other, friend, even grandma, etc.), you will get imputed taxed, which means that IT'S REALLY NOT FREE. It's FREE*        (* for fine prints).  \r\n          -even with your day off, you'll only be able to go somewhere for 1 day, 1.5 day if you're lucky. \r\n          -good luck trying to get people to trade or cover you when you want to travel longer or on say a weekend (for those of you with bf/gfs that have normal work schedules). Need an idea of how shady people are here? \r\n\r\nExample: I asked someone who I thought was nice and everything, if she/he didn't mind switching one of their days off with one of mines.\r\nHis/Her response: Thursday's are more work you know, I should get another of your days off.\r\n\r\n-last but not least, they're merging with Alaska Airlines, and so far, it's going downhill; most people have already left because of this. \r\n\r\nWhat am I trying to say? ALL-IN-ALL, none of this is worth the perks and stress."}, {"review_title": "Flight Dispatcher", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "19 Oct 2017", "job_title": "Flight Dispatcher in Burlingame, CA", "duration": "N/A", "pros": "It’s a great work environment with a fresh take on things.  Virgin America was a great airline to work for with an amazing group of teammates.", "cons": "Unfortunately, Virgin America’s brand is going away soon as it is now owned by Alaska Air Group."}, {"review_title": "Great product, brand and culture but still going through growing pains", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "18 Oct 2014", "job_title": "Analyst in Burlingame, CA", "duration": "N/A", "pros": "- Employees very proud of the product and the brand\r\n- Lots of opportunities to take on responsibilities outside of your job title\r\n- Perks - free flights and great 401K package", "cons": "- Little investment in personal growth and career development / poor incentives and promotion policy / lack of meritocracy. This pushes talent out of the door"}, {"review_title": "Good things and bad", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Great company to work for, great culture and great overall morale of peers. Hours are great too", "cons": "Currently going through a merger with alaska airlines so future is uncertain and lots of unanswered questions"}, {"review_title": "It's been a great experience so far....", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "21 Feb 2017", "job_title": "GST in Fort Lauderdale, FL", "duration": "N/A", "pros": "This position is great if you like dealing with the public and travel benefits. People you work with turn into family.", "cons": "Pay is low and hours can be long during the busy season. You work very close with coworkers... could be a blessing or a curse."}, {"review_title": "Pricing and Revenue Management", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "-Very progressive vision and thinking by the CEO.\r\n-Because the company isn't limited like most airlines by having built processes around outdated reasoning, Virgin has the ability to build from scratch best-in-practices processes.", "cons": "-Like any smaller company, Virgin doesn't have extensive breadth or depth of data for extensive analysis like some other airlines."}, {"review_title": "Satifactory", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "23 Aug 2015", "job_title": "Flight Attendant in Chicago, IL", "duration": "N/A", "pros": "Great benefits, great traveling experience and if you want growth the company is a great place to be.", "cons": "No transportation to training facility in San Francisco."}, {"review_title": "Flight Attendant", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "3 May 2015", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Co-workers are amazing.  Have not had one experience were someone wasn't  wiling to pick up a shift etc.  Flight benefits, the ability to travel and experience other cultures etc.", "cons": "Due to the nature of the job you can be away from family and miss holidays, birthdays etc. etc. On call."}, {"review_title": "Great Culture - growing", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "9 Nov 2015", "job_title": "Anonymous Employee in Burlingame, CA", "duration": "N/A", "pros": "Great airline that really cares about their people. The department you work in matters - as the culture can vary a little bit based on department.", "cons": "Not a very liberal or flexible working environment - especially within some of the business units at HQ."}, {"review_title": "Great colleagues that win awards without support from above 😔", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "12 Apr 2015", "job_title": "Flight Attendant-ITL", "duration": "N/A", "pros": "Great work group to team with.", "cons": "Lack of pay for frontline workers. Lack of support by Inflt Management."}], [{"review_title": "Flight attendant", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "2 Jun 2015", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "The culture is great, the people are upbeat, and it's a good way to travel.", "cons": "Management can be shady, things are a bit unorganized because it is a relatively new airline, not as high paying as other airlines"}, {"review_title": "Excellent working environment", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "4 Dec 2015", "job_title": "Sales Associate in Virgin, UT", "duration": "N/A", "pros": "Good team work..excellent atmosphere lovely employers who work with you on every level good goals..loved working at the company it will soon b number 1", "cons": "Targets working as a team..hours are demanding so can get very over tiring short breaks loads of over time not enough incentiv"}, {"review_title": "This place is like home, we are one big happy family.", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "28 Mar 2011", "job_title": "Fligt Attendant in San Francisco, CA", "duration": "N/A", "pros": "It's a fun and friendly work environment. People love to travel with us, and we are appreciated as individuals.", "cons": "Its not for everyone. The schedule is not very consistent and you are away from home a lot."}, {"review_title": "Great company but with growing pains", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "30 Aug 2013", "job_title": "Marketing in Burlingame, CA", "duration": "N/A", "pros": "Extremely dynamic (double-edged sword). Virgin America is looked upon favorably in Bay Area. With Virgin on your resume, many doors will be opened for you when it's time to find your next career challenge. Excellent flying perks.", "cons": "Little opportunity for internal growth. Pay."}, {"review_title": "Best Airline, Best Company", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "17 Dec 2013", "job_title": "Administrative Assistant in Burlingame, CA", "duration": "N/A", "pros": "Great staff and culture- amazing travel benefits! A lot of fun to be at during such tremendous growth- including staff, airplanes, cities etc.", "cons": "Salaries and \"perks\" are not as generous as many Bay Area start ups. There is not on site catering or shuttles to the offices from San Francisco."}, {"review_title": "Virgin at Virgin", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "22 Sept 2009", "job_title": "Aircraft Mechanic", "duration": "N/A", "pros": "All employees are treated like family. Great working atmosphere. Employees can travel for 10 dollars a month. Its always nice to work at a place where everyone smiles.", "cons": "Some mangement issues but the company is still new and learning.\r\nLack of destinations if you like to non rev.\r\nOnly Coach while non reving."}, {"review_title": "Exciting place to work with enthused team members and guests", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "People genuinely love working there\r\nThe company puts Guests first and they love the product\r\nGrowth provides opportuntities to advance", "cons": "Not enough people to complete all the projects the leadership wants to do\r\nStill has the challenge of being an airline and dealing with oil prices, competition, etc."}, {"review_title": "Sadly no longer the same.", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "15 Sept 2017", "job_title": "In Flight Teammate in San Francisco, CA", "duration": "N/A", "pros": "Was amazing experience working here when it was Virgin. Supportive environment with lots of engaging events for employees. Definitely different from any other airline.", "cons": "Has changed completely since acquisition by Alaska. Lots of people have been laid off or left. Lots of changes in upper management. Very corporate now."}, {"review_title": "Low pay/No time to use travel benefits", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "26 Dec 2017", "job_title": "Customer Service Representative in San Francisco, CA", "duration": "N/A", "pros": "Great coworkers. VA seems to know how to find the best personalities.", "cons": "Very low pay for employees.  Very hard to find time to use travel benefits. Expensive health benefits."}, {"review_title": "Awesome company, too bad about Alaska Airlines", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "8 Aug 2017", "job_title": "Marketing in Burlingame, CA", "duration": "N/A", "pros": "In the airline world  Virgin America is a relatively small company, but that is what made it so great.  Real team collaboration and everyone working for the same goal - make flying great again!", "cons": "Unfortunately with Alaska Airlines acquiring the company a lot of the early spirit is gone."}], [{"review_title": "Fun, but not as glamorous as you might think", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "17 Aug 2015", "job_title": "Flight Attendant in San Francisco, CA", "duration": "N/A", "pros": "Culture is awesome \r\nHire like-minded, fun individuals so you will love your coworkers! \r\nTravel! \r\nGood 401k, health benefits", "cons": "Pay is below industry standard. \r\nLots of unpaid time at work (delays, boarding, etc)"}, {"review_title": "Virgin America Review", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "24 May 2015", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great company culture. Great travel and health benefits. Good leadership that keeps the employees informed.", "cons": "Salaries are much lower than the industry standard. Short staffed so there are lots of multiple duties and responsibilities. No room to move up."}, {"review_title": "Flight attendant", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "23 Mar 2016", "job_title": "Flight Attendant in San Francisco, CA", "duration": "N/A", "pros": "I like the employees", "cons": "Treat reserves terrible,  you are only on reserve for a little bit"}, {"review_title": "Fun. Enjoy the flight benefits.", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "6 Jan 2017", "job_title": "Flight Attendant in San Francisco, CA", "duration": "N/A", "pros": "Travel benefits\nHotel is paid for\nPer diem covered\nNew locations to see\nNew people to interact with\nMeet new people", "cons": "The pay is low\nIt is a customer service job\nSome people are pretentious \nYou have to be flexible \nTime zone change differences are challenging"}, {"review_title": "Have fun at work!", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "12 Dec 2012", "job_title": "Guest Services in San Francisco, CA", "duration": "N/A", "pros": "Allowed to be creative, meet interesting people, flexible, great travel benefits, everyday is different, coworkers are generally fun, energetic people that are good to work with", "cons": "management can be very difficult to work with at times, lots of bureaucracy, on your feet all day, guests can be annoying and difficult at times"}, {"review_title": "Its been swell", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "7 Jul 2017", "job_title": "In-Flight Teammate in San Francisco, CA", "duration": "N/A", "pros": "Great teammate engagement, this company really feels like family. Good benefits, health and travel as well as a great 401k that matches 125% of contributions up to 6%.", "cons": "The company was bought by Alaska Airlines so the culture is slowly dying. Virgin America was never the most competitive airline in terms of pay."}, {"review_title": "Experience of a lifetime", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "18 Dec 2013", "job_title": "In-flight Team Member in Burlingame, CA", "duration": "N/A", "pros": "-The people you work with\r\n-The people you work for\r\n-The passengers\r\n-The travel benefits\r\n-Sometimes you'll feel like you get paid to have fun", "cons": "-The people you work with\r\n-The people you work for\r\n-The passengers\r\n-Sometimes you'll feel like you could never be paid enough"}, {"review_title": "Mixed emotions, just like a familial relationship.", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "3 Sept 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great culture, fun loving, travel benefits, hard working, and creative problem solving.", "cons": "Politics, compensation, and favoritism get in the way of a lot. Hard to actually develop yourself with the help of a capable manager, lots of trial by error."}, {"review_title": "Great company", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "10 Apr 2018", "job_title": "Manager in Burlingame, CA", "duration": "N/A", "pros": "Virgin America had great employee engagement activities.  The HQ work environment had little down time--always working on multiple deadlines.", "cons": "Understaffed, caused excessive workload.  The annual employee goal assessment was designed to measure/manage long-term projects however, most projects were very short and not on the radar when the annual goals were established."}, {"review_title": "Challenging and exciting", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "12 Jun 2011", "job_title": "Guest Service", "duration": "N/A", "pros": "Great Brand to work for\r\nPublic is very positive about the brand\r\nEquipment is new and fresh\r\nvery changeable in doing different things", "cons": "Very immature middle management\r\ndo not have yet a employment evaluation program after 4 years in ops"}], [{"review_title": "An Airline people love, a Company and culture that people LOVE to work for.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "2 Jun 2016", "job_title": "Manager At HQ in Burlingame, CA", "duration": "N/A", "pros": "Culture, management, benefits, people, work/life balance and reputation.  Excellent flight benefits and 401K plan.", "cons": "Low Salary and limited career growth opportunities at HQ.  Poor vacation accrual."}, {"review_title": "Flight Attendent", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "19 Sept 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "travel, meet new people. start your work day in one city and end it in a different one", "cons": "low pay and youre based in san francisco out of training and can not afford to live there with the horrible pay starting out. other than that, its a very fun job"}, {"review_title": "Best job and best company I ever worked for in my life", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "29 Oct 2014", "job_title": "In-flight Team Member", "duration": "N/A", "pros": "This company is family! Miss everything and everyone", "cons": "It's hard to take care of a family while being on reserve but if I could do it all again I would've made it  work"}, {"review_title": "Pilot review", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "5 Dec 2014", "job_title": "Pilot in San Francisco, CA", "duration": "N/A", "pros": "easy going company.  they try hard to please the passengers", "cons": "substandard pay, inexperienced leaders, poor communicators.  They over promise to lead you on, then blame changing airline industry on why none of their promises come through.  one of the most underpaid airbus operators with no work rules.  not growing and growth forcast is terrible."}, {"review_title": "GST", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "2 Mar 2016", "job_title": "Guest Services Teammate in Fort Lauderdale, FL", "duration": "N/A", "pros": "Everyone is willing to help.  Flight benefits that you have to pay for a month. if you fly with Virgin the fa treat you good.", "cons": "No benefits no one likes to switch or help out so you can travel you have to wait a year if you want to go to a different department a lot of responsibility little pay"}, {"review_title": "Great culture, great team!", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "30 Jun 2014", "job_title": "Anonymous Employee in Burlingame, CA", "duration": "N/A", "pros": "Team is inspiring, caring, and energetic.", "cons": "Vacation time for G & A is horrible.  7 years of time and still 3 weeks vacation and 5 holidays."}, {"review_title": "Confused airline with identity problems", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "25 Jul 2012", "job_title": "Guest Services Team Lead in Washington, DC", "duration": "N/A", "pros": "Great aircraft and great in-flight staff. Amenities are truly great and enjoyable.", "cons": "Still trying to figure out the kinks of the airline industry. Station supervisors are terrible. Bring too much of the legacy carriers over with them."}, {"review_title": "Learned a lot, growth opportunities are limited.", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "23 Jan 2014", "job_title": "Manager in Burlingame, CA", "duration": "N/A", "pros": "Great teammates, mostly smart people, great brand, lots of company activities, positive space flight benefits.", "cons": "Growth opportunities are limited, work never ends, team is extremely lean."}, {"review_title": "Amazing company", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "1 Jun 2015", "job_title": "Guest Services Teammate in San Francisco, CA", "duration": "N/A", "pros": "Great benefits, met amazing people, very flexible schedule after initial training and many opportunities to move within the company", "cons": "First few months you're on probation and cannot do shift trades, pick up or give away hours"}, {"review_title": "awesome company with amaing benefits", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "7 Aug 2015", "job_title": "In Flight Team Member in San Francisco, CA", "duration": "N/A", "pros": "free travel for myself, my companion, and parents, desirable layover locations, health based incentive program, supportive team members, progressive company culture, most work weeks are less than 5 days", "cons": "work schedule is constantly changing,"}], [{"review_title": "Best Culture, Leadership & Teammates!!!!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "1 Dec 2016", "job_title": "Director in San Francisco, CA", "duration": "N/A", "pros": "Amazing leadership, people, and work/life balance. Here people work hard but are trusted and respected. Its incredible to work for such a loved and creative brand, with people who are passionate and kind.", "cons": "Fairly flat organization so it might be hard to get promoted"}, {"review_title": "Gst sfo", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "7 Mar 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Flight benefits were absolutely great.", "cons": "Supervisors were audacious at SFO. Leave your personality at the door and you should be like a robot on a production line. Quotes from the station manager and supervisor.... part time schedules should not be 5 days a week, totally absurd!"}, {"review_title": "Amazing Airline!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "The best and most motivated people in the industry working together with an amazing culture. Truly a collaborative environment where it's ok to have fun!", "cons": "Many bright and talented people leaving due to the recent acquisition. No motivation to stay at new company due to drastic changes."}, {"review_title": "Great company", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "10 Jan 2018", "job_title": "Flight Attendant in San Francisco, CA", "duration": "N/A", "pros": "You meet the best people with fun personalities. Cute uniforms. Great company culture. You will never wana let go of your flight benifits.", "cons": "Not the best pay. Being on reserve is tough. Crashpads are tough and Alaska Airlines is talking over so the company culture is dying"}, {"review_title": "In-flight team member", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "7 Jan 2014", "job_title": "In-flight Team Member in Burlingame, CA", "duration": "N/A", "pros": "Culture\r\nbenefits\r\ninterview was fun\r\npeople are energetic and fun", "cons": "pay is very low, especially for your first couple years\r\nreserve for 2 years. if you can't handle being on call 24/7, you may want to reconsider this career."}, {"review_title": "Great company, loyalty is lacking", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "27 Sept 2016", "job_title": "Director in Burlingame, CA", "duration": "N/A", "pros": "Great travel perks and you work with really smart people.  Everyone loves the brand and works hard to represent it every way possible.", "cons": "No loyalty from management."}, {"review_title": "GST", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "19 Oct 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great Culture, sometimes the work is hard but if you are lucky they hired the right people to help.", "cons": "if you dont want to work from the bottom up, its not for you.Senior Ranking System But to know a business from the ground up is good."}, {"review_title": "Work Hard, Play Hard", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "16 Nov 2014", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "I love to work hard and see the results. It's fun to be the best and to know you are a part of success. \r\n\r\nGreat people!", "cons": "Not enough free time in salary positions to see the world!"}, {"review_title": "It's exciting and you never know what's around the corner.", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "22 Dec 2014", "job_title": "Crew Scheduler in Burlingame, CA", "duration": "N/A", "pros": "Quality benefits and being able to travel quite a bit.", "cons": "Long days and high stress as well sometimes."}, {"review_title": "ITM", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "10 Nov 2015", "job_title": "ITM in San Francisco, CA", "duration": "N/A", "pros": "A really amazing work space. This is my third airline and the best crews I've worked with in the industry. Seniority moves fairly quickly as it's a growing airline. Happy to be here.", "cons": "Upper Mgmt woes that are effective industry wide."}], [{"review_title": "Everyone is very nice and welcoming", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "4 Jul 2012", "job_title": "In-Flight Teammate in Singapore", "duration": "N/A", "pros": "Constantly creating WOW, a new company so there are a lot of chances to help the company grow and become better.", "cons": "Because it is a new company there is room to better the company."}, {"review_title": "Great Culture and Great People", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "13 Mar 2017", "job_title": "Guest Services in Singapore", "duration": "N/A", "pros": "great 401k matching up to 6% immediate vesting. Flexibility to swap shifts and trade time off. Good management.", "cons": "some uncertainty due to being bought by Alaska and merger in progress."}, {"review_title": "Best Company to Work for ... Ever.", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "15 Mar 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Management drives you to succeed.  Hands off approach opens up worlds of abilities you didn't know you had.", "cons": "Company got purchased and  that's a huge bummer because they moved to Seattle."}, {"review_title": "Awesome people, hectic mgmt, low pay, great perks", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "25 Jun 2013", "job_title": "Guest Services Teammate in San Francisco, CA", "duration": "N/A", "pros": "culture, flight benefits, flexible schedule, allowed to trade shifts so even if you dont have vacation time left you are able to take time off", "cons": "limited resources, lower than average pay"}, {"review_title": "Shame...", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "4 Dec 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Virgin America is such a great airline, really focused on doing the right thing for guests and employees.  It's a shame that Alaska is going to dismantle the whole thing.", "cons": "Acquisition by Alaska Airlines will ruin everything."}, {"review_title": "An excellent company to work for.", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "26 Jul 2013", "job_title": "Customer Service Representative in Orlando, FL", "duration": "N/A", "pros": "An excellent company to work for. Generous benefits and plenty of room for advancement.", "cons": "In a large corporation like this you may sometimes feel like a little fish in a small pond."}, {"review_title": "In-Flight Teammate", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "1 Oct 2015", "job_title": "In-flight Team Member in San Francisco, CA", "duration": "N/A", "pros": "Co-workers are great, flexible schedule, travel perks", "cons": "Pay is low, time away from home, dealing with the general public can be exhausting and frustrating."}, {"review_title": "Guest Service Review", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "8 Sept 2010", "job_title": "Guest Service Teammate in Singapore", "duration": "N/A", "pros": "Working with the guest is fun.", "cons": "You don't get recognized for doing a great job."}, {"review_title": "Highly motivated workforce / very dynamic working environment", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "29 Aug 2012", "job_title": "Anonymous Employee in San Francisco, CA", "duration": "N/A", "pros": "Innovative ideas encouraged\r\nroom for growth\r\npassionate employees", "cons": "job stability unknown\r\nlow wages along with pricey Bay Area living expenses"}, {"review_title": "Flight attendant", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "4 Dec 2015", "job_title": "In Flight Team Member in Burlingame, CA", "duration": "N/A", "pros": "Free flights, cool parties, cool people", "cons": "not nearly enough money to live in bay area, better off working for them in Dallas or commenting as a flight attendant"}], [{"review_title": "Great company", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "10 Feb 2016", "job_title": "In Flight Team Member in New York, NY", "duration": "N/A", "pros": "Great company with great benefits! Great way to know the world and travel", "cons": "You'll be away from your family most of the time. But compansate from the travel privileges."}, {"review_title": "Great Place to work.  Good People Too!", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "13 Apr 2012", "job_title": "Business Systems Analyst", "duration": "N/A", "pros": "Fun, Fast paced and exciting environment.  Great for people who love to travel or love airlines and live in the Bay Area.", "cons": "we've got some growing pains."}, {"review_title": "Cool company, bad mid leadership", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "26 Jul 2013", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Young, hip, open minded company", "cons": "You need a connection to get a good posititon"}, {"review_title": "Great product, inexperienced management", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "7 Mar 2014", "job_title": "Flight Attendant in Burlingame, CA", "duration": "N/A", "pros": "Planes are beautiful, crews are friendly", "cons": "Management is immature and most don't even know what they're doing. Felt like a bunch people with a.d.d. got together and said \"let's make an airline\"."}, {"review_title": "Flight Attendant", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "23 Feb 2016", "job_title": "Flight Attendant in San Diego, CA", "duration": "N/A", "pros": "Co-workers are extremely hard working and friendly.", "cons": "Horrible Management. Several class action suits for breaking labor, FMLA and FAR regulations. They love their favorites."}, {"review_title": "Brand Manager", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "24 Apr 2017", "job_title": "Brand Manager in Burlingame, CA", "duration": "N/A", "pros": "People are awesome, culture is great, travel perks, great brand and product, overall opportunities and life experiences  - both internal and external.", "cons": "Alaska Airlines acquisition, low pay."}, {"review_title": "HR", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "23 May 2017", "job_title": "Human Resources", "duration": "N/A", "pros": "Virgin America  a Creative, collaborative, and authentic. A great place to work", "cons": "Acquired by another company with wavering commitment to teammates and work life balance"}, {"review_title": "Flight Attendant (Inflight Team Member)", "rating": "3.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "9 May 2017", "job_title": "Flight Attendant in San Francisco, CA", "duration": "N/A", "pros": "Travel benefits, work culture, uniforms", "cons": "Low pay and poor work rules for inflight crew (cabin crew). You're at the mercy of crew scheduling."}, {"review_title": "highly addictive", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "24 Apr 2013", "job_title": "In Flight Teammate", "duration": "N/A", "pros": "-the people\r\n-the swag\r\n-the benefits\r\n-the brand\r\n-the parties\r\nFor the Inflight Department:\r\n-travel the world, literally\r\n-the flexibility", "cons": "IMO:\r\n-limited room for growth if you don't already have loads of experience\r\n-scarce opportunities to flourish, both professionally and financially"}, {"review_title": "InFlight Team Member", "rating": "2.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "23 Aug 2015", "job_title": " in Menlo Park, CA", "duration": "N/A", "pros": "Great destinations, easy flights, good crews to work with.  Long overnights at some downline airports.", "cons": "Young company at the time I worked there.  Processes and guides were still being formalized.  Needed more structure better leadership."}], [{"review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "During my 10 month contract period I found Virgin to be one of the best places I worked at.", "cons": "Schedule was often problematic, but it was due to position"}, {"review_title": "Fun environment, teammates feel like family", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "10 Jun 2016", "job_title": "Aircraft Dispatcher in Burlingame, CA", "duration": "N/A", "pros": "Excellent airline with motivated teammates who are passionate about making a difference and challenging the status quo.", "cons": "Recently acquired by another airline."}, {"review_title": "If money was no object this would be great", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "12 Aug 2016", "job_title": "In Flight Team Member", "duration": "N/A", "pros": "Fun teammates\r\nEasy work\r\nyou get your own room in a hotel on layovers", "cons": "You don't get enough sleep\r\nvery low salary"}, {"review_title": "Great experience!", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "5 Jan 2013", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "On a corporate level it was great, it felt 'Virgin'.", "cons": "At the local level-station level, waaaaay too many chiefs. Not consistent with Virgin's values."}, {"review_title": "Great company", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "11 Mar 2013", "job_title": "In Flight Team Lead in San Francisco, CA", "duration": "N/A", "pros": "Fun culture and great people on the front line.  Lots of flexibility.", "cons": "Unfortunately the general compensation was quite low, and ultimately the reason I left.  I didn't see my career growing here either."}, {"review_title": "Airport Teammate", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "24 Mar 2015", "job_title": "Airport Team Member in Los Angeles, CA", "duration": "N/A", "pros": "Travel benefits, modern hip feel. Guest really make this job enjoyable because they truly love the product", "cons": "Sneaky management. Advancement favoritism inconsistent mangagement policies, communication link has holes on all levels. Break time isnt enforced, very illegal"}, {"review_title": "GST", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Love the job, love the people and the team environment", "cons": "On occasion we could use more staff."}, {"review_title": "Great Company", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "10 Mar 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great company to work for where you have fun and you can tell by how happiness the employees are", "cons": "No complaints here. Absolutely diverse and well organized."}, {"review_title": "Guest Service Teammate", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "10 Apr 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Semi-cool company culture\r\nAirport is neat\r\nMeeting new people\r\nflight benefits", "cons": "Whack hours\r\nStupid use-less 3 week training process\r\nstressful work environment/situations\r\npay sucks"}, {"review_title": "Great company", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "26 Dec 2014", "job_title": "Guest Services in New York, NY", "duration": "N/A", "pros": "Wonderful Co workers very flexible the pay is decent but I have been there forever", "cons": "Management not in sync with each other becoming more of a legacy carrier everyday"}], [{"review_title": "Guest Service Teammate", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "1 Dec 2016", "job_title": "Guest Services Teammate in New York, NY", "duration": "N/A", "pros": "Culture and the exemplification of the Virgin Values from the top down for the most part", "cons": "Alaska Airlines Acquisition and the lack of information given to the VX teammates"}, {"review_title": "Flight Attendant", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "21 Jul 2017", "job_title": "Flight Attendant in San Francisco, CA", "duration": "N/A", "pros": "Our Customers LOVE us. Our service is over the top!", "cons": "There is always a conflict between corporate and on the line employees. Low pay!!!"}, {"review_title": "VXFOREVER", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "16 Jan 2018", "job_title": "In Flight Teammate in San Francisco, CA", "duration": "N/A", "pros": "Virgin America changed the airline industry on the West Coast and became a great competitor, the culture and brand was amazing, and it's sad to see it go.", "cons": "None that I can state."}, {"review_title": "Great until you see past the smoke in mirrors", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "18 Aug 2015", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Travel benefits. People you work with. People you meet. Product a good idea. Hard to think of more pros here.", "cons": "No work/life balance. Open door policy a farce. Employees are victims no responsibility. Management does not care about you whatsoever unless you grovel at their feet."}, {"review_title": "Guest Services", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "26 Nov 2016", "job_title": " in San Jose, CA", "duration": "N/A", "pros": "great company to work for; awesome benefits!", "cons": "only times the job was hard was when the weather was terrible- no one likes it when their flight is delayed/cancelled"}, {"review_title": "Great colleagues, poor management", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "2 Dec 2017", "job_title": "Anonymous Employee in Los Angeles, CA", "duration": "N/A", "pros": "Travel, flexibility, fun colleagues, beautiful planes, sexy vibe.", "cons": "Poorly managed, lack of consistency with enforcing company policies, small route structure"}, {"review_title": "Goods and Bad", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "13 Mar 2013", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great product, Fun environment. Flight benefits are the best part.", "cons": "Pay is low, unorganized leadership. Inconsistent with polices and procedures. The company is focused on the wrong things."}, {"review_title": "Ehhhh....you decide for yourself", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "21 Jul 2015", "job_title": "Lead Flight Attendant in Oceanside, CA", "duration": "N/A", "pros": "Flexibility and reserve time was short, not sure if it's the same.  Made training fun.", "cons": "Poor managers and supervisors.  Not consistent and they had their favorites."}, {"review_title": "GST", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "19 Mar 2018", "job_title": "GST", "duration": "N/A", "pros": "This was the best company to work for! Everyone is family and the company culture is/was amazing!", "cons": "Alaska Airlines \"merger\" (takeover) has been terrible."}, {"review_title": "fun company", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "11 Dec 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "does a great job at hiring good staff. great working relationships with other coworkers.", "cons": "prior to getting union representation limited protections and sometimes uneven application of work rules and policies"}], [{"review_title": "It was good while it lasted!", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "9 Jan 2018", "job_title": "Flight Attendant", "duration": "N/A", "pros": "VX did a wonderful job of training their employees! I worked here during a huge growth spurt. Best job of my career!", "cons": "None to speak of!"}, {"review_title": "Fantastic Company To Work For!", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "28 Oct 2014", "job_title": "In Flight Team Leader in Burlingame, CA", "duration": "N/A", "pros": "Travel, Meeting Interesting People, Making Lasting Friendships.", "cons": "I loved everything about my job and had no complaints."}, {"review_title": "Fun job, great company", "rating": "4.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "3 Dec 2014", "job_title": "Guest Service Team Member in Dulles, VA", "duration": "N/A", "pros": "Awesome company, their vision is exciting. Flight benefits are great especially if you work as GST", "cons": "The pay is mall grade, tight micromanagement"}, {"review_title": "Pay is set", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "4 Jul 2015", "job_title": "In-flight Team Member in San Francisco, CA", "duration": "N/A", "pros": "Fun company to work for, perks, get to travel and meet a lot of people. Employee perks are awesome. Would go back.", "cons": "Pay is set, can't negotiate"}, {"review_title": "5-weeks Training", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "3 Oct 2015", "job_title": "Customer Service Representative in Kent, WA", "duration": "N/A", "pros": "- 5 weeks paid training\r\n- 2 day stay in SF after training\r\n- Stable job", "cons": "- Call center environment\r\n- Scheduling needs to be open"}, {"review_title": "Fantastic company culture!", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "8 Jul 2016", "job_title": "Anonymous Employee in Pacifica, CA", "duration": "N/A", "pros": "Great culture, lots of passionate people. Very fun place to work.", "cons": "Internal systems are very old. HR technology is a joke."}, {"review_title": "The best", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Good people great pay and travel", "cons": "Away from home a lot, but it is the nature of the business."}, {"review_title": "Awesome culture. Amazing people.", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "22 Sept 2018", "job_title": "Anonymous Employee in Burlingame, CA", "duration": "N/A", "pros": "Incredible relationships built here. Loved that I could bring my whole self to work.", "cons": "Pay is not as competitive as other companies in the area."}, {"review_title": "Amazing place to work!", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "The best company, best teammates, best airline. Period.", "cons": "Too many positives to remember negatives"}, {"review_title": "flight attendant", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "6 Jul 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "fun hip sexy airline... impressing passengers always.", "cons": "rough life on reserve, hard when you first start"}], [{"review_title": "Guest Services Teammate", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "25 Apr 2017", "job_title": "Guest Services Teammate", "duration": "N/A", "pros": "The awesome people you work with makes it worth it. Travel Perks are great.", "cons": "Recently got acquired by Alaska Air."}, {"review_title": "The Virgin tribe rocks", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "28 Oct 2008", "job_title": "Pilot in San Francisco, CA", "duration": "N/A", "pros": "The people we work with", "cons": "Pay and benefit package could be better"}, {"review_title": "The happiest workplace to be...", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "9 Sept 2017", "job_title": "Guest Services in New York, NY", "duration": "N/A", "pros": "This was a team with a capital T", "cons": "There were no real downsides to working here."}, {"review_title": "guest service teammate", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "8 May 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "great culture! leadership will always have your back if you do things right and reasonably.", "cons": "work you to death during busy times and seasons"}, {"review_title": "Inflight specialist", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "5 May 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great place to work and amazing people", "cons": "California is an expensive place to live."}, {"review_title": "LOVE", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "24 May 2016", "job_title": "Guest Services Teammate in Dallas, TX", "duration": "N/A", "pros": "Fun, young, innovative, flexible schedule, flight benefits", "cons": "highly demanding during weather related issues or cancellations"}, {"review_title": "Flight Attendant", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "4 Jan 2018", "job_title": "Flight Attendant in San Francisco, CA", "duration": "N/A", "pros": "You can choose your hours", "cons": "Poor work conditions for workers - Work for little pay"}, {"review_title": "great company", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "great company culture, willing to help and give you the tools you need to make you successful", "cons": "disconnect between various work groups (inflight, airport)"}, {"review_title": "Great place to work for", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "17 Jan 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great employee relations, fun place to work.", "cons": "The flight benefits, insurance and switching to Alaska"}, {"review_title": "Guest Service Teammate", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "30 Jan 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Good flight benefits and ability to work extra shifts", "cons": "poor pay. Operations control center is not that great"}], [{"review_title": "Guest Service Teammate", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "5 Jun 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Best part about the job is the people you get to call your teammates.", "cons": "Worst part of the job is the inhumane schedules."}, {"review_title": "No longer exist", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "26 Jun 2019", "job_title": "Customer Service in Seattle, WA", "duration": "N/A", "pros": "Free to make decision to help customer, fun, flexible hours, promote employees within the company before outsider.", "cons": "started out at low rate wage."}, {"review_title": "Fun Work Culture", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "9 Aug 2019", "job_title": "In Flight Team Leader in Los Angeles, CA", "duration": "N/A", "pros": "Loved everyone I ever worked with", "cons": "Pay is not incredible unless you plan to fly almost every day to make ends meet."}, {"review_title": "the good and the bad", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "27 Oct 2015", "job_title": "In Flight Teammate in Burlingame, CA", "duration": "N/A", "pros": "flight benefits, really and meeting new coworkers everytime you have a trip.", "cons": "management is terrible. ignores the needs of flight crew"}, {"review_title": "New and innovative", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "25 Mar 2016", "job_title": "Anonymous Employee in Burlingame, CA", "duration": "N/A", "pros": "Positive on-boarding experience, you meet great people in training", "cons": "A lot of stress and uncertainty as a reserve"}, {"review_title": "Flight attendant", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Great benefits. Flexible schedule once you're off reserve.", "cons": "Inconsistent management. Work rules are not stable."}, {"review_title": "Guest Seevice Team Member", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Flight benefits and easy to work out the schedule.", "cons": "Inexperienced management. Each station has its own policy."}, {"review_title": "Awesome Company", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "10 Nov 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "The team, the flight benefits, and the flexibility.", "cons": "If you require a stable, consistent schedule, this is not the role for you."}, {"review_title": "Great job", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "9 Sept 2019", "job_title": "Flight Attendant in San Francisco, CA", "duration": "N/A", "pros": "Fun job, go places, see things, and flexible schedule", "cons": "Need to be able to work crazy hours"}, {"review_title": "Great Place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "7 Aug 2013", "job_title": "Guest Services Teammate in Dulles, VA", "duration": "N/A", "pros": "Free Flights, Great people, & Very Diverse.", "cons": "Getting to big now. Was a small company who knew their employees."}], [{"review_title": "The Truth", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "7 Mar 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Innovative, Fun, Friendly, Customer Service, Unique", "cons": "Pay, Growth Opportunity, Location (SFO), Schedule, Lack of Mgmt Support"}, {"review_title": "Inflight Teammate", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "7 Sept 2017", "job_title": "In Flight Teammate in San Francisco, CA", "duration": "N/A", "pros": "Great employees, flexible schedules and opportunity to travel", "cons": "Pay is awful. Promises made and not kept. Supervisors were unfair and not consistent with work rules"}, {"review_title": "So far so good", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "23 Oct 2013", "job_title": "Flight Attendant in San Francisco, CA", "duration": "N/A", "pros": "Fun, teamwork, different, enjoyable, visit new places", "cons": "Pay, never home, reserve,communication,"}, {"review_title": "IT", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "15 Jul 2015", "job_title": "Quality Assurance Auditor in San Francisco, CA", "duration": "N/A", "pros": "Very Flexible work environment.\r\nfun and exciting\r\nnew perks", "cons": "pay structure not stable enough"}, {"review_title": "GST", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "23 Sept 2016", "job_title": "GST in Los Angeles, CA", "duration": "N/A", "pros": "Flight benefits, great culture motives", "cons": "Sellout to Alaska and favoritism"}, {"review_title": "Director Safety and Security", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "26 Oct 2016", "job_title": "Director in San Carlos, CA", "duration": "N/A", "pros": "Good place to work for almost entire time with company.", "cons": "Decision was made to sell company to Alaska Airlines."}, {"review_title": "Flight attendant fun but poor", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "13 Aug 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Travel benefits, cool atmosphere, independence", "cons": "Low salary, demanding, away from home"}, {"review_title": "Needs Work", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "3 Oct 2017", "job_title": "In Flight Team Member in San Francisco, CA", "duration": "N/A", "pros": "Flexible schedule\r\ngreat coworkers\r\nfun layovers\r\nlittle to no supervision on a day to day basis", "cons": "No flexibility to trade certain trips from your schedule"}, {"review_title": "Director", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "29 Nov 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Fun culture, got to build airline from scratch", "cons": "Company sold to Alaskan Airlines"}, {"review_title": "Aviation Maintenance", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "22 Sept 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Fun people to work with.  Hours are great.", "cons": "Bought by Alaska Airlines and job is going to Seattle"}], [{"review_title": "Lead", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "29 Oct 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Awesome culture not micromanaged do your job no issues.", "cons": "Bought by Alaska Airline's majority of the starters got let go."}, {"review_title": "Amazing Company", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "2 Nov 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Amazing Staff, Benefits and company.", "cons": "Sad to see the Virgin America brand go away."}, {"review_title": "Corporate Learning", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "13 Aug 2019", "job_title": "LMS Administrator in Burlingame, CA", "duration": "N/A", "pros": "Culture was amazing and the company was not too big.", "cons": "Because it was a start up things could be chaotic."}, {"review_title": "Inflight", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "13 Jul 2012", "job_title": "In Flight in San Francisco, CA", "duration": "N/A", "pros": "Growing company,hip young,adding many new faces,planes and cities", "cons": "Growing company ,small ,some of operations dealing with crews are inconsistent,"}, {"review_title": "Fun, growing company", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "4 Dec 2014", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "An exciting brand to work for.", "cons": "Still small compared to other major airlines, so growth opportunities are limited."}, {"review_title": "In flight teamate", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "flight benefits, travel, actual health benefits", "cons": "extremely difficult to get in, pay"}, {"review_title": "Customer Service Representative", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "17 Jan 2017", "job_title": "Reservationist/Customer Service Agent in Burlingame, CA", "duration": "N/A", "pros": "Very friendly environment, easy job nothing to complain about I loved working here", "cons": "Nothing I wouldnt change a thing"}, {"review_title": "Guest Service Supervisor", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "17 Mar 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Unique, fast-paced, tech-savy, friendly,", "cons": "will no longer be in business in a few years"}, {"review_title": "aircraft technician", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "7 Jul 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "great benefits, lots of overtime", "cons": "very busy and tiring, barely eat our lunch or take a break"}, {"review_title": "Guest service teammember", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "25 Oct 2017", "job_title": "GST in Dallas, TX", "duration": "N/A", "pros": "Flexible hours and free tickets", "cons": "Bad pay, bad training,no benefits"}], [{"review_title": "Flight Attendant", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "21 Mar 2018", "job_title": "Flight Attendant in San Francisco, Córdoba", "duration": "N/A", "pros": "They listen, diversity, take care of their own", "cons": "Not always available when needed"}, {"review_title": "Fun company to work for", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Company culture and people are great", "cons": "Overwhelming workload (hdq) and somewhat inadequate pay and benefits"}, {"review_title": "Just Ok", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "22 Nov 2013", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great airplanes to work on", "cons": "Nobody has any idea what the are doing."}, {"review_title": "Super fun!!", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "1 Dec 2013", "job_title": "Guest Services in Seattle, WA", "duration": "N/A", "pros": "Amazing teammates\r\nThe opportunity to develop a new product\r\nInnovation", "cons": "Not a lot of communication from upper management\r\nLong hours\r\nLittle compensation"}, {"review_title": "Great company", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "6 Jun 2015", "job_title": "First Service Teammate", "duration": "N/A", "pros": "Great health and flight benefits. Awesome culture and very welcoming, nice people.", "cons": "Management can be difficult and unfair"}, {"review_title": "Great company to work for", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Travel Benefits, Culture and great Coworkers", "cons": "Limited growth and financial loss during early years."}, {"review_title": "Virgin is Amazing", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "4 Mar 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "They love their employees and make you happy to be there.", "cons": "No Cons from my perspective."}, {"review_title": "Good Company", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "24 Jan 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Flight Benefits , Health Insurance  & 401 Match", "cons": "There not enough teammate and alot of politics."}, {"review_title": "virgin great", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "29 Mar 2018", "job_title": "Cabin Crew", "duration": "N/A", "pros": "plenty - pay - hours - staff - uniform", "cons": "none - i love this company so friendly"}, {"review_title": "Great Co to work for", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "21 Mar 2013", "job_title": "In Flight Lead in San Francisco, CA", "duration": "N/A", "pros": "awesome travel, health and employee benefits", "cons": "salary, schedule, not enough room for upward growth"}], [{"review_title": "Overall a good company to work.", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "6 Nov 2014", "job_title": "Pilot in San Francisco, CA", "duration": "N/A", "pros": "Very progressive for an airline.", "cons": "Tend to pay lower then the industry average."}, {"review_title": "GST", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "1 Sept 2015", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Fast Growing Company,Room to grow,Excellent mission", "cons": "Pay rate is very low"}, {"review_title": "Captain", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "28 Apr 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Good pay scale for lob term people", "cons": "Some long hours of flight"}, {"review_title": "Manager", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "23 May 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Exciting and challenging environment, and flight benefits are exciting!", "cons": "Low upward mobility, comp/bene program consistent with aviation industry"}, {"review_title": "guest service", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "27 May 2016", "job_title": "Guest Service Agent in Dallas, TX", "duration": "N/A", "pros": "Virgin treats their employees great, travel benefits are a plus", "cons": "low pay rate and difficult hours"}, {"review_title": "how i feel", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "everything was nice and clean and fun working there", "cons": "there was not one con"}, {"review_title": "I've been working full time for 2 years", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Great cia,  good pay and benefits.", "cons": "Long run to seniority"}, {"review_title": "Guest service", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Innovative uniques.teammates are encouraged to interact with guests", "cons": "Not much room for fast professional growth"}, {"review_title": "Great company to work with!!!", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Good place to learn and grow.", "cons": "Nothing to say at this moment"}, {"review_title": "Line pilot", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "13 Jul 2016", "job_title": "Airline Pilot in Los Angeles, CA", "duration": "N/A", "pros": "Best work culture in the business.", "cons": "New company, compensation, organizational hurdles."}], [{"review_title": "Inflight Teammate", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Flight Benefits, some flexibility, fun coworkers.", "cons": "Long hours, usually working holidays the first few years."}, {"review_title": "Senior Marketing Analyst", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "20 Mar 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Travel benefits and flexible schedules", "cons": "Pay was not the best and no structure"}, {"review_title": "GST", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "15 Apr 2017", "job_title": "Guest Services Teammate", "duration": "N/A", "pros": "Perks perks perks and a great group of people ...", "cons": "Hours not a morning person"}, {"review_title": "Great airline to work for!", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "21 Nov 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Virgin culture, flight and health benefits, flexibility.", "cons": "It was bought by Alaska Airlines"}, {"review_title": "jobs", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "22 Jul 2018", "job_title": "Guest Services in Burlingame, CA", "duration": "N/A", "pros": "great culture and benefits people and jobs and growth", "cons": "start up airline lots of movement"}, {"review_title": "Flight Attendant", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "18 Sept 2018", "job_title": "Flight Attendant in Los Angeles, CA", "duration": "N/A", "pros": "Be who you are always", "cons": "Nothing that u can think of"}, {"review_title": "Best Airline", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "4 Aug 2019", "job_title": "Guest Service Team Member", "duration": "N/A", "pros": "this company was amazing to work for.", "cons": "Very unfortunately was aqires by some airline"}, {"review_title": "Great Company", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "21 Jul 2015", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Always have fun at work.", "cons": "Sometimes slow at getting things done."}, {"review_title": "Good company", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "23 Feb 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great company\r\nGood pay\r\nPeople are awesome \r\nManagement is understanding", "cons": "Favoritism \r\nWork and life balance"}, {"review_title": "GST", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Fun, young and energetic company", "cons": "Not really any cons, everyday is a blast"}], [{"review_title": "best for travellers", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "free flights and for family too", "cons": "terrible hours for your first two years"}, {"review_title": "Director", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "11 Sept 2018", "job_title": "Director in San Francisco, CA", "duration": "N/A", "pros": "Culture. Culture.  Teammates.  Creativity. Innovation.", "cons": "None.  That Alaska Airlines acquired Virgin."}, {"review_title": "Awesome!", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Awesome culture and encouraging teammates.", "cons": "Not a lot of room for career growth."}, {"review_title": "Operations Coordinator", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "29 Aug 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great schedule flexibility and great flight benefits", "cons": "Occasionally long hours due to delays"}, {"review_title": "Great Company to work for", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "9 Mar 2017", "job_title": "Supervisor in Calif City, CA", "duration": "N/A", "pros": "Travel Benefits are great", "cons": "Some people can make it difficult"}, {"review_title": "Flight Attendant", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "24 Jun 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "co-workers, culture, travel benefits, health benefits", "cons": "low pay, not much room for advancement"}, {"review_title": "Supervisor", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Great Team to work with", "cons": "Some improvements needed for a better work environment."}, {"review_title": "CSS", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Great People to work with. Fun Airline. Good Pay. Good Felx", "cons": "Tough operation in IROPS."}, {"review_title": "Guest Service Teammate", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "14 Aug 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Free flights in the US ans Mexico", "cons": "Unpredictable schedule by seniority"}, {"review_title": "Supervisor of Uniform Program", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "28 Sept 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Amazing people\r\nFamily atmosphere\r\ngrowth opportunities", "cons": "We were acquired by another airline"}], [{"review_title": "Not at all what I expected or wanted.", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "10 Oct 2019", "job_title": "In Flight Team Member in Burlingame, CA", "duration": "N/A", "pros": "Diverse and inclusive company.  Progressive policies.", "cons": "Dismal pay.  Scheduling and management were not consistent in their policies.  No sense of loyalty to their crew.  Pilots were often sexist and even egotistical at times."}, {"review_title": "Amazing & Awesome", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "22 Jun 2020", "job_title": "Customer Service in Burlingame, CA", "duration": "N/A", "pros": "Best company I've ever worked for", "cons": "They are no longer around"}, {"review_title": "Good for a start", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "12 Nov 2013", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "High potental and work speed.", "cons": "No serious cons at all"}, {"review_title": "Na", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "The employees are amazing", "cons": "Senior management is a nightmare"}, {"review_title": "Fly Virgin", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Great crew\r\nAmazing planes\r\nLove the company", "cons": "Being in reserve can be extremely hard."}, {"review_title": "Great Travel Benefiyts", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Great Travel Benefits\r\nGreat 401k Match", "cons": "Not enough Vacation or PTO\r\nNo Work/Life Balance"}, {"review_title": "Flight Attendant", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "28 Aug 2017", "job_title": "Flight Attendant in San Francisco, CA", "duration": "N/A", "pros": "The culture and coworkers are amazing", "cons": "The pay and benefits are awful"}, {"review_title": "Great Company", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Great Company filled with great employees", "cons": "Never a boring day at work"}, {"review_title": "HQ Supervisor", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "4 Feb 2018", "job_title": "HQ Supervisor in Burlingame, CA", "duration": "N/A", "pros": "Created and airline guest love", "cons": "No cons best place to work"}, {"review_title": "Flight attendant", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "25 May 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Fun customer service  focused job", "cons": "Long working hours, hard scheduling"}], [{"review_title": "aasa", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "25 May 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "nice people goo work culture", "cons": "pay is low, just got bought out"}, {"review_title": "Manager", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "26 Aug 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Value, sense of community, fun", "cons": "Weather issues causing IROP, recent merger"}, {"review_title": "Inflight Teammates", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "10 Feb 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Nice looking uniforms and great teammates", "cons": "No empathy for crew members"}, {"review_title": "Avoid", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "16 Aug 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great for the amazing customers", "cons": "Not helpful to the employees"}, {"review_title": "Guest Services", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "15 May 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "No real pros for this company", "cons": "No real flight benefits working here"}, {"review_title": "Sr. Systems Analyst", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "21 Aug 2016", "job_title": "Senior Systems Analyst in Burlingame, CA", "duration": "N/A", "pros": "Employee centric, great benefits", "cons": "Uncertainty with Alaska merger"}, {"review_title": "Fligth attendant", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Great company to work gor", "cons": "Nonen one one cons. No"}, {"review_title": "Specialist", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "28 Jul 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "culture, people, team, richard branson", "cons": "Alaska buy out Alaska merger Alaska"}, {"review_title": "Flexible", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Flight Benefits\r\n40 1k Match\r\nFlexible\r\nPERSONAL GROWTH", "cons": "Low Pay\r\ninconsistent POLICY\r\nWork life BALANCE"}, {"review_title": "Seats", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "27 Jan 2019", "job_title": "GST", "duration": "N/A", "pros": "Great people and fun environment", "cons": "no seats at ticket counter"}], [{"review_title": "My experience was terrible", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "13 Nov 2012", "job_title": "Reservation Team Member in Kent, WA", "duration": "N/A", "pros": "it's a way to earn a quick paycheck", "cons": "They don't pay much for all the work you have to do, I wouldn't wish this job on my worst enemy"}, {"review_title": "Sucks", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "16 Oct 2014", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "The vibe is very young", "cons": "Everything revolves around work.  No work/life balance at least at my station."}, {"review_title": "Great company Poor Managers", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Benefits, Peers, Brand, Destinations, Trainers", "cons": "Scheduling team that doesn't act professionally.  Management that does not know what they are doing."}, {"review_title": "Flight Attendant", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "29 May 2012", "job_title": "Flight Attendant in San Francisco, CA", "duration": "N/A", "pros": "Great benifits. Pay just ok.", "cons": "Military like. Perfection is expected. Could be let go for yawning."}, {"review_title": "Flight attendant", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "21 May 2015", "job_title": "Flight Attendant in Los Angeles, CA", "duration": "N/A", "pros": "fun fun people, nice planes", "cons": "change in flight leaders poor management, no leadership, fake unbelieveable"}, {"review_title": "Flight Attendant", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "22 Dec 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Laid back/fun vibe & awesome work group", "cons": "Incompetent management, favoritism, poor treatment of the front line."}]]