[[{"review_title": "Awesome company", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "7 Dec 2022", "job_title": "Regulatory Advisor", "duration": "N/A", "pros": "This company offers good benefits, great PTO, and are family oriented.", "cons": "Upper management could be more transparent"}, {"review_title": "Legendary", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "26 Dec 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Best place to work. Great benefits", "cons": "No downsides to working at Anadarko."}, {"review_title": "great place to work", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "4 Oct 2021", "job_title": "Software Engineer in Houston, TX", "duration": "N/A", "pros": "nice people and great team spirit", "cons": "poor management and lack of vision"}, {"review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "17 Jun 2021", "job_title": "Geologist in Midland, TX", "duration": "N/A", "pros": "Peoples there are amazing. It is a family type atmosphere \r\nBenefits \r\nTraining\r\nCulture \r\nCompensation\r\nIT department\r\nSoftware", "cons": "CEO\r\nWork life balance\r\nUpward mobility\r\nCareer advancement \r\nLocations"}, {"review_title": "Excellent Place to Work", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "8 Jun 2021", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Company valued their employees. Great life balance and benefits.", "cons": "Constant changes and bureaucracy typical corporate world."}, {"review_title": "It was a good ride", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "30 Jun 2021", "job_title": "Senior Engineering Technician in Denver, CO", "duration": "N/A", "pros": "Salary and benefits like 401k match", "cons": "Stressful deadlines, not enough support"}, {"review_title": "Great place to work and make lasting relationships!", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "23 Dec 2020", "job_title": "Oil Rig Operator in Greeley, CO", "duration": "N/A", "pros": "Quiet, private/secluded workplace away from prying eyes.\r\n\r\nI loved my job at Anadarko! The relationships I made there (and one in particular) changed my life forever, and truly set me on a completely different course than I ever anticipated.\r\n\r\nI loved that most of what I did there was outside, and it gave me an excuse to get out and get some fresh air, even in the middle of the night. They gave me a company vehicle to drive, and it really came in handy when I needed to haul personal items with or for my family. I pretty much had free reign of the property, and there was enough room on site to store personal items, as well.\r\n\r\nEven though some things came up in my personal life that led to my separation there, I don’t have anything but good memories of my time at Anadarko. I kind of regret the way I behaved my last day on the job, and I left some things behind that other people ended up having to clean up in my absence (literally and figuratively). It was kind of embarrassing, but it’s like no real big deal, I’m sure.\r\n\r\nFor now, I’m staying busy and still working with some petroleum products. One day, I’m sure that that last day there will just be an old memory, and I can probably go back to Anadarko (now Oxy), if I ever move back to Colorado from my current residence in Wisconsin. I will be sure to bring my updated resume and hope for the best. I can’t wait to be back there, even though I hear that they removed my favorite oil batteries.", "cons": "None, really, except that the narrow hatches on the oil batteries can make it a bit difficult to maneuver for some purposes."}, {"review_title": "Excellent", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "11 Jan 2021", "job_title": "Operations Specialist in Houston, TX", "duration": "N/A", "pros": "Great culture and benefits. They rewards hard work and value their employees.", "cons": "I can't think of any."}, {"review_title": "Geologist II & Sr. Geologist with Anadarko Petroleum", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "16 May 2016", "job_title": "Senior Geologist in Denver, CO", "duration": "N/A", "pros": "The people at Anadarko are its best asset.  I was glad to come to work with respected friends and colleagues everyday.  The compensation was good, but the PTO and Friday's off were excellent perks.", "cons": "While technical training is something that Anadarko touts it is common for geologists and engineers to be pigeonholed into roles which allow for little to no technical application.  The team to which I was last assigned was comprised of a mixture of geologists and engineers.  The consensus between everyone on the team is that we all became worse geologists and engineers in that role.\r\n\r\nAnadarko is probably one of the least innovative workplaces in the industry.  While they have an exploration group, the team isn't given nearly enough time to work quality prospects.  At the time that I left the company the exploration geologists were given 90 days to identify an opportunity and complete a full regional evaluation.  It is no wonder that the company hadn't made a significant onshore discovery in the last decade and they've relied on paying premium prices for acreage followed by copy-catting other innovative E&Ps.\r\n\r\nThe last thing is the core values.  Anadarko is so proud of their core values but it's just lip-service.  You are hammered with talk about the values but it's totally insincere and it's a way to ding people on their end of year reviews.  Get rid of that nonsense."}, {"review_title": "Loved the company", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "13 Dec 2020", "job_title": "Master Electrician/E&I Tech in Corpus Christi, TX", "duration": "N/A", "pros": "Just a great place to work. Very enjoyable", "cons": "The company was bought out by occidental petroleum."}], [{"review_title": "poor", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "11 Dec 2020", "job_title": "Team Leader in Jasper, TX", "duration": "N/A", "pros": "was a good company at one time", "cons": "let illegal things go on too long"}, {"review_title": "APC was a great company to work for", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "29 Oct 2020", "job_title": "Engineering Technician II in Houston, TX", "duration": "N/A", "pros": "APC was a great company to work for", "cons": "Was purchased by Occidental Corp"}, {"review_title": "I've never seen a company that values its people as much as Anadarko. I get great affirmation and validation daily.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "28 Oct 2014", "job_title": "ITS Administrator in The Woodlands, TX", "duration": "N/A", "pros": "Vacation time (4-7 weeks, by age), competitive salary, many lucrative bonus programs, total compensation is killer, Christmas party (maroon 5, robin thicke, zac brown...), beautiful corporate headquarters, but most of all the people and culture. Values truly run the company, and how well you live those values determines your annual performance review and promotions/raises. If you are not a moral person with strong values, this is not the company for you.", "cons": "Sometimes I worry that we're not doing enough to preserve the culture and current structure of the company. Anadarko is fantastic, but a large part of what makes us successful is that we enable and empower individuals to be successful via autonomy. It feels as if some people want to add more structure and process that could potentially stifle innovation and our spirit of entrepreneurship. This hasn't happened yet, but we need to be cognizant of the risk."}, {"review_title": "Great Environment & Benefits", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "12 May 2016", "job_title": "Anonymous Employee in The Woodlands, TX", "duration": "N/A", "pros": "- All the perks (401K, medical, dental...plus more)\r\n-  Great PTO based on your age, plus 9/80 work schedule (every other Friday off)\r\n- On location gyms and cafeterias.\r\n- Abilities to learn and grow your knowledge\r\n- Great culture, company values are repeated often\r\n- Located in a safe, northern part of Houston.\r\n- Covered and monitored parking garages\r\n- Free subscription of Rosetta stone, if interested in learning a new language", "cons": "- Not too many roles to grow into, aside from manager of the department.\r\n- Currently not great to be in the oil industry (company recently had major layoffs)\r\n- Individual offices keep employees from easily communicating with one another. It keeps employees more closed off, unless they get up and walk to someones office.\r\n- Harder to make connections with most of the employees, due to it being a large company."}, {"review_title": "Challenging, rewarding, work environment based on strong fundamental values", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "1 Jun 2012", "job_title": "Senior Engineer in The Woodlands, TX", "duration": "N/A", "pros": "(engineer) Can't say enough good things about APC....compensation/benefits are outstanding, work/life balance is actually generous, opportunities are abounding if you seek them out, job crafting is yours to make. Responsibility is enormous (not a place for someone who wants to coast) and you will often find yourself wear pants sizes 2-3 sizes too big (metaphorically speaking), however, help is available when needed. \r\n\r\nThe core values are lived out and our performance reviews are based against these", "cons": "Personally its hard for me to say anything negative....I have seen other dissatisfied reviews from other departments and that's unfortunate, however, it seems like the vast majority of these reviews are coming from interns and contractors. I have not met another direct hire that seemed unsatisfied, it does seem that APC needs to focus more on these other key areas, we do rely heavily on our contractors. Not in my department, but I have seen other contract personnel treated unfairly and this should never happen, when we do this we cut our own throats\r\n\r\nHowever, contractors in my department are treated as equals, given the same amount of responsibility. etc..."}, {"review_title": "Industry Leading Benefits/Lack of vision beyond next quarterly statement", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "24 Mar 2019", "job_title": "Geologist in The Woodlands, TX", "duration": "N/A", "pros": "Combine PTO with 9/80 schedule and paid holidays and you work less days than a school teacher. Great bonus program and benefits package. Peer leading maternity/paternity leave. If you have the unfortunate luck of being marooned in Midland you are paid a 25% “geographic premium” which means a big fat paycheck, and the bar for Midland employees’ work product is pretty low. A culture that fosters physical fitness, I.e. beautiful fitness centers (at The Woodlands campus) and long lunches. Cafes are exquisite and prices for food are low in The Woodlands campus. The community around The Woodlands office is amazingly beautiful, well thought-out, and cheap! Most managers are accommodating to flexible and unique work schedules. \n\nBottom line, if you are willing to put up with a crappy culture and lucky enough to be in working in The Woodlands office it’s like getting paid to do almost nothing and living/working in Disney World.", "cons": "Management at all levels are inept, which is shocking given the size of the company. Corporate culture went in the crapper in the downturn and never recovered. Midland office debacle. Denver office in peril of closing."}, {"review_title": "Great field staff, poor middle management", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "18 May 2018", "job_title": "HSE Representative in Denver, CO", "duration": "N/A", "pros": "Compensation and benefits, down-to-earth field employees, upper management that is trying to get the company through the difficulties of growth.", "cons": "Disconnect between the field and upper management due to middle level managers, middle level managers do not appreciate the field, safety sacrificed for production, attitude from middle level managers of \"good riddance\" towards employees that are leaving rather than making the effort to keep employees, low morale for field employees and low trust environment with management, thorough career guides developed but not followed (employees with years of experience, education, and certifications kept at entry-level positions), good-ole-boy club, too many \"yes men.\""}, {"review_title": "Amazing when I started, not so now", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "5 May 2016", "job_title": "Accountant II in Shenandoah, TX", "duration": "N/A", "pros": "Anadarko has some amazing benefits. You are offered a significant amount of PTO based on your age, and a lot of on site perks. And of course the 9/80 schedule is amazing.", "cons": "They changed the bonus structure which significantly decreased. Very political. It's all about who you know. A lot of good people where laid off. I know a girl who received Needs improvement on her review and is still there while some one who received exceeds expectations was let go. The amount of management positions is absolutely ridiculous, and majority of time they are not even competent to have the position. And whatever you do, do not go to HR. They are not on your side!"}, {"review_title": "Midland office debacle", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "3 Oct 2018", "job_title": "Anonymous Employee in Midland, TX", "duration": "N/A", "pros": "Potential to be employed by a well-established, successful public oil and gas company that provides a well rounded benefits and comp package.", "cons": "The decision to move the Delaware Basin asset team to Midland from The Woodlands has resulted in 55-60%  attrition, to date, in the Land department as well as considerable turnover in other disciplines as well. This attrition has resulted in a serious culture catastrophe. Employees no longer trust middle and upper management due to the disastrous outcome of the decision to move people out to Midland without consideration of the cost of living in Midland and general decrease of quality of life in the area, coupled with the lack of succession-planning once most of the teams inevitably  left the company after their retention bonus term expired. As a Land professional, I would discourage others from joining Anadarko in Midland. There has been absolutely no benefit of moving the asset team “closer to the action” to Midland due to the handcuffs and red tape internal policies on doing deals and developing new business that Land professionals face internally with the Company."}, {"review_title": "Great Company", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "21 Nov 2015", "job_title": "Anonymous Employee in The Woodlands, TX", "duration": "N/A", "pros": "Given a lot of responsibility early in your career, open enviroment that encourages innovation, diverse portfolio which includes onshore, offshore and international assets, great facility that includes two in house gyms and the majority of employees have an office with a window", "cons": "Office is based in the woodlands which isn't attractive to younger employees, lost a lot of future leaders when Doug Lawler took them to Chesapeake so people were placed in positions they weren't ready for which causes a lot of frustration below, the company as a whole can be arrogant at times which has caused us to fall behind to our peers in our shale plays, Aggie biased environment"}], [{"review_title": "Strong company with a fading reputation", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "18 Jun 2017", "job_title": "Analyst in The Woodlands, TX", "duration": "N/A", "pros": "Freedom to innovate and explore; kind coworkers; flexible schedule; great benefits; plenty of vacation.", "cons": "Leadership is stuck in survival mode from the downturn. Although the freedom exists to experiment, new ideas are not welcomed on a whole. Decisions are required to be made at high levels, creating a disconnect to our actual needs. Arrogance exists at all levels and we do not like to admit we are wrong and move forward. The most accurate description of our vision in the current environment is \"preservation\" and creating an illusion of chasing after executive goals. \n\nFor an individual contributor, pay is competitive but do not expect to advance as a function of your performance. Employees are rank-and-file with favoritism, and those who are competent without challenging convention. I am worried for this company's future. I care for the people there."}, {"review_title": "Great Company to work for, with much benefits. Stay on people's 'good side'", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "22 May 2016", "job_title": "Division Order Analyst in The Woodlands, TX", "duration": "N/A", "pros": "Had pretty good years here. People there are mostly nice. Great amenities, great 401k (6% match), bonuses, PTO is top notch. Done by age, not experience. A lot of community involvement. Great location. Great Christmas parties, ton of things more.\n\nOverall is a great company", "cons": "Not much diversity at all, felt that they would attempt to hire to fill quota but never any prominent positions.\n\nLike most companies, it's 'who you know' to get in and advancement. There are some team leads/managers/directors that aren't 'the best' for their positions. \n\nThe discrepancy of the respect and perks vary greatly between departments. (Land Admin is viewed as a 'useless dept')"}, {"review_title": "From family to a number", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "3 Jun 2019", "job_title": "I&E Technician in The Woodlands, TX", "duration": "N/A", "pros": "The pay is good it’s at or above industry standards. The bonuses are good you just have to play the social game. Vacation is based on age not seniority at the company, which is how it should be.", "cons": "There is no feeling of true care and concern like they state in their values. This was an amazing company to work for before the FMOG acquisition now there is a feeling of deception as far as the way the legacy FMOG were ranked and brought on with APC job levels. We have been told things that were total lies about\r\nhow promotions are awarded and the structure of bonus payouts. There is also rampant sexism, racism, and bigotry from all levels employees to leadership. I rarely go a day or two and not hear something racist or some form of bigotry and or sexism."}, {"review_title": "Staff ITS Administrator", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "30 Jun 2014", "job_title": "Staff ITS Administrator in Denver, CO", "duration": "N/A", "pros": "Great salary, bonuses, benefits, etc.  I really like how they combine vacation and sick into paid time off (PTO), so that all can take advantage or get paid for not using time off.  They also have two bonus programs, a 401K match, and a retirement plan.", "cons": "Anadarko is getting to be such a large corporation that you can get pigeon holed into your specific skill set.  They tend to promote based on age rather than performance, and they never get rid of anyone, regardless of whether or not they are productive.  In addition, the cultures between Denver and The Woodlands are completely different, which makes it challenging at times.  Denver employees are much less likely to be promoted than employees in The Woodlands."}, {"review_title": "Uncertain future", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "30 Aug 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "PTO is good, 9/80 schedule, reasonable pay, 401k matching, great facilities (office, gym, cafeteria), friendly culture, no micromanaging, Metro van subsidy, sometimes interesting work.", "cons": "Lots of managers, limited ability to advance. Broken review process, some silos. No raises or promotions last year, stock based bonus eliminated. There were layoffs earlier this year. The company should implement paternity leave as a benefit if it truly cares about family and community."}, {"review_title": "Stressed market shows management true colors", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "17 Oct 2016", "job_title": "Geologist", "duration": "N/A", "pros": "As is the case for most O&G companies, salaries and benefits are generally higher than those offered for comparable positions or skills in other industries.", "cons": "Extremely unstable in current market conditions.\n\nVery poor at providing training for technical professionals.\n\nVery self-serving management reflected in lack of layoffs when the rest of the company experienced a ~20% reduction in force.  \n\nOut-dated approach to work-life balance reflected in parental leave policies (lack thereof) flexible time or workplace policies (also lacking) and relocation demands.\n\nStunningly little diversity and no obvious recognition of why this is problematic given societal, educational and demographic trends coupled with an aging work force in O&G."}, {"review_title": "A Company that Cares - New parental leave policy is a gamechanger", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "24 Aug 2018", "job_title": "Anonymous Employee in The Woodlands, TX", "duration": "N/A", "pros": "Aside from the 9/80 schedule, great retirement benefits, generous PTO allocation and opportunity for bonus - the newest parental leave policy is a game changer for my family. After utilizing the short-term disability, I was able to take an additional 4 weeks of paid time off to be with our newest addition. It gave me the peace of mind that I could take the time I needed to bond and develop our new normal after our family grew. After I returned, I was offered an awesome opportunity which was also comforting to know that while I was out being a mom, my career didn't suffer.", "cons": "None that I can think of at this time."}, {"review_title": "Great company", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Anadarko is an ethical and extremely safety, health and environmentally comciouw. Corporate leadership is visible and trustable. The pay and benefits are absolutely competitive. The company promotes from within.", "cons": "Middle management is extremely heavy. The company promotes from within but often from outside the department. I work in a central services department. Twice they have brought in young petroleum engineer with less than 4-5 years experience to supervise a team. This is done as a development opportunity for the young engineer. It does nothing for the eager 10-15 year professional, technical expert seeking to advance. It's not always a bad experience but supervisors should need to be able to do the work expected. My two favorite supervisors I worked side by side with as peers before they were my lead."}, {"review_title": "Best Of Luck", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "13 Aug 2015", "job_title": "Drilling Consultsant in Denver, CO", "duration": "N/A", "pros": "My first 18 months with Anadarko was best time I ever had working as a consultant, Good Pay, Engineering Group Young with interest to be better and willing to listen, Superintendents great to work under and always looking for ways to help in field, lots support, Management strong and truly without any question talked about operations and every aspect  of operations with the consultants on job. They preach safety and they stand behind what they preach all hands and all personnel on Anadarko property 100%.", "cons": "Nothing last forever, position's changed, management changed, micromanagement took over, always on edge, to much concern towards how fast drill a well, industry slowed down, loss rigs, run out work,"}, {"review_title": "left for dead", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "19 Oct 2016", "job_title": "Operations in Platteville, CO", "duration": "N/A", "pros": "Wage! No other company in the basin pays what APC does.  Operations wise they are in my opinion best in class, no one does a better job at innovation when it come to production.  They understand they need fresh concepts and technology to remain efficient and profitable, they do a great job promoting safety for their employees and the communities in which they operate.", "cons": "A lot of their values, especially those in the employee development arena, were simply lip service.  Open communication was a core value, however when exercised, it was frowned upon.  Bonus structure was laughable as was the operators training and leadership."}], [{"review_title": "A True Top Shelf Company", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "20 Apr 2019", "job_title": "Anonymous Employee in The Woodlands, TX", "duration": "N/A", "pros": "I was fortunate to work at several excellent oil companies during my years in the energy industry but my time  at Anadarko was particularly agreeable. Management was fair and even handed.  Company values and policies were taken seriously from the top to the bottom of the organization.  I was always able to honestly say that I was proud to be associated with Anadarko Petroleum.", "cons": "I am hard pressed to cite serious downfalls of working at Anadarko.  \r\n\r\nAlthough quite large, it was small enough to be frequently the target of take-over speculation.  Some employees may have lived under constant dread that Anadarko would be acquired and they would lose their jobs. \r\n\r\nIt was recently announced that Chevron will acquire Anadarko. Having previously been through corporate take-overs I can reassure people that although there really is life after a take-over, the apprehension is a normal and unavoidable part of the process. \r\n\r\nYou will survive it."}, {"review_title": "Oppressive, uptight, no structure, terrible treatment of interns.", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "6 Aug 2011", "job_title": "Division Order Analyst in The Woodlands, TX", "duration": "N/A", "pros": "On site doctor was nice.", "cons": "Management lets horrible employees run their departments. These employees treat the others in the group like they are dogs. No respect for your amount of time in the business. No training even though they preach all this training and mentorship. It's basically a politically driven company. Even the President tries to throw his political opinions and aspirations down your throat at meetings. \r\ni had heard bad things before starting and boy did I find out. \r\nAnother example: Computers and your back is always facing the door. i was told the first day that everyone has their office set up this way. It's so management can watch what you are doing. Also, a little eyeball pops up on the screen every now and then to let you know IT is watching you... It's just utterly ridiculous. i felt extremely stifled the whole time I was there and was miserable to even come to work. So glad I moved on and found a wonderful company to work for."}, {"review_title": "Analyst II", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "9/80 schedule and solid PTO plan is great. The health benefits and 401K matching are also quite good relative to industry peers.", "cons": "Hard work and brand loyalty is completely unappreciated and unrecognized. Also, high performers have actually gotten low balled on their salaries post-layoffs but have had to take on three times the workload of the many low performers who were given an outstanding severance. Seems kinda backwards to me. If those who stayed are \"top performers\" than you'd better start taking care of them."}, {"review_title": "You'd be hard-pressed to find another company as fantastic", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "13 Mar 2012", "job_title": "ITS Analyst in The Woodlands, TX", "duration": "N/A", "pros": "Lots of money\r\n\r\nTons of perks\r\n\r\nPension plan\r\n\r\n2 annual bonus plans: individual and company performance based\r\n\r\nGorgeous campus in The Woodlands with 3 gyms and a 12th floor basketball court (under construction in the new tower)\r\n\r\nNo less than 4 weeks vacation time based on AGE not experience\r\n\r\nCommunity involvement: everyone volunteers for a variety of causes\r\n\r\nVery diverse environment; many high-level women and minorities\r\n\r\nETHICS AND MORALS. \r\nThe company is run off of the stated values. All reviews are based on how you lived the values. This fosters a collaborative environment where everyone is quick to pass the credit where credit is due. I've never experienced such a team-oriented workplace.", "cons": "Some departments are rumored to not experience the above blissful experiences. That is unfortunate; they are by far the minority."}, {"review_title": "Company has changed beyond recognition", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "30 Jul 2014", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Company benefits are wonderful.  Love the passion most people have to be the best in the industry.", "cons": "At one time, Anadarko worked hard to encourage and mentor new industry workers, while still valuing and rewarding  the contributions of older, more experienced workers.  The last couple years, they have placed such a focus on the younger workers that it has demoralized many people with years, if not decades left to work.  The company values are made a focus for the rank and file, while seeming to be absent for many at higher levels."}, {"review_title": "Laid back place to work", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "18 Nov 2010", "job_title": " in The Woodlands, TX", "duration": "N/A", "pros": "Very easy going, lots of work to do, decent set of technologies. Taking time off is not an issue at all.", "cons": "Not a structured environment, no real quality control of the code base. No Unit or Integration tests at all. Poor code structure, no design patterns. If you're looking for an agile shop and or a place that has regular meetings, it is not the place for you. However, I will say that it's kind of what you make of it. If you push the envelope then you may be satisfied. Very easy to coast here but there are somewhat of what I would call deadlines. Not a bad place to work overall but don't expect much advancement as a contractor. Virtually impossible to go perm."}, {"review_title": "Anadarko Review", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "The PTO and pay are comperable in the industry, and the 9/80 schedule allows for long weekends- which is nice for people that want that work/life balance", "cons": "If you don't fit the corporate mold, then consider your career done. They take little to no time trying to fit people in the right positions, and will constantly promote the people that kiss the most a** rather than the people that are competent or hard workers."}, {"review_title": "Anadarko is a great company", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "26 Feb 2014", "job_title": "Analyst in Denver, CO", "duration": "N/A", "pros": "Strong company, excellent benefits and compensation compared to peers", "cons": "Company is large, red tape and territorialism sometimes makes things difficult to get accomplished.  To get a suggestion for change implemented to improve safety or profitability can be mired in territorialism and red tape to the point that suggestions for change in order to improve are often avoided by every day employees.  When you have a suggestion to improve operations or maintenance, there are several departments and layers of management that have to approve before even considering the suggestion.  There is big money being lost by the company due to the time it takes to make changes."}, {"review_title": "Bullying permitted. Polices can allow a hostile and unprofessional working environment.", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "3 Nov 2014", "job_title": "EHS in Houston, TX", "duration": "N/A", "pros": "Great rapport and work culture among offshore employees. Highly skilled facilities, drilling, and project engineering office support and technical personnel. Tenure of employees generally higher than industry averages. Opportunities to gain strong technical experience. Bonuses generally higher than industry.", "cons": "Lack of ethics and fair dealings by management in employee relations to comply with APC value statements and policies. Harassment and bullying tolerated in the workplace. Biased employee processes which lack professionalism and are inconsistent with legal requirements."}, {"review_title": "Good Company and Great People", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "27 Dec 2016", "job_title": "IT Systems Analyst in The Woodlands, TX", "duration": "N/A", "pros": "- The company is a relatively small \"community\" with lots of great people to work with.\r\n\r\n- The opportunities to collaborate with people in multiple disciplines within the company provide exposure to learning about many of the business functions that occur in an oil & gas E&P company.\r\n\r\n- In my experience, management was always willing to listen to ideas or concerns.", "cons": "- Maintaining the small / lean workforce can lead to periods of stress when there are multiple priorities competing for your time.\r\n\r\n- The oil & gas business is cyclical...that should not be a surprise.  If you stay in it long enough, your job will be impacted in some way by that fact."}], [{"review_title": "Not another intern review", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "14 Sept 2016", "job_title": "Anonymous Employee in Denver, CO", "duration": "N/A", "pros": "Good benefits package (comparable to industry), 9/80 schedule, great downtown location, relatively flexible hours", "cons": "Broken review system, lack of support for innovation, too many managers compared to number of people actually doing the work, core values used as a weapon, lack of ownership for work and accountability. Taking advantage of training opportunities is discouraged by many managers."}, {"review_title": "Grew too fast without checks and balances", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "26 Jul 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "The pay was slightly above average to my industry peers.  The PTO was excellent in addition to the 9/80 work schedule.  When management \"favored\" you, you got the backing to do what was needed (and in the best interest of the company, anyways...)", "cons": "Good old boy system dominates culture, no matter what HR says.  Many in management, from supervisors up to VPs, should not be in management.  The growth APC underwent promoted many who should never have been promoted in the beginning.  Period.  HR did not override favoritism which dominates during times of layoffs."}, {"review_title": "Accounting Summer Internship", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "1 Aug 2016", "job_title": "Accounting in The Woodlands, TX", "duration": "N/A", "pros": "Access to all levels of management due to the open door policy, opportunities to make meaninful contributions by performing value-added duties, strong emphasis on developing presentation skills and interacting with upper management, core values are central to all aspects of the company and are highly enforced, incredible amenities and work-life balance (9/80 schedule, on-site cafeterias and fitness centers).", "cons": "Long internship (13 weeks) and rigorous work schedule can force you to change your summer plans to be able to complete the internship.  The business is obviously sensitive to commodity prices, so interning during a down period reveals some discouraged outlooks among the full-time employees."}, {"review_title": "Great growing company", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "6 Aug 2010", "job_title": "Senior Staff Analyst in Houston, TX", "duration": "N/A", "pros": "Incredible benefits package and a great company. Anadarko has some of the most knowledgeable people in the industry and a great focus on work life balance.", "cons": "I really have nothing negative to say about the place. I have done work with Anadarko for several years prior to taking a position here and I truly enjoy the work and the people. I think the only potential con is the small size of the company leads to lots of direct interaction with senior management. I personally like this as you know what is going on but others would prefer to be more anonymous."}, {"review_title": "Company That Cares", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "4 Apr 2019", "job_title": "Anonymous", "duration": "N/A", "pros": "Anadarko invests heavily in their employees, providing many opportunities to grow and develop as a professional.  This includes setting annual goals for yourself and offering classes for development.  What I enjoy the most about Anadarko is how involved they are with the community.  They truly care about people, the community and the environment.  I have never worked for a company that has invested so much time and effort in fundraising and volunteering events.  It is about being a difference maker and leaving a positive impact on others.", "cons": "A very corporate atmosphere, which is good to some and not to others.  There seems to be consistent management and departmental changes.  However, with a large  international industry, this is to be somewhat expected."}, {"review_title": "Accountant II", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "29 Aug 2014", "job_title": "Accountant II in The Woodlands, TX", "duration": "N/A", "pros": "9/80 schedule, your own office, onsite gym, Huge holiday party, vanpool from all over Houston, competitive pay", "cons": "Used to be a good ole boy kinda place, mostly gone, some remnants remain. Job board is not always open process. Some individuals able to game system and do very little while moving around and getting promoted."}, {"review_title": "A good but unfocused company", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "On a macro level, I still think management wants to operate a company people want to work for.  They are making changes to corporate policy to be more accommodating in the workplace.", "cons": "I don’t think they ever truly recovered from the 2014 downturn. Engineering/Construction projects can be chaotic and lack sufficient personnel compared to peers in the Oil and Gas industry.   Political infighting and conflicting objectives seems to be pervasive in many middle management tiers leading to an overall unfocused environment."}, {"review_title": "Just another O&G operator", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "30 Oct 2015", "job_title": "Supply Chain Representative in Houston, TX", "duration": "N/A", "pros": "Great benefits as many other oil and gas operators provide.  Great location with those with families.  9/80 schedule and general work life balance very good.", "cons": "Weak upper management in roles APC sees as \"support\" create an inability to push forward real operational efficiency changes.  Not isolated to Anadarko but across most O&G operators.  With the price of oil down though hopefully APC as well as other O&G companies can learn to value what scm can actually do for the industry as out of the box thinking and innovation for cost management and operational efficiency are critical in survival."}, {"review_title": "Engineering Analyst", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "I worked with a great group of people in my department.  My immediate supervisor was very knowledgeable, very fair.  He understood the job that I had to get done and supported me in every way.  Loved the work schedule.", "cons": "Once they made the merge with the other company, there seemed to be some favoritism that played out.  Sadly, there were some individuals that were let go."}, {"review_title": "My experience at Anadarko has been supportive and fulfilling.", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "9 Aug 2011", "job_title": "Division Order Analyst II in Denver, CO", "duration": "N/A", "pros": "Anadarko always puts their employees FIRST. They give generous time off and are very supportive of a work/life balance. They also encourage personal and professional advancement.", "cons": "The different cultures between Houston and Denver can make things a little difficult at times, but it is usually not enough to stifle productivity."}], [{"review_title": "Love them when they loved me back", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "20 Apr 2016", "job_title": "IT Business Analyst in Denver, CO", "duration": "N/A", "pros": "Excellent place to work. Encouraged a good deal of independence and creativity. Certain managers were better than others. Very political with lots of personnel drama where strong personal relationships lead to advancement rather than performance.", "cons": "Executive management decisions led to lay-offs of 17% of staff including me this year. Management is still very hierarchical and business units are very siloed. Lots of programs and promotion for younger staff while senior staff have few options for growth."}, {"review_title": "Phenomenal Internship Experience", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "2 Aug 2016", "job_title": "Land Analyst in The Woodlands, TX", "duration": "N/A", "pros": "- 9/80 schedule is wonderful \r\n- Open door policy amongst all co-workers \r\n- Friendly work environment that is built off of working together and as a unit \r\n- Balance between new and experienced employees \r\n- Allowed interns to independently work and have creative freedom\r\n- Large amount of professional development through structured classes \r\n- Corporate culture exemplifies core values \r\n- Clear communication about your future opporunities at anadarko", "cons": "- Industry growing pains \r\n- hard to point out alot of cons with this company. Wonderful place to work."}, {"review_title": "Great Company", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "7 Apr 2017", "job_title": "Land Analyst in Denver, CO", "duration": "N/A", "pros": "9/80 work schedule offers amazing flexibility in scheduling. Great work-life balance. The benefits are phenomenal and the people are also great. Overall the culture suffered a bit when the prices of oil fell and layoffs happened, but it is recovering and management is doing an awesome job at pulling everyone together by focusing on core values. Parking/RTD passes are paid for. Gym subsidies. Competitive salaries... the list goes on and the benefits seem endless. Overall a fantastic company to work for!!!", "cons": "The turnover that the low oil prices has created has put a bit of strain on the people who still remain workload-wise. Nothing unmanageable."}, {"review_title": "Great Company - Some departments could use improvement", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "13 Jul 2013", "job_title": "Senior Land Specialist in Dubai", "duration": "N/A", "pros": "Anadarko has wonderful employees that are willing to help each other to get the job done quickly and effectively. We have great bonuses, benefits, PTO and tons of wonderful volunteer opportunities. Our 9/80 schedule allows for more free time which helps balance work and home life. Though the job can be demanding and stressful at times, I find that the time I spend with my coworkers and the results we achieve as a team make the stressful times worth it.", "cons": "Some department managers are stuck in the boys’ club mentality. If you are from the younger generation and are a woman, working in one of these departments means you have to prove yourself more. Having a tough skin will be necessary and you will need to advocate for yourself much more than you would in other departments. I want to stress that not all departments are like this. Many departments are run by men and women who have taken a progressive and proactive approach to managing and assessing the talent within their teams. I do feel it's necessary to point out that one of the cons of working at the company is the boys’ club mentality that still lingers in some departments."}, {"review_title": "Company on the Uptick", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "23 Nov 2017", "job_title": "Anonymous Employee in Cairo, Cairo Governorate", "duration": "N/A", "pros": "Great place for employees to make a difference right now - in any discipline. The focus on continuous improvement, innovation, and margin has never been higher. Performance is now more important than relationships, and Anadarko has shown that supervisors, managers, and even vice presidents will be held to task.", "cons": "Through the downturn, morale eroded to be \"in line\" with other E&Ps and company stock has underperformed peers. Attrition has been high in 2017, at least in Denver, as salaries have become less competitive among Denver peer companies."}, {"review_title": "Not the same company", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "7 Feb 2018", "job_title": "Engineer", "duration": "N/A", "pros": "Plenty of vacation time and 9/80 schedule but that’s pretty standard among all oil and gas companies", "cons": "Terrible leadership. Lots of new managers that don’t know what they’re doing. Serious lack of technical skills in Operations and Production engineering which led to many incidents last year. Low pay compared to peers. Weird culture that seems cultish. IT seems as if they do everything in their power to make your life miserable."}, {"review_title": "Great for Family & Friends, Bad for contractors!", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "21 Dec 2012", "job_title": "Specialist in Cairo, Cairo Governorate", "duration": "N/A", "pros": "Anadarko seems like a wonderful company to work for if you get hired.", "cons": "If you come in as a contractor, good luck, don't plan to be hired very soon if at all because you're competing against everyone's family and friends.  Anadarko is the definition of Nepotism. \r\nPlan to keep your job title for a few years as I've seen only one person in a year change titles and advance their career."}, {"review_title": "Great Benefits.", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "9 Nov 2008", "job_title": "Accounting Intern in Denver, CO", "duration": "N/A", "pros": "Lots of PTO time, much more than anything at accounting firms. Benefits are the best that I have seen including a 9 / 80 work schedule. Great fitness facility and cafe. On the woodlands waterway which is great for walking or dining. The drive is great if you live in Spring or The Woodlands or anywhere North of Houston.", "cons": "Mgmt is often not that great. It really depends on which  accounting group you are working for.  Promotions are often the result of someone leaving the company and if you dont time it correctly than you can find yourself without any movement upward."}, {"review_title": "Very uneven employee satisfaction", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "18 Feb 2014", "job_title": "Anonymous Employee in Denver, CO", "duration": "N/A", "pros": "The core values are a strong base and total compensation is on the high end.", "cons": "The core values used more as reasonsto discipline employees than a foundation to create a strong employee base.  Compensation policies are completely subjective, the actuality is that compensation does not have a true link to performance just real lose guidelines that are applied by each manager as they see fit."}, {"review_title": "I really enjoy working at this excellent company!", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "23 Jul 2017", "job_title": "Financial Advisor in The Woodlands, TX", "duration": "N/A", "pros": "There are so many smart people that I work with on a daily basis, and this makes it fun to go to work. Also, the company has many employee perks and pays well.", "cons": "The overall oil and gas industry has been hit hard over the last few years, so that has made it challenging. Also, there are so many great employees that it can be hard to move into management."}], [{"review_title": "A truly great place to work!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "24 May 2010", "job_title": " in Houston, TX", "duration": "N/A", "pros": "Anadarko has embraced a corporate culture based on valuing employees.  I have never encountered the level of executive communication with employees I enjoyed at Anadarko. Jim Hackett earns the respect and admiration of his employees.  He is nothing short of inspiring.  Hard working, talented people are recognized and appreciated usually, depending on your supervisor, and Anadarko has taken great care to appoint people with management skills to serve as their managers.   The pay is competitive for the Houston oil industry, and they share the profit through generous bonuses based on individual plus company performance.  The physical work environment is unrivalled.  Work-life balance is not just a myth at Anadarko.  You won't miss a little league game, and you'll always find time for a workout with the fitness center and running paths around the building.  If you can get in - go for it.", "cons": "It's still a corporation.  Though Anadarko does a good job of encouraging openness and communication, you must still watch your tongue.  My only gripe with Anadarko is that at the very top levels, \"Yes\" men tend to survive longer than those who are outspoken and challenge the status quo, particularly vis a vis a certain individual (not Jim Hackett) who seem to govern by fiat.  If he doesn't like you, you're out.  While iInput is appreciated and expected, resistance is not tolerated. Take care not to buy into the \"you can say anything\" lull, as it will eventually catch up with you.  Overall, however, and certainly at the mid-levels, openness and candor are appreciated."}, {"review_title": "If you miss 1970s management styles and are trying to perfect brown-nosing skills, this is the place for you", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "24 Jun 2010", "job_title": " in The Woodlands, TX", "duration": "N/A", "pros": "Convenience, decent pay and benefits, mindless repetitive job if you are looking for that type of thing.  Lower-level employees tend to be very friendly when treated fairly.  In-house gym and cafeterias are very nice.", "cons": "In the group I worked in (accounting), upper management tends to micro-manage employees and distrusts anyone but a favored few.  Employees are not allowed to make decisions in their own jobs, and you are told that you serve at the whim of management.  Poor performers are rewarded and good performers are ignored based on the amount of brown-nosing and office politicing that is done.  It was a very totalitarian, oppressive work environment where career advancement is based on if you are a \"yes-man\" who management likes (and yes, I was told I could not promote a good performer because a manager did not like them), you are encouraged to take time off as long as you are available and at your desk every day (yes, you are encouraged to take time off but if you do, it is seen as a weakness and if you don't, you're not a team player so you must take vacation time to stay at home and work), and management expouses a servant-leadership model where management is supposed to help employees but employees are used as stepping stones to job promotions.  Office politics is pervasive throughout the department and employees must constantly watch their backs."}, {"review_title": "Great Company Overall", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "9 Nov 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "- Work-life balance\r\n- 401K/Retirement plan is incredible\r\n- Team is easy to work with and lower to mid-level management generally has the IC's best interest in mind.\r\n- Strong culture among employees is emphasized and a huge positive of working here", "cons": "- Salary seems to be on the low side in certain disciplines\r\n- Silo's with minimal room for lateral movement\r\n- Mid-upper management claims to be open to lateral movement but it feels more like you are hurting yourself in the short term by expressing interest in lateral movement"}, {"review_title": "Great Place to Work!!", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "22 Feb 2010", "job_title": "Accountant in The Woodlands, TX", "duration": "N/A", "pros": "Strong Company with Strong Leadership\r\nLow turnover\r\nGreat Benefits\r\nFlexible Schedule with 9/80\r\nThe Accounting Rotational Program is Great for Recent Graduates", "cons": "Opportunities for advancement are limited - because of the low turnover, younger employees wanting to climb the ladder will find it challenging."}, {"review_title": "Anadarko is a Good Company", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "4 Oct 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "CEO and Executive committee seem to have company's and employee's best interest at heart. Which when managed correctly are one in the same.", "cons": "Middle and Lower mangement play to many games and have to many political power struggles they do not have the company or employees best interest at heart. They are out for themselves and it is blatantly obvious and disheartening."}, {"review_title": "Geology Intern", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "14 Aug 2015", "job_title": "Geoscience Intern in Denver, CO", "duration": "N/A", "pros": "One of the better industry companies you can work for.\r\nFantastic work ethics and people.\r\nCompetitive salaries and benefits that you won't get in some of the larger companies\r\nLong term employees, which means they're happy where they're at.", "cons": "Interns are sometimes given projects that are not always very relevant to making the company money. That translates sometimes in not receiving an offer, especially when commodity prices are low."}, {"review_title": "Financial analyst", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "31 Dec 2015", "job_title": "Financial Analyst in The Woodlands, TX", "duration": "N/A", "pros": "Great environment to work at with great benefits and work/life balance. Treats the employees well. 9/80 is awesome! The benefits package is the best around", "cons": "Executive level is too overly positive on their plans and not realistic on what the company is vs where they think the company is going"}, {"review_title": "Operator 2", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "26 Nov 2017", "job_title": "Operations Associate in Laramie, WY", "duration": "N/A", "pros": "I have been with Anadarko for 4 years.  The salary is great and competitive benefits.  The paid time off system is a great way to give back to the employees.", "cons": "Unfortunately Anadarko does not support family values when it comes to holidays.  When they did have a Holiday party no children aloud.  Now there just isn't a party at all.  They used to give out gift cards to employees when times where good, not so good anymore."}, {"review_title": "Summer Intern", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "They give you a lot of responsibility as an intern. My project both years has been used. \r\nMentoring is great, and you learn a lot about the industry", "cons": "Intern experience heavily depends on group. \r\nCore values are sometimes pushed aside when business gets in the way, despite the company saying they will never do that\r\nMeetings... Meetings... Meetings, some days were 6-8 hours of meetings"}, {"review_title": "HSE", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Good pay/benefits.  Operations management is solid.", "cons": "Terrible organization.  Very secretive/hierarchal.  Liability driven.  Micro-managing.  The head of my department does nothing but watch where his employees are by accessing the GPS monitoring system attached to every vehicle in the company fleet.  I found those at the top of my unit very incompetent and in a good ole boys network.  Management is very limited in that they are incapable of providing their employees with additional knowledge/challenges.  Those at the highest levels of my department were there for a reason; not to ruffle feathers, so solutions to problems often fell against core competencies of the function of Health & Safety."}], [{"review_title": "Awesome Experience", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "8 Nov 2010", "job_title": "ITS Intern III", "duration": "N/A", "pros": "Get to learn about the oil industry, take field trips to rigs, participate in lunch and learns and have the opportunity to me the C-level executives as well as VPs.", "cons": "Don't get an in-depth look at the company as a whole, you are stuck in your department and sometimes within your work group."}, {"review_title": "Company that respects family values and employee opportunities.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "26 Aug 2013", "job_title": "Project Analyst in Houston, TX", "duration": "N/A", "pros": "Advancement opportunities are available whether or not you hold a degree. As a non-degreed professional, APC has given the the ability to learn new skills on the job, while exploring where/how I would like to direct my future with the company.", "cons": "Would prefer that there was a bit more leniency for working from home. Particularly if your role is 65% or more done online."}, {"review_title": "This was a challenging and self driven position.", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "6 Mar 2015", "job_title": "Onsite AV/I T Technician in The Woodlands, TX", "duration": "N/A", "pros": "I like the culture. They made me feel like family, and they worked close with team members.", "cons": "This was a contract position. I was under the influence that I would be hired as a permanent employee all the way up to the end of my contract."}, {"review_title": "General Overview", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "22 Jan 2016", "job_title": " in Denver, CO", "duration": "N/A", "pros": "Reasonable work loads\r\nGreat benefits\r\nFast paced and interesting", "cons": "If you are not an engineer or working in a science oriented role you will find that there are two sides to this company... The differences in pay and benefits are truly astounding. \r\n\r\nWhen anything goes wrong accountability is nonexistent."}, {"review_title": "Awesome Company", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "10 Jul 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Everything at Anadarko was first class. The 9/80 work schedule was great, the benefits package was outstanding.  With the downturn in oil, layoffs did happen but that is just the business.", "cons": "Nothing.  Anadarko was wonderful, there is nothing that would have made it any better. I hope that when oil goes back up the company grows and rehires people that were laid off."}, {"review_title": "Summer 2016 Intern", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Anadarko has a really inclusive culture that allows for no person to feel like an outsider. The open door policy from all levels of management is something unique to this company. Also, as an intern, we had opportunities to mingle with the VPs of the companies - which in my experience, does not really happen at other companies. There is also flexibility with the schedule that allows the employee to still continue to pursue his/her passions while getting the work done.", "cons": "None. Have no complaints about my experience with Anadarko."}, {"review_title": "No longer holding true to their own values", "rating": "2.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "9 Aug 2016", "job_title": "Senior Analyst in The Woodlands, TX", "duration": "N/A", "pros": "Great pay, great benefits, good vacation time", "cons": "Anadarko is no longer the great company it used to be, upper management is not transparent, very little trust of management in general, lots of favoritism, no longer holding true to their values, people are scared to speak up because of retaliation"}, {"review_title": "good experience", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "13 Jan 2016", "job_title": "Drilling Engineer in The Woodlands, TX", "duration": "N/A", "pros": "Great people,  good work life balance, 9/80 schedule", "cons": "Ultimately the culture of a group depends on the manager. Some of them may not be as communicative as others, as a result there can be quite a bit of frustration."}, {"review_title": "Laid off but grateful", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "20 May 2016", "job_title": "Senior Auditor in Conroe, TX", "duration": "N/A", "pros": "Benefits are amazing and the friendships will last a lifetime. APC is very good to its employees and the community", "cons": "There is a lot of favoritism and promoting when there should be to deserving individuals.  Upper management puts their head in the sand and doesn't realize what they really have."}, {"review_title": "Financial Analyst", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "13 Jul 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great work-life balance, amazing amenities, very comfortable culture where everyone supports each other. Plenty of opportunities for advancement if you take the initiative.", "cons": "For someone just coming out of college, it was too slow paced for me. Strict 9-5 culture didn't jive with what I was looking for. Senior management is hard to get a hold of."}], [{"review_title": "Good on paper only", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "23 Aug 2017", "job_title": "Anonymous Employee in The Woodlands, TX", "duration": "N/A", "pros": "Salary, PTO, Flex Schedule, Bonuses, Gym, Cafeteria, Scenery,Offices. Why is this making me write 20 positives about this company???", "cons": "Anadarko looks phenomnal on paper ONLY. The company is corrupt from the inside out with too many layers.  Managers have titles with NO Authority. Very elitist attitudes. The managers not only enjoy discord in their groups but encourage it.  They promote if you are a part of discord only and not based on performance. Truly sad."}, {"review_title": "Good company and great benefits but management isn't the best.", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "1 Feb 2017", "job_title": "Fieldman I in Colorado Springs, CO", "duration": "N/A", "pros": "Lots of vacation days. Killer benefits. Work with a great bunch of guys. They encourage you to take classes and broaden your knowledge of your profession.", "cons": "Management likes to micro manage and it is only getting worse. It's hurting the company and productivity in the field. They need to cool it or will start to loose employees once other companies start to hire again."}, {"review_title": "Overall a great place to work, and a company that takes care of it's employees financially.", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "30 Jul 2013", "job_title": "Field Foreman", "duration": "N/A", "pros": "Opportunity for advancement\r\nPay & Bonuses\r\nVacation\r\nRetirement benefits\r\nChallenging", "cons": "Work/Life balance of field office personnel is not the same as corporate\r\nIndustry is not looked upon favorably in many areas\r\nRapid growth in some areas has led to poor managment being put in place"}, {"review_title": "Used to be a good company.", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "30 Jul 2016", "job_title": " in Houston, TX", "duration": "N/A", "pros": "Great benifits, vacation and retirement package.  Friendly team environment for the most part with a good ballance between work and familly.", "cons": "Have gone down hill in the last few years remembering that the personel in the field is what keeps things going.  Upper management has developed a do as I say not as I do culture when it comes to values."}, {"review_title": "Title Analyst", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "19 Sept 2016", "job_title": "Anonymous Employee in Denver, CO", "duration": "N/A", "pros": "Benefits are great. PTO second to none.", "cons": "Cyclical industry, a little risky if you're looking for the most stable of jobs."}, {"review_title": "Overall, A great place to work", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "24 Feb 2014", "job_title": "Senior Systems Analyst in The Woodlands, TX", "duration": "N/A", "pros": "Lots of Pros here, ease of access to location, benefits, work/life balance, bonus structure, co-workers are friendly with a family atmosphere.", "cons": "Can get stuck in one position. This is your box and don't step out the line type of mentality. Only reason I left was after years of trying to learn new things but they wouldn't let me."}, {"review_title": "Great company but poor management", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "6 Apr 2015", "job_title": " in The Woodlands, TX", "duration": "N/A", "pros": "Very good benefits (medical, 401k, etc..)\r\nNice facilities. \r\nGood pay and bonuses.", "cons": "Management is focused up and does very little to empower and effectively use the talents of their teams."}, {"review_title": "A very good place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "30 Jul 2015", "job_title": "Senior Contributor in The Woodlands, TX", "duration": "N/A", "pros": "Compensation, Benefits, and Time Off are the best features.  Strong values and ethics.  Management seems responsive to the needs of employees. Facilities at the Woodlands office are incredibly.", "cons": "Compensation is being cut due to the downturn.  The employees tend to be greedy and want more and more, especially in management."}, {"review_title": "Rep", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "5 Aug 2015", "job_title": "EHS Representative II in Austin, TX", "duration": "N/A", "pros": "I liked the hours and flexibility. The management is ok but don't care about real life situations. Thanks for the opportunity.", "cons": "Manger was over working me always on my back. Did not care when a close friend died. Made me work anyways. Also was hard to get off for Dr appt but so r a lot of jobs."}, {"review_title": "Great Place to Work", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Great Benefits - we actually have a pension plan and added benefits this year - Back up dependent care and Lifelock.\r\nGreat People - very intelligent and caring\r\nVery flexible work place", "cons": "There really are none - employees are treated well.  I think there was an entrenched \"old\" APC culture that really started to go away after the KMG merger."}], [{"review_title": "Petroleum Landman", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "16 Oct 2015", "job_title": "Landman in Houston, TX", "duration": "N/A", "pros": "Great co-workers, very team oriented and organized. Helpful in training and utilized my skill set nicely. The company has very up to date technology.", "cons": "Strict management and at times difficult to ask off for vacation depending on how the industry is doing. Expensing was diffucult at times and had some issues with upper management."}, {"review_title": "Top Tier Operators", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "2 Aug 2014", "job_title": "Supply Chain", "duration": "N/A", "pros": "Would be difficult to find a better and more encouraging large operator to work for. Excellent benefits, compensation and very encouraging people.", "cons": "International work is limited and through my experience run by consultants which carry none of the company values yet hold a great deal of power."}, {"review_title": "Disappointing", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "5 Nov 2017", "job_title": "Anonymous Employee in Midland, TX", "duration": "N/A", "pros": "Awesome campus in The Woodlands. Gyms, cafeterias, dry cleaning, car wash, all the bells and whistles. Excellent training opportunities both internally and externally along with an educational reimbursement program. PTO is second to none. Though many are leaving, there are still a lot of great people in this company.", "cons": "The US Onshore business has been a mess the past few years with the pinnacle of mismanagement being the horribly executed Midland relocation and the toll it has taken on the Delaware Basin team. \n\nSome of the 2017 highlights include: Since the Midland announcement in Sept 2016 there has been 100% turnover at the individual contributor level on the West Texas drilling & completions team, ALL of the drilling leadership has left (supervisors, managers, GMs, and the VP retired), 3-4 asset team reorgs have been fumbled through (maybe 5, hard to keep up), a safety stand down luncheon was held that was led by APC’s CAO (an attorney runs the HSE team of course) where office based employees gave advice on how to improve the disastrous safety record, a new line of VP leadership was introduced so the VP could report to a VP, the EVP who led the charge to Midland left the company, and now multiple managers in the Midland office are being relocated back to Houston less than 8 months after moving here with their families. It has been a nightmarish joke.\n\nIt really is shocking given what the organization looked like 5 years ago. As it stands now, the majority of the Delaware Basin team hasn’t worked Delaware Basin for much more than a year. The threats and coercion the leadership team utilized to get employees to relocate was a disgrace and they’re dealing with the consequences of that as employees in key disciplines continue to leave. Just to be clear, employees were told they would be fired for cause without severance if they were offered a position in Midland and turned it down.\n\nIf you are a young/mid-career engineer or geoscientist and are fortunate enough to have options, avoid this place like the plague. While there are still some quality teams scattered throughout the organization (mainly offshore), your chance of getting on one is slim and arguably non-existent in US Onshore.\n\nPay is no where near competitive. Three years of salary freezes and cutting bonuses only made it worse."}, {"review_title": "Insurance", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "10 Nov 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Does lower cost of doctor visits but still expensive until 7000 deductiblemet. HSA is helpful.", "cons": "The home care will only cover durable medical equipment so even after meeting a deductible if you need anything that is thrown away ie tubing etc. it is still out of pocket after max out of pocket. My family had nearly 1500 a month of medical not covered even after our max 7000 out of pocket and needed Medicaid as supplemental after 4 months."}, {"review_title": "Company that lives by its values", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "24 Apr 2016", "job_title": "Accountant in The Woodlands, TX", "duration": "N/A", "pros": "Company has friendly work environment, and management has open-door policy. Pay and benefits are very competitive.", "cons": "People like working here so much it can be difficult to move up in the organization since there is very low job turnover."}, {"review_title": "Accountant", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "3 Mar 2017", "job_title": "Anonymous Employee in The Woodlands, TX", "duration": "N/A", "pros": "The work life balance is quite amazing. The environment allows you to become your best and work in peace. I would definitely recommend working here.", "cons": "There are not too many cons that come to mind. The company is pretty well rounded overall. The environment is amazing and the pay is competitive."}, {"review_title": "Great if you're a shmoozer, good if you aren't", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "24 Oct 2017", "job_title": "Revenue Accountant II in Denver, CO", "duration": "N/A", "pros": "Conveniences such as dry cleaning/mail room/health clinic/masseuse available in the building. Trainings are plentiful and development is encouraged. Different parts of the business are under one parent company such as midstream and marketing functions along with E & P.  Culture and pros vary from department to department. Revenue department is flexible and willing to understand and work with individual circumstances.", "cons": "Preferential treatment may occur. Expectations are not clearly communicated."}, {"review_title": "Challenging work, providing empowerment and accountability. Working for 15 years,  it's been a blast and rewarding.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "12 Nov 2017", "job_title": "Exploration Data Manasger in The Woodlands, TX", "duration": "N/A", "pros": "Full of very smart people providing reach day to be a learning experience. The company values people willing to make safe,  calculated business decisions.", "cons": "Considering the downturn and layoffs,  have not seen work volumes decrease, that challenges the work/ life balance.  Leveraging technology requires training in technology too.  Internal communication could be better."}, {"review_title": "Reservoir Engineering Intern", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "3 Aug 2015", "job_title": "Reservoir Engineering Intern in Denver, CO", "duration": "N/A", "pros": "Overall, my experience with APC has been fantastic. I have had the opportunity to work for other companies of various size, but APC surpassed them all. From the people and culture at work, to the applicable work projects, this experience has been one I recommend to any student looking for a fulfilling internship.", "cons": "Overall, there is nothing really negative about the company. I have worked for other companies and this experience has surpassed all of my other experiences."}, {"review_title": "Great company, great experience", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "17 Aug 2010", "job_title": "Accounting Intern III in Denver, CO", "duration": "N/A", "pros": "Great exposure to the oil & gas industry, not just for accounting but operationally as well. Fantastic experience and highly recommended.", "cons": "It is big oil, and the stigma goes along with it. If you have environmental friends and family, you might want to take a second look."}], [{"review_title": "Executive Assistant", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "7 Apr 2016", "job_title": "Executive Assistant in The Woodlands, TX", "duration": "N/A", "pros": "Management is straightforward and upfront. There seems to be no hidden agendas. Benefits are tops. People are happy and awesome to work with. The company supports a healthy lifestyle and there are great facilities to help make that happen.", "cons": "I haven't found any yet."}, {"review_title": "Regulatory", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "13 May 2016", "job_title": "Anonymous Employee in The Woodlands, TX", "duration": "N/A", "pros": "Benefits and salary are great. Regulatory department is a key player in planning so good exposure to other groups and the asset teams in general. Company provides great training opportunities. Co-workers are nice and competent in their roles. Supervisors are hard working.", "cons": "There is not much upward mobility and few promotions to supervisory roles within the regulatory group. Instead, they filled the regulatory supervisor and management spots with younger engineers and people on the 'fast track.\""}, {"review_title": "Not as good as they used to be", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "The benefits are great, and the only thing that is keeping many people from walking out the door.  Also perks like gym, cafeteria, coffee bar, office on the waterway, etc.", "cons": "The company went from great to terrible in the past two years.  Middle management is working under fear, and taking it out on their direct reports.  Unfortunately, this creates a toxic environment for many."}, {"review_title": "Great organization, fell victim to the bubble.", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "5 Jan 2018", "job_title": "Anonymous Employee in Denver, CO", "duration": "N/A", "pros": "Location, staff and other co-workers were top notch people, benefits", "cons": "Can be a bit stifling for creative work.  Also, watched some money go right out of the window like when BH bought a pig for 50k a couple years ago.  :("}, {"review_title": "Awesome company to work for and be part of.", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "23 May 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Benefits are really competitive as well as there compensation package.  Tons of room for growth and learning about the business and company.  They truly care about there employees culture with regards to Safety and outside work life.", "cons": "Not many.  Too many pros and very little cons to working here but there’s a 20 word minimum to say that."}, {"review_title": "One of the best environments for a Corporation", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "20 Nov 2014", "job_title": "Finance Manager in Houston, TX", "duration": "N/A", "pros": "Great gym, starbucks, work life balance, people are nice and smart, stock options, bonus, work environment, benefits and time-off, rotations into different departments", "cons": "very structured way of doing things, upper management \"clicks\" and groups with some favoritism, get rid of servant leadership"}, {"review_title": "Good but not great", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "5 Mar 2016", "job_title": " in Denver, CO", "duration": "N/A", "pros": "Good PTO, interesting work. Opportunities to work assets in Rockies, west Texas, gulf of Mexico and international. Pay is good.", "cons": "Lack of communication from management and lack of timely decision making at most levels. Management seems to have pet favorites often."}, {"review_title": "Paid well to tolerate management", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "8 Jun 2016", "job_title": "Administrator in The Woodlands, TX", "duration": "N/A", "pros": "Benefits are great and the pay is good. Co-workers make the environment great.", "cons": "You can get trapped into positions after reaching a certain level. Until upper management retires the good ol' boy system will remain."}, {"review_title": "Operations Geologist", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "24 Oct 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great work environment. Very clean accommodating offices. Fun and interesting people to work with. Fair compensation and work benefits. A team atmosphere where everyone contributes.", "cons": "Unbalanced workload and personal time. Erratic and disruptive changes that don't make sense. Failure to integrate experienced personnel with new team members. Some lack of leadership in some departments."}, {"review_title": "Great job and great manager. The people that I worked with were great and really helpful.", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "3 Nov 2017", "job_title": "EHS in Denver, CO", "duration": "N/A", "pros": "Benefits, the teams, opportunities to volunteer, PTO. Opportunities to learn about the oil and gas industry. Free lunches sometimes as well.", "cons": "It is hard to move up. Some of the older generation didn't like change and were not happy when changes were made in the company."}], [{"review_title": "Safety Inspector", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "1 Nov 2018", "job_title": "Anonymous Employee in The Woodlands, TX", "duration": "N/A", "pros": "Anadarko is a fast growing company in the oil and gas industry.", "cons": "Working in the major projects construction industry requires you to be away from home for a long period of time. In some cases you are away for 9 months at a time. There is always a threat of being laid off and out of work."}, {"review_title": "Great company, lots of room for growth, excellent pay and benefits.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "23 Sept 2014", "job_title": "Accountant in The Woodlands, TX", "duration": "N/A", "pros": "Core values are what drives this place, big emphasis is made on them. Excellent PTO, 401-k, salary, bonus, etc.", "cons": "I wish that they would let you work from home, a lot of the work that we do can be done remotely. Maybe in the future they will allow us to do so."}, {"review_title": "Technology Group at APC", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "25 Jul 2014", "job_title": "Petrophysicist II in The Woodlands, TX", "duration": "N/A", "pros": "Very good work-life balance and benefits. Responsibility given at a young age and experience. Quality staff around you. Strong company values. Good bonus program.", "cons": "Training can sometimes be up to the employee. Cost saving can sometimes hinder individual progress. Culture of not confronting a team or employee when found at fault. HR department will always favor a senior employee/manager in case of a dispute."}, {"review_title": "Intern", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "27 May 2015", "job_title": "Intern", "duration": "N/A", "pros": "Overall a great company to work for.  I worked the pre-college internship, so it wasn't very technical.  I worked with friendly and supportive mentors that made sure I never felt lost.  Anadarko also has a gym an excellent cafeteria in the Woodlands Campus", "cons": "The atmosphere felt pretty corporate, and not so laid back as other companies I have seen.  But this is to be expected from a company this size."}, {"review_title": "Culture is key", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "1 Jun 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Anadarko has a great culture of learning, open mindedness and always wanting to do the right thing.", "cons": "Too much movement in roles, not enough structure to change management and formal transitions."}, {"review_title": "Intern experience", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "31 Jul 2015", "job_title": "Reservoir Engineering Intern in The Woodlands, TX", "duration": "N/A", "pros": "The people are what makes this company special. There are definitely awesome benefits and ameneties (basketball court, 3 cafeterias, 3 gyms etc), but that's just the cherry on top. Every intern gets a real and potentionally impactful summer project...sometimes work can get stressful, but the mentors and team for each asset have all been extremely helpful and supportive.", "cons": "Maybe too many presentations that can sometimes be more of a distration than valuable."}, {"review_title": "Intern", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "8 Jul 2016", "job_title": "Engineer", "duration": "N/A", "pros": "Top notch facilities and various locations to be exposed to which is really cool to be a part of. Great workout facilities and subsidized food", "cons": "If you are a \"yes man\", this is the place for you. Anadarko, as much as it touts it's core values, sucks the creativity and passion out of you. The core values are but a PR stunt. You'll come in bright-eyed and bushy-tailed but it's a struggle to maintain it here with the hypocrisy. So if you want to succeed here, suck it up, fake a smile and play the game."}, {"review_title": "Great Company but Changing", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "17 Jan 2018", "job_title": "Manager in The Woodlands, TX", "duration": "N/A", "pros": "Anadarko is a great company with excellent employees, a can do attitude.", "cons": "Management's vision is changing frequently and lacks focus on future exploration."}, {"review_title": "APC", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Fair pay, good bennies, decent people to deal with. Work is blossoming down by Carrizo Springs (Eagleford zone) plenty of jobs available not only from APC", "cons": "Work habits by many are lax to say the least, more worried about lunch, hunting, fishing, etc., than work ethics."}, {"review_title": "Great!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "I love working here.  Plenty of opportunity for professional Growth.  Great management team.  Smart people working hard in an inter-disciplinary environment.", "cons": "This is really hard to think of.  The most that I can think up is the inherent volatility of E&P Oil Companies."}], [{"review_title": "Wonderful company, but too much focus on socialites over hardest workers", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "14 Jun 2016", "job_title": "Specialist in The Woodlands, TX", "duration": "N/A", "pros": "Competitive pay/benefits, lots of training opportunities, good (could improve) down line communication, great culture, model company for others.", "cons": "Can be too social/political on hiring/promotions - should be “who is better for this position,” not “who do you know”."}, {"review_title": "Regulatory Analyst", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "6 Nov 2016", "job_title": "Senior Regulatory Analyst in Gillette, WY", "duration": "N/A", "pros": "Corporate values were of the highest ethical and moral vein, and employees were well compensated.  Reporting structure was clear, with opportunities for training.", "cons": "The company was top heavy with too much focus on the corporate office and too little concern for field and line staff."}, {"review_title": "Great people", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "5 Mar 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "The people here were some of the best I've ever met! Also good benefits", "cons": "So much turnover when I left, there was a new person leaving each week to go to a competing firm. This was likely due to the vague direction of the Denver office, lack of communication from the senior management, and general paralysis that seemed to be happening."}, {"review_title": "Happy not be working there anymore", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "28 Apr 2011", "job_title": " in Houston, TX", "duration": "N/A", "pros": "The Gym\r\n\r\nThe onsite Doctor\r\n\r\nOnce you get past the shiny new office environment, facilities and The Woodlands environs it's all a facade", "cons": "Utterly futile to strive to be the best you can be (at any level) when vast swathes of middle management promoted to such positions based on non-core business attributes and as a result have no idea as to what you contribute.\r\n\r\nOpen Communication core value is laughable - actually all of the core values are."}, {"review_title": "Data Cleansing", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "It was busy work that was too expensive to automate. Thus I could easily listen to podcasts and music while grinding out work.", "cons": "It was busy work that was too expensive to automate. Some of the data auditing projects were huge and took a portion of my soul."}, {"review_title": "Anadarko is great", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "15 Aug 2015", "job_title": " in The Woodlands, TX", "duration": "N/A", "pros": "Corporate culture, work-life balance, competitive salary, company on-site wellness center (free foe employees), private offices for all engineers, and excellent volunteer opportunities for employees.", "cons": "The company cafeteria is so-so at best. they turn off the AC on weekends which makes weekend work a challenge."}, {"review_title": "Great company", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "9 May 2016", "job_title": "Senior Information Systems Analyst in Nasa", "duration": "N/A", "pros": "If you are on top of your game and want to flex them skills this is the place to go.", "cons": "This only pertains to my experience. You must be on top of your skills and abreast with technology because when you are assigned, you are expected to be the expert. So if you are just learning a skill i suggest to gain an expertise in it before applying."}, {"review_title": "SVP", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "10 Jun 2017", "job_title": "Senior Director in The Woodlands, TX", "duration": "N/A", "pros": "Good Company with great core values and culture, great amenities, and location", "cons": "Massive change in leadership and poor communication of Permian execution and move plan, too much debt, last two years have been hard for most employees"}, {"review_title": "Great benefits, good company", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Great benefits and paid vacation.  Very competitive salaries.", "cons": "Too much management roles in corporate locations,  not enough strong connections in management to the field locations.  Some favoritism where senior titles are given to inexperienced staff"}, {"review_title": "Good company, great people", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "3 Feb 2015", "job_title": " in The Woodlands, TX", "duration": "N/A", "pros": "Anadarko's values are well noted and highly valued among employees.  Excellent work/life balance for employees.", "cons": "Would have liked to hear more from leadership within the department I worked regarding overall strategy, vision and plan. Lots of silos. It was not always clear what individual teams were working on, or the impact activities would have on others."}], [{"review_title": "The Best Program There Is", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Great program. as an Intern, you are assigned projects that add value to the company. The IT department makes sure you are having the most positive experience possible.", "cons": "If you don't like working in a competitive environment, this internship can be stressful. I worked for them when the market was at it's lower, so hiring wasn't great."}, {"review_title": "Engineer", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "1 Oct 2010", "job_title": "Engineer in The Woodlands, TX", "duration": "N/A", "pros": "Good place to work.  Provides a challenging environment in wich there is ample room to grow.  Good people.  Nice location", "cons": "In some respects I foud it hard to get in contact with managment if needed.  I found some people had a distaste."}, {"review_title": "Manager", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "23 Apr 2015", "job_title": " in The Woodlands, TX", "duration": "N/A", "pros": "Anadarko is guided by their Core Values and incorporate them into their performance management.  People are rated on their demonstration of Core Values.  Have never worked in a company that lived it's Core Values so completely.  Benefits and pay are terrific.  9/80 work schedule helps promote work-life balance.", "cons": "Communication from Senior Management could be better (more frequent)"}, {"review_title": "HES Representative II", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "19 Aug 2015", "job_title": "Health, Safety, and Environmental (HSE) Representative II in Englewood, CO", "duration": "N/A", "pros": "Great Company in an ever changing market. Benefits and salaries are among the best of the industry.", "cons": "Tasks were repetitive. I felt as if some people were treated as a number rather than a person."}, {"review_title": "Anadarko Petroleum Corporation review", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "21 Feb 2015", "job_title": "Tech", "duration": "N/A", "pros": "Great Salary, benefits - tons of benefits", "cons": "promote Engineers or Geologists to Managers too fast, too many layers of management"}, {"review_title": "Anadarko", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "21 May 2014", "job_title": "Credit Systems Analyst in The Woodlands, TX", "duration": "N/A", "pros": "I have been here for 10 years last March.  The company has come a long way in those 10 years.  Work/Life Balance is important now.  This company rebounded from an aging work staff to a younger more competitive workforce.", "cons": "Tend to get stuck in one position that you are good at."}, {"review_title": "Overall a great company to work for although recently things have been difficult", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "29 Dec 2016", "job_title": "Professional in The Woodlands, TX", "duration": "N/A", "pros": "Great work life balance.  PTO allows for plenty of time to do things outside of work.  Family feel at the office.  Good benefits.", "cons": "Too many layers of management at times, things can be a bit of a black box, decisions are made high up without input from the people working the fields at times."}, {"review_title": "Good Opportunity", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "23 Jun 2019", "job_title": "IT Network Administrator", "duration": "N/A", "pros": "Good people\r\nGood pay and benefits", "cons": "Little training opportunities\r\nMinimal advancement opportunities\r\nOverall poor work ethics\r\nCode of ethics is preached, but not practiced\r\nContractors generally regarded as a lesser status than employees"}, {"review_title": "Good Company with Great assets", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "28 Mar 2016", "job_title": " in Denver, CO", "duration": "N/A", "pros": "The Company has great assets to be around a long time. Great pay and benefits.", "cons": "Senior management admitted in last Town Hall that they haven't been living up to  their own values."}, {"review_title": "The best O & G company to work for", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "9 Sept 2019", "job_title": "Staff Accounting Specialist in The Woodlands, TX", "duration": "N/A", "pros": "Very collaborative, all supervisors I worked for were supportive and not micromanagers, relaxed atmosphere even under tight deadlines", "cons": "There are the \"chosen ones\" who are prepped and groomed to climb more quickly up the corporate ladder."}], [{"review_title": "Good company", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "6 Apr 2016", "job_title": "Data Scientist in Denver, CO", "duration": "N/A", "pros": "Interesting work, freedom to work on interesting projects, good benefits and pay, great location", "cons": "Management has little buy-in on analytics or how to utilize data scientists effectively, save for a few leading managers."}, {"review_title": "Geologist", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "16 May 2016", "job_title": "Geologist in The Woodlands, TX", "duration": "N/A", "pros": "I worked with a lot of good people who were great at their jobs and committed. They also had incredible benefits.", "cons": "When I started, management seemed more interested in drilling a lot of wells as fast as possible instead of figuring out the best way to drill them. Also, layoffs were handled extremely poorly."}, {"review_title": "Best Company overall", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "22 Apr 2020", "job_title": "Anonymous Employee in Houston, TX", "duration": "N/A", "pros": "This company was amazing to work for.  It was large but felt like a family.  Please genuinely cared about others and their work.  They had some of the best over all benefits in the industry.", "cons": "The company was just plagued with lawsuits and downturns. I think the biggest turning point was forcing the Midland office relocation."}, {"review_title": "Great internship program", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "1 Aug 2016", "job_title": "Accounting Intern III", "duration": "N/A", "pros": "- Real industry experience from day one\r\n- Great one on one training\r\n- Given full responsiblities and expected to ask the right questions in order to deliver well on projects/tasks\r\n- A lot of learning opportunities with the open door policy\r\n- Great culture and great people to work with\r\n- Well organized intership program\r\n- Good compensation", "cons": "Was expecting more intern activities."}, {"review_title": "Great job only if you have a good family life at home.", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "29 Nov 2009", "job_title": "Offshore I&E Tech IV", "duration": "N/A", "pros": "I love my job!!\r\nWhen your off, your off for two weeks straight and generally don't have to worry at all about work!", "cons": "At work your commited for two weeks straight in the Gulf of Mexico, away from home and family.\r\nI still love my job!"}, {"review_title": "Senior Staff Geologist", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "1 Apr 2016", "job_title": "Senior Member of Technical Staff in The Woodlands, TX", "duration": "N/A", "pros": "The company truly values creativity and collaboration between disciplines. Fast paced, entrepreneurial work environment.  Management supports the workers and does not over manage.", "cons": "Newer employees sometimes need to be aggressive in seeking out mentors."}, {"review_title": "Document Management Dept BEWARE", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "31 Mar 2016", "job_title": " in Montgomery, TX", "duration": "N/A", "pros": "Good schedule,pay and facility. The location in nice and the offices are clean", "cons": "They say they require a degree but the people they have \"leading\" have no education and no supervisory experience AT ALL. They badmouth each other and the people they support. It is very unprofessional and high school like. If you don't hang out with management or run to them like a child they will not keep you."}, {"review_title": "Has been a good company", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "1 Aug 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Competitive salary , good benefits, exceptional employees at the field level. APC has a long history and is trying to position itself for the future.", "cons": "Selling the properties that are on the current divestment list don't seem to make sense to me. Seems that cash cow properties would be a good think in this climate."}, {"review_title": "Untapped Potential", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "22 May 2018", "job_title": "Anonymous Employee in The Woodlands, TX", "duration": "N/A", "pros": "- Great people\r\n- High quality assets\r\n- Work/life balance", "cons": "- No stability, leadership is in a constant state of change.\r\n- Initiatives rolled out incomplete, then never followed through with.\r\n - Culture and trust have taken a hit as a result of reduction in force and Midland moves.\r\n- Compensation not keeping up with industry."}, {"review_title": "Didn't live up to expectations", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "5 Apr 2016", "job_title": "Staff Accountant in Houston, TX", "duration": "N/A", "pros": "Total remuneration is quite good. Free parking.", "cons": "Despite numerous promises and platitudes about loving employees, there has been a brutal round of job cuts. I understand what depressed commodity prices can do but I've never been treated this way before."}], [{"review_title": "Great place to work at!", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Awesome place to work at. A diverse group of people that bring a lot to the table in knowledge and willingness to help", "cons": "With such a large company it is tough to feel like you have a voice, but management does its best to incorporate everyone into the decision making process"}, {"review_title": "Loved the company", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "8 Apr 2016", "job_title": "Engineer I in The Woodlands, TX", "duration": "N/A", "pros": "Great culture, great compensation and benefits", "cons": "Some of the mid-level manager seemed to  think the world revolved around them, but I expect that in every company."}, {"review_title": "Division Order Analyst", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "4 May 2017", "job_title": " in Denver, CO", "duration": "N/A", "pros": "Lots of paid time off, pretty good bonus program, 9/80 schedule, personal wealth account in addition to the 401k program", "cons": "The culture is definitely in need of some work. In years past it was a great place full of promise, but not so much anymore"}, {"review_title": "Anadarko", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "23 Dec 2012", "job_title": "Engineer in Houston, TX", "duration": "N/A", "pros": "Anadarkonis great company.  It is very a nimble company that empowers its employees.  The executive management team is second to none.", "cons": "Anadarko Petroloeum is a growing company and may be losing some of what has made it great. There must be a concerted effort to remain nimble."}, {"review_title": "Great Company!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "This is a great company and any one would be lucky for be employed by them. Lots of PTO, great bonus programs, great people to work with!", "cons": "Not much to speak of...Maybe if you live in Galveston it might be a drive, but probably still worth it ;-)"}, {"review_title": "Good not Great", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Good Pay, lots of perks, most people are easy to get along with", "cons": "Too rigid, not enough opportunities for people to advance in the company"}, {"review_title": "Accounting", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "1 Jun 2017", "job_title": "Revenue Accountant in Denver, CO", "duration": "N/A", "pros": "Benefits, PTO, general work culture 9/80", "cons": "Middle management likes to play favorites.  Your career is determined by who likes you. Silos between departments mean that one department will be on board with things and another will be clueless"}, {"review_title": "Great company", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "10 May 2013", "job_title": "Mechanic in Denver, CO", "duration": "N/A", "pros": "Nice vacation 4-7weeks along with 10 additional days off. 4 days on 3 days off. Safety is #1 priority over cost", "cons": "Not very many. Haven't had a job this good before. I work less than half the year how can I complain"}, {"review_title": "Good company, stuck in the 80s. Management culture hampered progress in overhauling the IT department.", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "4 Jun 2015", "job_title": "Systems Analyst in The Woodlands, TX", "duration": "N/A", "pros": "Benefits\nSalary\nResponsibility from the get go\nFeeling trusted\nBeautiful Campus\nTraining opportunities\nLimited oversight\nTime for long lunches without being guilted", "cons": "Being treated as a second class employee\nLiving in Houston\nOlder, largely male workforce\nFeeling trapped\nFake opportunities for advancement"}, {"review_title": "Good environment, good pay and benefits", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "22 Feb 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Competitive pay for performance environment; good benefits (medical/dental/vision, 401k, EAP).  Collaborative environment, latest technology available, flexible hours, 9/80's, PTO is based on age and not years of service", "cons": "Always more work than resources available, ongoing projects, who you know gets you moving up the career ladder faster"}], [{"review_title": "Best of the Best", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "18 Nov 2015", "job_title": "Rotational Accountant in Denver, CO", "duration": "N/A", "pros": "Great salary, great benefits, great work balance, great people! This was an absolute blessing to have witnessed such a great company.", "cons": "No cons, I just don't think my position or the Oil and Gas industry is my cup of tea!"}, {"review_title": "I am very happy to say that i am working with anadarko through petrofac and i like to work directly with anadarko .", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "16 Mar 2012", "job_title": "Electrical Supt in Algiers, Algiers", "duration": "N/A", "pros": "working atmosphere, management, facilities and benefits.", "cons": "standard of sub contractors, nature of the clime t, delivery of materials on time etc"}, {"review_title": "Great company to work for", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Very well organized, committed to values, and financially responsible. This company puts a lot of energy into becoming a better company for the long run.", "cons": "There is some amount of politics and favoritism that is hard to deal with, just like most places in corporate America."}, {"review_title": "Opportunity Rich, Family Environment, Challenging Work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "10 Oct 2018", "job_title": "Anonymous Employee in The Woodlands, TX", "duration": "N/A", "pros": "Surrounded by some of the most talented people in the industry.\r\nEmployees are engaged in their community.\r\nCompensation is competitive.\r\nWork is both meaningful and challenging.\r\nOpportunities exist to move around internally.", "cons": "Recent Midland office implementation was not handled well."}, {"review_title": "Best Job ever", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "14 May 2019", "job_title": "Technical Support in Cheyenne, WY", "duration": "N/A", "pros": "The people are great, everyone cares about doing a great job, about the environment, and getting everyone home safely. It's a fast-paced and high motivation workplace", "cons": "Parking can be a trick, to get a good spot you need to be an early bird."}, {"review_title": "good place to work and live", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "7 Sept 2008", "job_title": "Engineer in The Woodlands, TX", "duration": "N/A", "pros": "Work life balance, top of the line work place facilities", "cons": "not much diversity in compensation, seems everyone at your level is paid a very tight range"}, {"review_title": "Working for Anadarko = NO personal life", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "good salary and benefits, great facilities", "cons": "hostile work environment\r\nno balance between work and personal life, excesive work hours expected\r\nexpected to work even over vacation\r\nno support from immediate managers"}, {"review_title": "technician", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "19 Aug 2015", "job_title": "Technician in Abidjan", "duration": "N/A", "pros": "i want to take up challenges which will make me to be a better oil/gas professional", "cons": "stand for a higher risk every day"}, {"review_title": "Anadarko Petroleum", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "25 Oct 2017", "job_title": "IOC Operator in Evans, CO", "duration": "N/A", "pros": "Secure job. Amazing benefits. Great scheduling. Coworkers are all great people that work hard and are reliable. The culture is one of the best in the industry!", "cons": "Location. I don’t have anymore cons to mention. Now I am just writing words to satisfy the word requirement. Done"}, {"review_title": "Highs and Lows at APC", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "23 Sept 2016", "job_title": " in Denver, CO", "duration": "N/A", "pros": "Great employee benefits. Had core values that they lived.  Enjoyable place to work. Valued time away from work as a way to reenergize.", "cons": "This company is being driven by the younger generation and the recent downsize in March was a way to purge a lot of senior employees."}], [{"review_title": "Great company", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "The company provides a lot of information to it's employees to keep them informed", "cons": "A job is only as good as the people you work with, and I had a bad experience with a few individuals.  I am not sure this reflects poorly on the company though"}, {"review_title": "Great company", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "7 Aug 2016", "job_title": "Operator in Gulf Shores, AL", "duration": "N/A", "pros": "Open communcation with personnel and really cares about workers. Safety culture is the best i've every witnessed in the GOM.", "cons": "Promotions ahave been put on hold due to downturn in O&G but that's understandable."}, {"review_title": "Review", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "12 Aug 2015", "job_title": "GIS Analyst in Denver, CO", "duration": "N/A", "pros": "Great work-life balance. They treat employees very well. The people are great mostly.", "cons": "It's a big company, so there's some competition between departments and lack of coordination. Admin and reporting requirements can get overwhelming."}, {"review_title": "Staff ITS Administrator", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "11 Nov 2012", "job_title": "Staff ITS Administrator in The Woodlands, TX", "duration": "N/A", "pros": "Balance of work and life. Excellent Benefit. Impact in small company setting.", "cons": "Less technical challenge for IT as supporting role."}, {"review_title": "Solid company", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "You can really see how much the executives really want to create a healthy culture in the company.", "cons": "Layoffs could have been handled much better, and manager level needs to have more accountability."}, {"review_title": "Anadarko work", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "21 Mar 2019", "job_title": "Production Foreman in Eunice, NM", "duration": "N/A", "pros": "They take very good care of there employees They have a very good  pay scale & benefit plan. Just a good company to work for. I worked for them 29 years", "cons": "Dont have any cons very good Co. To work for"}, {"review_title": "Great benefits, compensation and atmosphere", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "8 Sept 2013", "job_title": "Anonymous Employee in The Woodlands, TX", "duration": "N/A", "pros": "Opportunity to make a difference\r\nAccess to management\r\nCompensation\r\nBenefits\r\nCan act fast without red tape", "cons": "Getting too big too fast... May lose ability to act fast\r\nGetting too many processes and forms"}, {"review_title": "Very professional environment and nice people to work with. Everything is by the books, and there is a strict policy for everything.", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "15 Oct 2014", "job_title": "Land Department in Denver, CO", "duration": "N/A", "pros": "Great pay and benefits. Nice people and a variety of ages, types of people to work with.", "cons": "Follow protocol for every minute detail."}, {"review_title": "Favoritism was an issue", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "good pay, great location, good gym", "cons": "When all communication is based on who did what for personal gain of the boss, there is an issue.  Overall, not a good environment."}, {"review_title": "Not too shabby", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Great atmosphere, friendly people, lots of PTO", "cons": "Lack of upward mobility for certain groups, some areas highly \"political\""}], [{"review_title": "Great Company to gain experience", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "8 Jun 2016", "job_title": "Landman in Denver, CO", "duration": "N/A", "pros": "Great benefits and pay, a lot of opportunity to learn in your role.", "cons": "Did not present opportunity to move up and be promoted,"}, {"review_title": "Not the same company as first started", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "3 Aug 2016", "job_title": "Anonymous Employee in The Woodlands, TX", "duration": "N/A", "pros": "Benefits are great including vacation, flex time, health insurance, etc.", "cons": "Culture/environment is not as good as it used to be"}, {"review_title": "Good place to work still but culture is changing.", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "8 May 2019", "job_title": "Staff Geophysicist in Houston, TX", "duration": "N/A", "pros": "Culture, compensation, great PTO, nice location.", "cons": "Executives are not investing in the future of the company."}, {"review_title": "Former employer", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "24 May 2016", "job_title": " in The Woodlands, TX", "duration": "N/A", "pros": "Great Benefits and compensation, friendly atmosphere and great facilities.", "cons": "Mid to Upper level management disassociates with the workers. Would be nice to see them once in a while."}, {"review_title": "Great Company", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "10 Jun 2016", "job_title": " in Houston, TX", "duration": "N/A", "pros": "Great Benefits for employees and great facilities at HQ in the Woodland. \r\nEmployees are encouraged to take ownership of their projects.", "cons": "As with all companies in the Oil and Gas Industry, employment is at the whim of oil and gas prices."}, {"review_title": "Phenomenal company and culture. I absolutely love it there.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "17 Feb 2014", "job_title": "Finance in The Woodlands, TX", "duration": "N/A", "pros": "Great benefits. On-site gym. Tons of PTO. Competitive salary.", "cons": "As with any company where employees absolutely love it, people simply do not leave. Upward mobility opportunities unknown."}, {"review_title": "Sr. Staff Supply Chain Rep", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "14 Jul 2017", "job_title": "Anonymous Employee in The Woodlands, TX", "duration": "N/A", "pros": "Best company I have ever worked for. Excellent benefits and pension in the oil & gas industry", "cons": "So many layers of managers, GM's, PS. The managers don't have a lot of freedom to get things done."}, {"review_title": "APC review", "rating": "2.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Nice facilities, flexible schedule, and decent benefits", "cons": "Inept middle management, limited to no career growth, and extreme favoritism."}, {"review_title": "They Love Their Interns At Anadarko", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Family atmosphere\r\nReally care about the interns\r\nDedicated to your experience", "cons": "Once you get a project, you're sort of stuck with the project and it's blind assignment so it might not necessarily align with your interests."}, {"review_title": "I still love APC", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "22 Jan 2017", "job_title": "HSE in The Woodlands, TX", "duration": "N/A", "pros": "Great people, outstanding benefits. I loved working there.", "cons": "Not enough employee recognition for hard work. It seems sometimes it is not your work that gets you a promotion but who you know."}], [{"review_title": "Need more communication", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "4 Nov 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great Pay\r\nGood coworkers\r\nGood benefits for blue badge employees", "cons": "Lack of communication from management\r\nGood ole boy mentality\r\nNeed more upward opportunity"}, {"review_title": "over all a great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "9 May 2019", "job_title": "Operator III in Platteville, CO", "duration": "N/A", "pros": "good pay and benefits PTO is great", "cons": "If you get promoted is in your direct supervisors control, therefore if there is a personality conflict you will go no where despite your production."}, {"review_title": "Production Operator", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "10 Jan 2013", "job_title": "Operator in Houston, TX", "duration": "N/A", "pros": "Great atmosphere to learn with people who are willing to share their knowledge. If you are willing to put forth the effort, your growth within the company can be unimaginable.", "cons": "I have no cons at this time"}, {"review_title": "Best oil compnay out there.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "3 Mar 2014", "job_title": "Senior Staff IT Administrator in The Woodlands, TX", "duration": "N/A", "pros": "Everything works well in this company. They find reserves, and take care of their employees. Great benefits, culture, and training.", "cons": "I have not seen any cons."}, {"review_title": "Engineer", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "20 Apr 2018", "job_title": "Anonymous Employee in Denver, CO", "duration": "N/A", "pros": "9/80's for corporate folks.", "cons": "Politics abound. Too much inbreeding (promoting from within, regardless of skill or talent). Doesn't seem like managers or supervisors are trained by HR in anything, or if they, are they are not being assessed for competency. Decisions being made are to benefit the old boy network, over safety or getting the job done right. Core values have no meaning anymore."}, {"review_title": "Horrible", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "7 Jul 2011", "job_title": "Staff Division Order Analyst in The Woodlands, TX", "duration": "N/A", "pros": "Paid time off for family", "cons": "Politics, like working for the government. Horrible treatment of employees by other workers ALLOWED.  Been in this business almost 20 years and I will say it's the strangest organization I've ever worked for. Can't wait to find something else! Don't believe the hype that surrounds this company. All that glitters is definitely not GOLD."}, {"review_title": "Ok", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "7 Mar 2016", "job_title": "Anonymous Employee in The Woodlands, TX", "duration": "N/A", "pros": "great benefits, good company portfolio", "cons": "unqualified management, poor communication, values don't seem to apply to management, salary lags peers, long hours"}, {"review_title": "Anadarko Petroleum", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "20 Apr 2016", "job_title": "HSE Representative in Conroe, TX", "duration": "N/A", "pros": "Great benefits and perks, supportive of career growth and change, flexible and great work/life balance", "cons": "sometimes a bit unorganized, management heavy, too many changes and inconsistencies"}, {"review_title": "Manager", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "19 May 2016", "job_title": "Anonymous Employee in Houston, TX", "duration": "N/A", "pros": "benefits, work/life balance, compensation, HR department", "cons": "Who you know means more than what you know."}, {"review_title": "Geophysicist", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Great company, work life balance, good pay, great office. Opportunity to expand", "cons": "Alot of meetings, upper mgmt can be disconnected from the people. Lack of transparency"}], [{"review_title": "Anadarko has an amazing workplace culture", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "17 Aug 2015", "job_title": "Director in The Woodlands, TX", "duration": "N/A", "pros": "They are driven to operate within their cash flow and are committed to their people which provides great security.", "cons": "Subject to the ups abd downs for the commodity markets."}, {"review_title": "no integrity", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "4 Aug 2016", "job_title": "Supply Chain in Denver, CO", "duration": "N/A", "pros": "9/80S, free parking, health benefits, workout funding", "cons": "they preach integrity and don'g live up to it"}, {"review_title": "Tough times", "rating": "2.0", "reviewer_affiliation": "Former Employee", "job_date": "17 Nov 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Decent pay, good people, fun when oil is high", "cons": "Lack of support with low oil prices. Good ol boy system."}, {"review_title": "Great environment", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "3 Feb 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "They care about their employees", "cons": "They insist on movement within the company to avoid stagnation, but sometimes it seems just for the sake of movement"}, {"review_title": "Gas Plant Operator", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "10 Jun 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Safety oriented culture that encourage  employees to step outside their comfort zone and learn new skills  - hard work is rewarded", "cons": "current assignment is in the middle of nowhere"}, {"review_title": "Great place to work with an exciting culture!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "26 Mar 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Competitive pay, great benefits, excellent people, opportunity for growth.", "cons": "Obviously no company is perfect, but no real negatives stand out."}, {"review_title": "It's a good company to work for", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "14 Jan 2015", "job_title": "Financial Analyst in The Woodlands, TX", "duration": "N/A", "pros": "Really good benefits and relaxed environment.", "cons": "People that work here tend to be quite arrogant."}, {"review_title": "Great Company", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "24 Feb 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great management, good benefits, when oil prices are good there is a lot of opportunity.", "cons": "Doesn't reflect Anadarko directly, just tough to ride the highs and lows of the energy industry."}, {"review_title": "Facilities Engineer", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "14 Apr 2016", "job_title": "Facilities Engineer in Denver, CO", "duration": "N/A", "pros": "Pay, Vacation, work schedule (9/80).  Growth within the company was fun!", "cons": "Becoming too big with bureaucracy."}, {"review_title": "Used to be amazing", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "28 Feb 2018", "job_title": "E&I Technician in Denver, CO", "duration": "N/A", "pros": "Great people work here. Benefits are on par.", "cons": "There are good people but a lot gets lost in management."}], [{"review_title": "Good place terrible management", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "3 May 2019", "job_title": "Engineer", "duration": "N/A", "pros": "Good pay lots of work", "cons": "Management has no idea what’s going on"}, {"review_title": "Great company, terrible manager that I report to.", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "17 Mar 2011", "job_title": "Senior ITS Administrator (Automation) in Denver, CO", "duration": "N/A", "pros": "Good benefits, good pay, decent size bonuses, etc.", "cons": "Politics, politics, and more politics......"}, {"review_title": "Great Company", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "11 Sept 2015", "job_title": "DRILLING CONSULTANT in Evans, CO", "duration": "N/A", "pros": "They were very safety conscious, had strong team values and a drive for excellence.", "cons": "Did not support local workers to their full capacity."}, {"review_title": "Supervisor needs training STAT", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "26 Jan 2016", "job_title": "Anonymous Employee in The Woodlands, TX", "duration": "N/A", "pros": "benefits and PTO are amazing", "cons": "My supervisor had no clue how to supervise direct reports"}, {"review_title": "Production Engineer", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Great benefits, work life balance", "cons": "Management is wasteful, out of touch with operations, and tends to value employees that \"play the game\""}, {"review_title": "Its been a good and rewarding experience", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "6 Oct 2011", "job_title": " in Houston, TX", "duration": "N/A", "pros": "Good compensation package\r\nGood retirement package\r\nGood Work life balance\r\nOpen door policy\r\nBrilliant coworker\r\nImproving diversity of employee\r\nMerit based", "cons": "Corporate politics (same as everywhere I guess)\r\nToo conservative"}, {"review_title": "Incredible Company", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "22 Jul 2015", "job_title": "Accounting Specialist III in The Woodlands, TX", "duration": "N/A", "pros": "Company culture, values, integrity. Learning atmosphere. Gym, Starbucks, cafes. Amazing opportunities for growth and advancement. Excellent benefits and PTO offerings. Love this place.", "cons": ".... I haven't found any."}, {"review_title": "Operator/ Mechanic", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "5 Nov 2018", "job_title": "Anonymous Employee in The Woodlands, TX", "duration": "N/A", "pros": "Great people, safe working culture, really cares about their employees", "cons": "Being away from your family for two weeks at a time and sometimes working on your days off"}, {"review_title": "Experience at Anadarko", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "8 Mar 2020", "job_title": "Reservoir Simulation Engineer in The Woodlands, TX", "duration": "N/A", "pros": "Excellent co-workers and availability of all tools and training to do the job", "cons": "Directions from the management not clear"}, {"review_title": "Never work for this place", "rating": "1.0", "reviewer_affiliation": "Current Employee", "job_date": "20 Aug 2010", "job_title": "IT Department in The Woodlands, TX", "duration": "N/A", "pros": "Can't think of any, oh Money", "cons": "Worst job I ever had, disfunctional team enviornment, mgt and employess's degraded contractors.  If anyone asks you to work for the IT dept run like hell. a buch of ass kissers"}], [{"review_title": "Inconsistent", "rating": "3.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "People, benefits, time off programs", "cons": "Opportunities for advancement needs to be addressed."}, {"review_title": "Engineering/ Petroleum Technician", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "2 Mar 2016", "job_title": "Engineering and Petroleum Technician in Gillette, WY", "duration": "N/A", "pros": "Excellent management, benefits, vacation, bonuses and pay. Would return if they were still in my area.", "cons": "No complaints with Anadarko Petroleum."}, {"review_title": "Great company", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Benefits, work environment, opportunity to rotate to various disciplines", "cons": "Some bad managers here and there"}, {"review_title": "APC", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Great company with good culture.", "cons": "Can be too much of a  \"big\" company with the associated politics."}, {"review_title": "Wonderful company to work for with smart and friendly employees and great benefits", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "core values, real work for interns, and friendly people", "cons": "There were no cons to my internship"}, {"review_title": "Wonderful experience, wish I could go back.", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "People working there are very nice, professional.  Great working atmosphere.", "cons": "Contractors don't get hired in."}, {"review_title": "Senior ITS Administrator", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "19 Dec 2016", "job_title": "Senior ITS Administrator in The Woodlands, TX", "duration": "N/A", "pros": "Great environment Great people Positive attitude.", "cons": "They are losing the \"small company\" culture as they get bigger."}, {"review_title": "Manager", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "7 May 2017", "job_title": "Manager in Denver, CO", "duration": "N/A", "pros": "Great pay, benefits, incentives.\r\nManagement is in transition and striving to increase efficiencies", "cons": "Volatility of oil prices, social license to operate add to stresses of job and uncertainty."}, {"review_title": "Staff HSE Representative", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "2 Jan 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great benefits that are hard to top.", "cons": "Terrible ever changing management that has limited sense of direction.  Reorgs are a constant variable to work around."}, {"review_title": "A great company... until it wasn't", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "14 May 2020", "job_title": "IT Manager in The Woodlands, TX", "duration": "N/A", "pros": "Wonderful Culture\r\nGood People\r\nBalanced Innovation\r\nGreat office Perks\r\nExcellent home town community", "cons": "Company started to slide when focus changed from Exploration to short cycle monetization."}], [{"review_title": "Great company", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "22 Oct 2014", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great environment, people are nice.  Compensation is nice, but the culture is the real benefit.", "cons": "Some limitations on movement, not really bad, but some."}, {"review_title": "Great company!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "23 Nov 2014", "job_title": "Accountant II in The Woodlands, TX", "duration": "N/A", "pros": "Benefits and great company to work for.", "cons": "Politics and typical corporate boundaries."}, {"review_title": "Staff Analyst", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Work-life balance is very good.", "cons": "Company politics can be very hard to navigate like a lot of companies"}, {"review_title": "Engineer", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Good environment and no state tax.", "cons": "None, so far. Traffic could be an issue."}, {"review_title": "Good Company", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "11 Mar 2016", "job_title": " in The Woodlands, TX", "duration": "N/A", "pros": "9 80 schedule is awesome", "cons": "Rumored to take away the 9 80 schedule"}, {"review_title": "Great Company", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "11 Mar 2017", "job_title": "Financial Analyst II in The Woodlands, TX", "duration": "N/A", "pros": "Competitive pay, great benefits, 9/80 work schedule, gyms and basketball court on site", "cons": "I do not have any Cons related to my experience with APC."}, {"review_title": "Human |Resource Assistente", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "27 Nov 2017", "job_title": "Human Resources Assistant in Matola, Maputo Province", "duration": "N/A", "pros": "Gain Experience, and contrubute with my experience and knowlegde.", "cons": "There is not any unconvinince"}, {"review_title": "Positive", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "27 Apr 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Professional, talented people throughout the organization", "cons": "None worth mentioning - very collaborative environment"}, {"review_title": "Excellent place to work", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "5 May 2015", "job_title": "QAQC MANAGER in Denver, CO", "duration": "N/A", "pros": "Management treats you as family and really know their jobs.", "cons": "There are no cons with this company"}, {"review_title": "Great Company - solid direction", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "The company is headed in the right direction, good focus on appropriate growth.", "cons": "Sometimes too much conversation about shareholder return."}], [{"review_title": "Great work/life balance!", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "7 Jan 2016", "job_title": "Accountant II in Lakewood, CO", "duration": "N/A", "pros": "Your opinion is valued, work/life balance, salary, benefits, great co-workers and culture", "cons": "Don't offer part time hours"}, {"review_title": "Great Company To Work For", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "19 Jul 2016", "job_title": "Senior Production Engineer in Thornton, CO", "duration": "N/A", "pros": "Great company to work for. Had great values that were seen through out the culture.", "cons": "Some of the leadership was lacking."}, {"review_title": "Accounting Manager", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "13 Feb 2018", "job_title": "Accounting Manager in The Woodlands, TX", "duration": "N/A", "pros": "Good people, strong corporate values and work-life balance.", "cons": "Significant turnover in upper management straining organizational identity."}, {"review_title": "Great place to work", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "20 Feb 2019", "job_title": "Plant Operator in Platteville, CO", "duration": "N/A", "pros": "benefits, pay, bonus, PTO, and", "cons": "honestly not a whole lot. Expected to work a good amount of days off throughout the year"}, {"review_title": "Best Company to Work For", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "21 Aug 2019", "job_title": "IT Auditor in The Woodlands, TX", "duration": "N/A", "pros": "4 Weeks PTO!?\r\nHuge sign on bonus!?\r\nHigh starting salary with yearly bonus", "cons": "I wish the company would not have been sold!"}, {"review_title": "Great People", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "21 Jan 2020", "job_title": "Staff Analyst in Midland, TX", "duration": "N/A", "pros": "Anadarko was the best place to work. The company always valued their employees.", "cons": "Sold to Occidental and paid way too much."}, {"review_title": "Anadarko is a great company!", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "10 Oct 2012", "job_title": "Landman in Denver, CO", "duration": "N/A", "pros": "Innovative, Strong Corporate Values, Excellent Employees", "cons": "It is a big company and there are polics involved (like all big companies)"}, {"review_title": "Engineer", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "11 May 2014", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Compensation is very competitive as well as benefits", "cons": "I did not spend enough time working here to see any cons with the company"}, {"review_title": "First Class Organization", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "19 Jun 2015", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Very professional, great leadership, first class", "cons": "Company politics seem to play a part at the top"}, {"review_title": "Very Dissapointed", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "9 Oct 2015", "job_title": "Human Resources in The Woodlands, TX", "duration": "N/A", "pros": "close to the house. Has a gym on site and is surrounded by good places to eat.", "cons": "Terrible leadership and a lot of the business groups are disconnected.  Very micro managing atmosphere.  Really does not have an overall good culture."}], [{"review_title": "Great Company!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "19 Feb 2016", "job_title": " in The Woodlands, TX", "duration": "N/A", "pros": "Benefits, opportunities and people offer exciting career.", "cons": "None come to mind as the company is unique in how it addresses challenges."}, {"review_title": "APC Review", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Great people to work with", "cons": "Company culture varies significantly between business units"}, {"review_title": "Production Engineering Advisor", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "3 Oct 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Good compensation packages for engineers.", "cons": "Poor direction from Senior Management"}, {"review_title": "Decent oil and gas company", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "27 Aug 2017", "job_title": "Plant Operator in Denver, CO", "duration": "N/A", "pros": "Great benefits. Decent PTO.", "cons": "Too large. Middle management heavy."}, {"review_title": "Marketing", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "14 Nov 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great Pay, good work-life balance-", "cons": "Even if you are a great employee, it depends who you know to advance."}, {"review_title": "Great Company to work for", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "3 Aug 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great benefits, amazing people and awesome location.", "cons": "Not much to say that's negative.  I enjoyed my time there."}, {"review_title": "Family atmosphere", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "24 Apr 2014", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "The Good work-life balance helps", "cons": "Need more potential for advancement"}, {"review_title": "Good place to work when oil prices are up", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "5 Jun 2016", "job_title": "SAS Developer | SQL Programmer | ETL Developer | Database Developer in Fort Worth, TX", "duration": "N/A", "pros": "Great benefits and work environment", "cons": "Can be stressful, very cyclical market"}, {"review_title": "Field Engineer Intern", "rating": "3.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Great pay, that was nice.", "cons": "EXTREMELY boring work, I wish I had been able to do something more meaningful."}, {"review_title": "Stay Away", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "15 Aug 2017", "job_title": "Senior Engineer in Denver, CO", "duration": "N/A", "pros": "Base pay is pretty good", "cons": "Corporate culture, \"good ol' boys club\", Lip service on core values, no chance for promotions or pay increases."}], [{"review_title": "Great opportunity,and outstanding leadership.", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "10 Sept 2014", "job_title": "Offshore Production Operator I in Woodland Heights, TX", "duration": "N/A", "pros": "Plenty of time off to enjoy quality of life.", "cons": "Away from home 6 months of the year."}, {"review_title": "Review", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "28 Jul 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Good pay and great benefits", "cons": "Becoming more and more bureaucratic"}, {"review_title": "Procurement", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "5 Aug 2016", "job_title": "Procurement in The Woodlands, TX", "duration": "N/A", "pros": "Great company to work for. Great environment always paid on time.", "cons": "I did not find anything negative at this company."}, {"review_title": "Loved it!", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "2 May 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "One of the best company to work for.", "cons": "Getting into the company is highly competitive"}, {"review_title": "Executive Assistant / Sr Staff SCM Specialist", "rating": "5.0", "reviewer_affiliation": "Former Employee, less than 1 year", "job_date": "25 May 2017", "job_title": "Anonymous Employee in Austin, TX", "duration": "N/A", "pros": "Great Values and good to their employees", "cons": "Respect by other employees that were not addressed"}, {"review_title": "Treats employees well", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "9 Dec 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Good benefits and work culture; I liked the people", "cons": "Upper management seemed disconnected from what was happening on the ground"}, {"review_title": "Great company to work for!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "31 Jan 2014", "job_title": "OPerator V in Bethel, Optional[TX]", "duration": "N/A", "pros": "Pay, benefits, family atmosphere, vacation", "cons": "Rotating shift work makes it hard for a healthy life style."}, {"review_title": "Anadarko", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Great work enviornment, they really want you to succeed.", "cons": "Lots of driving and kong hours"}, {"review_title": "Love it", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "16 Apr 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "awesome people who are passionate and self starters", "cons": "I like it all at Anadarko."}, {"review_title": "Amazing Company", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "26 Jul 2016", "job_title": "Technology in The Woodlands, TX", "duration": "N/A", "pros": "This is a great company, great benefits and great people", "cons": "I did not like the drive to the Woodlands"}], [{"review_title": "Excellent Compensation", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Excellent Compensation\r\nCorporation active in community and local charaties", "cons": "Lower management could use more training and experience"}, {"review_title": "Operator", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "14 Nov 2017", "job_title": "Operations in Evans, CO", "duration": "N/A", "pros": "This is a good job", "cons": "The people have issues with basic things"}, {"review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "25 Mar 2019", "job_title": "GeoTech in Houston, TX", "duration": "N/A", "pros": "Fitness center, 9/80 work schedule, great benefits", "cons": "No cons to report. Great experience"}, {"review_title": "Awesome work life balance, great schedules, excellent pay and benefits", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "2 May 2019", "job_title": "Operator III in Denver, CO", "duration": "N/A", "pros": "Best company to work for", "cons": "I have no cons to report"}, {"review_title": "Decent", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "12 May 2020", "job_title": "Production Engineer", "duration": "N/A", "pros": "Was a lot better before upper management was changed and everything turned very political.", "cons": "Some of the upper management and politics."}, {"review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "23 Sept 2014", "job_title": "Senior Staff Analyst in The Woodlands, TX", "duration": "N/A", "pros": "Excellent benefits and career advancement opportuniities", "cons": "None i can think of"}, {"review_title": "Great family/life balance", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Great benefits like medical, dental, vision, and amazing PTO!", "cons": "The industry is no longer providing growth opportunities."}, {"review_title": "Best Company to work for", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "17 Jan 2017", "job_title": "Senior AP Coder and Analyst in Houston, TX", "duration": "N/A", "pros": "great company to work for", "cons": "while I was there I did not face any cons."}, {"review_title": "Decent money and schedule mostly", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "18 May 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Good money and schedule usually", "cons": "Will let you go but keep all the people you trained"}, {"review_title": "Great place to work", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "8 Feb 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Flexibility, benefits, the coworkers are great", "cons": "Volatility of oil and gas, uncertainty in future of industry"}], [{"review_title": "Internal controls", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "14 Mar 2018", "job_title": "Anonymous Employee in The Woodlands, TX", "duration": "N/A", "pros": "Awesome benefits and salaries plus pto", "cons": "Culture has gone down in the last few years"}, {"review_title": "IT Director", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "24 Mar 2018", "job_title": "Product Development Manager in Houston, TX", "duration": "N/A", "pros": "APC has good benefits, takes care of employees.", "cons": "Impacted by Oil & Gas market cycles"}, {"review_title": "Lawyer", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "4 Dec 2018", "job_title": "Counsel in The Woodlands, TX", "duration": "N/A", "pros": "Was great environment for innovation", "cons": "President took it down - incapable leadership"}, {"review_title": "Good Job", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "23 Aug 2011", "job_title": "IT Specialist in Denver, CO", "duration": "N/A", "pros": "Decent money, lots to do, some downtime.", "cons": "Make more oppurtunities for advancement available."}, {"review_title": "NA", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "25 Oct 2015", "job_title": "Anonymous Employee in Denver, CO", "duration": "N/A", "pros": "Good pay, smart employess, opportunities to learn in new areas", "cons": "Work/life balance is sometimes unbalanced"}, {"review_title": "Review", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Many opportunities for advancement in the company", "cons": "None that I can think of"}, {"review_title": "Plant Operator II", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "19 May 2016", "job_title": "EHS Specialist II in Farmington, NM", "duration": "N/A", "pros": "Great pay and great benefits.", "cons": "To much of the good ol boy attitude!"}, {"review_title": "Operator", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "31 Jul 2016", "job_title": "Anonymous Employee in Houston, TX", "duration": "N/A", "pros": "great company to work for. Decent compisation.", "cons": "promotions are political, and not by work ethic."}, {"review_title": "Great Company!", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "11 Aug 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Friendly co-workers, great core values , excellent compensation and benefits", "cons": "Nothing I would change at this time"}, {"review_title": "Supply Chain Rep", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "28 Nov 2017", "job_title": "Supply Chain in Denver, CO", "duration": "N/A", "pros": "Work-Life balance, Paid Time Off, 9/80 Schedule", "cons": "Salary and compensation is low for my field."}], [{"review_title": "Intern--Hourly", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Great benefits and a lot of accommodations.", "cons": "Employees keep to themselves quite a bit"}, {"review_title": "Engineer at Anadarko", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "12 Apr 2019", "job_title": "Engineer in The Woodlands, TX", "duration": "N/A", "pros": "Work close to home - great work/life balance.", "cons": "Lack of career opportunities.  Not inspired by senior management."}, {"review_title": "Anadarko is awesome", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "29 Apr 2019", "job_title": "Lease Operator", "duration": "N/A", "pros": "Benefits and Pay are amazing", "cons": "Sell out to larger company is a bad move."}, {"review_title": "Changed", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "22 May 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Depending on where you support, people are the heartbeat of this place.", "cons": "Leadership is not what it used to be"}, {"review_title": "It was great", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "23 Sept 2019", "job_title": "Staff Data Engineer in Denver, CO", "duration": "N/A", "pros": "Great compensation and work environment.", "cons": "Company was sold... I think Oxy looks good also but still changing."}, {"review_title": "Landman", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "29 Mar 2016", "job_title": "Anonymous Employee in The Woodlands, TX", "duration": "N/A", "pros": "Integrity and trust, servant leadership,", "cons": "Oil and gas industry can by cyclical"}, {"review_title": "Forman", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "7 Feb 2017", "job_title": "Foreman", "duration": "N/A", "pros": "Compensation, work life balance, pto program,", "cons": "Incompetent management, preaching of values not practiced by senior management"}, {"review_title": "Jib accountant", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 10 years", "job_date": "15 Jul 2017", "job_title": "Anonymous Employee in Denver, CO", "duration": "N/A", "pros": "Great benifits and great coworkers .", "cons": "Red tape, lousy corporate administration"}, {"review_title": "Midstream Engineering Intern IV", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "13 Aug 2019", "job_title": "Intern", "duration": "N/A", "pros": "Great company culture and values", "cons": "There are no cons that I have seen"}, {"review_title": "Great work place (now Oxy)", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "20 Aug 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great workplace, good work life balance", "cons": "Can't think of any at this time"}], [{"review_title": "Great until we were sold", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "27 Aug 2019", "job_title": "Staff Accountant in The Woodlands, TX", "duration": "N/A", "pros": "most everything was good while it lasted", "cons": "not much except for getting sold"}, {"review_title": "Great Culture", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "26 Feb 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great culture, competitive payment and benefits", "cons": "This company was purchased and it is unknown what will change."}, {"review_title": "Good Company to work for in the past", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "29 Apr 2020", "job_title": "Staff Reservoir Engineer in Houston, TX", "duration": "N/A", "pros": "Great benefits and compensation overall.", "cons": "culture deteriorated in last few years"}, {"review_title": "Land Professional", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Core values, benefits, location, cross-training", "cons": "\"Good old boy\" network may still be alive and well"}, {"review_title": "Geophysicist", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "10 Aug 2015", "job_title": "Anonymous Employee in The Woodlands, TX", "duration": "N/A", "pros": "Great atmosphere, people are really nice and helpful. Technology is great", "cons": "Nothing really to think of"}, {"review_title": "fieldman", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "10 Dec 2017", "job_title": "Fieldman in Platteville, CO", "duration": "N/A", "pros": "great benifits and company truck in nice", "cons": "work load that comes with the oil field"}, {"review_title": "Best work-life balance", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Excellent work-life balance\nChallenging Projects\nAmazing team", "cons": "Only location (but only for non North Houston residents)"}, {"review_title": "Good name but not so good culture", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "10 Apr 2019", "job_title": "Staff Tax Analyst in The Woodlands, TX", "duration": "N/A", "pros": "Good pay, benefits, upper management bringing changes", "cons": "Company culture, overtime, management politics,"}, {"review_title": "Great company!", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "12 Apr 2019", "job_title": "Measurement Technician in Kermit, TX", "duration": "N/A", "pros": "Love the safety culture and atmosphere.", "cons": "None really, everything is really good here, no complaints."}, {"review_title": "Best company in the industry", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "28 Apr 2020", "job_title": "Operations Manager in The Woodlands, TX", "duration": "N/A", "pros": "Benefits, compensation, employees, campus, location", "cons": "It was ruined by Oxy"}], [{"review_title": "Great company.", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Great people, benefits, culture, etc...", "cons": "I do not have any cons."}, {"review_title": "Good Company", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "9 May 2015", "job_title": "Supply Chain Representative in The Woodlands, TX", "duration": "N/A", "pros": "Fantastic Benefits. Great work life balance. Strong 401k match.", "cons": "I can't think of anything significant..."}, {"review_title": "Drilling Consultant", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "25 Aug 2015", "job_title": "Drilling Consultsant in Denver, CO", "duration": "N/A", "pros": "Safety Standards, Treat employees good", "cons": "Need better office to field communication"}, {"review_title": "Very good company to work for", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "25 Feb 2019", "job_title": "Reservoir Engineer", "duration": "N/A", "pros": "Great work culture\r\nGreat Location\r\nVery welcoming", "cons": "Have not found anything yet"}, {"review_title": "Awesome Benefits", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "13 Apr 2019", "job_title": "Senior Production Engineer in Houston, TX", "duration": "N/A", "pros": "Great workplace environment and challenging opportunities.", "cons": "Difficult to maintain work life balance at sometimes"}, {"review_title": "Class", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "8 Nov 2019", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Good in pay the salary is good", "cons": "Work early At morning at six o’clock"}, {"review_title": "Great Company", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "26 Mar 2020", "job_title": "Supply Chain in The Woodlands, TX", "duration": "N/A", "pros": "Benefits and ability to advance career are amazing", "cons": "Oil industry is up and down"}, {"review_title": "Great company", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "6 Apr 2020", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great company, best benefits and culture", "cons": "None, too bad it is no longer there"}, {"review_title": "Great company!", "rating": "4.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Positive attitudes, great benefits, great work life balance", "cons": "Not enough advancement opportunities for non-engineers"}, {"review_title": "Strong core values", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "26 Apr 2016", "job_title": "Supply Chain Supervisor in Greeley, CO", "duration": "N/A", "pros": "Strong core values that most employees live by.", "cons": "Oil and gas commodity hurting."}], [{"review_title": "Marketing Operations Analyst", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "3 Sept 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great atmosphere, great management, great pay!", "cons": "I honestly can't think of one."}, {"review_title": "Field Analyst II", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "26 Dec 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "growing opportunities and good work environment", "cons": "industry economy has not  helped work guaranteed"}, {"review_title": "Forced Relocation", "rating": "1.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "21 Aug 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great benefits: 9/80's, 401k match/pension, gym/cafeteria in Woodlands", "cons": "Bumbling bureaucracy with stagnant wages and no risk tolerance.  Compensation is linked to experience, not performance."}, {"review_title": "Good place to work", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "1 Oct 2017", "job_title": "Accountant in The Woodlands, TX", "duration": "N/A", "pros": "Very great company with a lot of benefit", "cons": "Non I can think of"}, {"review_title": "Lack of alot", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "15 Mar 2019", "job_title": "Fieldman II in Platteville, CO", "duration": "N/A", "pros": "Shift work, benefits and company truck .", "cons": "Where do i begin. If you are worthless, but kiss great b***, you will go far. People that know their job, takes the beating. Core values a joke, safety even worse. Remember, you are replaceable."}, {"review_title": "Great Company", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "23 Apr 2019", "job_title": "Production Engineer in Denver, CO", "duration": "N/A", "pros": "Great place to work! Great culture and people.", "cons": "None I can think of."}, {"review_title": "APC Review", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "12 Aug 2019", "job_title": "IT Systems Administrator in The Woodlands, TX", "duration": "N/A", "pros": "Culture, benefits, exciting work challenges", "cons": "Executive Board, slow to promote"}, {"review_title": "Great Company", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "27 Sept 2019", "job_title": "Senior Completions Engineer in Midland, TX", "duration": "N/A", "pros": "Teams were open to new ideas", "cons": "Sometimes they catered to employees too much"}, {"review_title": "Great Company", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "28 Jun 2012", "job_title": "Geoscient Tech", "duration": "N/A", "pros": "Benefits (PTO, Every other Friday off)", "cons": "Health Care compared to others in industry"}, {"review_title": "Fantastic company!", "rating": "5.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "5 Feb 2013", "job_title": "Senior ITS Administrator in The Woodlands, TX", "duration": "N/A", "pros": "Impact, Schedule, Peers, Culture, Comp", "cons": "i have found no cons"}], [{"review_title": "Sr. Document Control Specialist", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "22 Sept 2015", "job_title": "Senior Document Control Specialist in Houston, TX", "duration": "N/A", "pros": "The project team was excellent.", "cons": "Distance too far to The Woodlands."}, {"review_title": "Average", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Not bad, nice people, good city", "cons": "Wasn't the best, less prestige"}, {"review_title": "Engineer", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "8 Nov 2016", "job_title": "Anonymous Employee in Houston, TX", "duration": "N/A", "pros": "work life balance is strong", "cons": "technically weak with lots of professional managers"}, {"review_title": "Lots of opportunity", "rating": "5.0", "reviewer_affiliation": "Former Employee", "job_date": "8 Aug 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great pay and lots of benefits", "cons": "Management turnover making direction confusing"}, {"review_title": "Great Company", "rating": "4.0", "reviewer_affiliation": "Former Employee, more than 3 years", "job_date": "21 Jun 2018", "job_title": "Mecahnic in Williamsport, PA", "duration": "N/A", "pros": "Great benefits and PTO.", "cons": "Advancement was slow. Needed to be flexible about location."}, {"review_title": "Good company", "rating": "4.0", "reviewer_affiliation": "Current Employee, less than 1 year", "job_date": "26 May 2019", "job_title": "Land Analyst in Midland, TX", "duration": "N/A", "pros": "Great benefits and work life balance", "cons": "Being sold to oxy creates job uncertainty"}, {"review_title": "Very good", "rating": "3.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "22 Aug 2019", "job_title": "Engineer in Spring, TX", "duration": "N/A", "pros": "Good benefits and salary\r\n9-80 schedule\r\nGym facilities", "cons": "Culture is declining\r\nManagement \r\nCulture declining"}, {"review_title": "Excellent Company", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 5 years", "job_date": "7 Jun 2020", "job_title": "Staff Tax Analyst in The Woodlands, TX", "duration": "N/A", "pros": "Excellent pay and benefits and location", "cons": "Was bought out by another company"}, {"review_title": "Great Company", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "29 Jan 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great company to work for", "cons": "High-stress environment, but well-rewarded for it"}, {"review_title": "Great Company", "rating": "5.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "21 Jun 2016", "job_title": "Plant Foreman, Safety/PSM Coordinator, and Plant Operator in Odessa, TX", "duration": "N/A", "pros": "Great company pay and benefits", "cons": "I have no cons great company"}], [{"review_title": "Supportive Company", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "31 Jan 2018", "job_title": "Accounting Specialist III in The Woodlands, TX", "duration": "N/A", "pros": "supportive company with (mostly) great management.", "cons": "highly competitive environment for advancement"}, {"review_title": "n/a", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "2 Nov 2018", "job_title": "Anonymous Employee in The Woodlands, TX", "duration": "N/A", "pros": "good hours, benefits,  classes, gym membership", "cons": "too big,  to many meetings, changes daily"}, {"review_title": "Great Company", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "1 May 2019", "job_title": "Senior Financial Analyst", "duration": "N/A", "pros": "Good Benefits\r\nGood Comp\r\nGood Work life balance", "cons": "Cyclical nature of the industry"}, {"review_title": "Great company", "rating": "5.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "6 Sept 2019", "job_title": "IT Manager in Denver, CO", "duration": "N/A", "pros": "good people good balance good pay", "cons": "no longer an active company"}, {"review_title": "Offshore work on a production platform.", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Great workplace with opportunities for growth.", "cons": "No cons at this time."}, {"review_title": "very good", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "great company to work for", "cons": "not too many cons here now"}, {"review_title": "Rotational Accountant", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "3 May 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Excellent place to work at", "cons": "None that I know of"}, {"review_title": "Contactor", "rating": "4.0", "reviewer_affiliation": "Current Employee", "job_date": "16 Jul 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Competitive pay, nice boss and team", "cons": "Boring work, politics, bad cafe food"}, {"review_title": "Excellent employer", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 3 years", "job_date": "8 Feb 2019", "job_title": "Accountant in Houston, TX", "duration": "N/A", "pros": "Golden handshake perks\r\nOpen communication\r\nCollaborative workplace", "cons": "Career opportunities\r\nA bit wasteful with finances"}, {"review_title": "Great company", "rating": "5.0", "reviewer_affiliation": "Current Employee", "job_date": "13 Apr 2019", "job_title": "Senior Reservoir Engineer", "duration": "N/A", "pros": "Culture, pay, location, amenities", "cons": "Big company feel, internal politics heavy"}], [{"review_title": "Great company", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "6 May 2019", "job_title": "Measurement Technician", "duration": "N/A", "pros": "Great pay and time off.", "cons": "The company is in a merger."}, {"review_title": "Overall", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 1 year", "job_date": "17 Jan 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great culture, work life balance", "cons": "Can be tough to switch departments"}, {"review_title": "Apc", "rating": "4.0", "reviewer_affiliation": "Current Employee, more than 10 years", "job_date": "13 Mar 2016", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Great pay and benefits, good culture", "cons": "It is a corporate job."}, {"review_title": "oil and gas", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "N/A", "job_title": "N/A", "duration": "N/A", "pros": "Good Company to work for", "cons": "Oil downturns leaf to layoffs"}, {"review_title": "Reorganisition Organisation", "rating": "2.0", "reviewer_affiliation": "Former Employee, more than 8 years", "job_date": "7 Dec 2017", "job_title": "Geophysicist in Denver, CO", "duration": "N/A", "pros": "9/80's , attractive workforce,", "cons": "Bloated, political, process trumps production"}, {"review_title": "Mismanagement", "rating": "3.0", "reviewer_affiliation": "Current Employee, more than 8 years", "job_date": "1 May 2019", "job_title": "Psm Coordinator", "duration": "N/A", "pros": "Good people\r\nDecent benefits \r\nFlexible", "cons": "Most management is inept and do nothing"}, {"review_title": "Manager", "rating": "3.0", "reviewer_affiliation": "Former Employee", "job_date": "10 Sept 2018", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "Compensation and benefits; location, amenities", "cons": "Poor talent development and utilization"}, {"review_title": "Geologist", "rating": "1.0", "reviewer_affiliation": "Former Employee", "job_date": "28 Nov 2017", "job_title": "Anonymous Employee", "duration": "N/A", "pros": "None really come to mind other than that they pay fairly well and have decent benefits.", "cons": "Management is detached and dishonest.  Very much a “who you know in order to advance” company.  Back-stabbing.  Steer clear."}, {"review_title": "A joke", "rating": "1.0", "reviewer_affiliation": "Former Employee, more than 1 year", "job_date": "10 Jun 2017", "job_title": "Feldman II in Platteville, CO", "duration": "N/A", "pros": "Benefits, vacation are nice. Also some employees that were there to work as team members.", "cons": "Safety, favoritism, worthless managers, retalation, core values."}, {"review_title": "Got sold", "rating": "1.0", "reviewer_affiliation": "Current Employee, more than 5 years", "job_date": "10 Sept 2019", "job_title": "Engineer in Houston, TX", "duration": "N/A", "pros": "Work life balance and career opportunities", "cons": "Poor leadership lead to company being sold"}]]